{
  "title": "Scotiabank's Group Head & Chief Risk Officer Phil Thomas to Speak at the 2025 RBC Capital Markets Global Financial Institutions Conference",
  "url": "https://scotiabank.investorroom.com/2025-02-26-Scotiabanks-Group-Head-Chief-Risk-Officer-Phil-Thomas-to-Speak-at-the-2025-RBC-Capital-Markets-Global-Financial-Institutions-Conference",
  "date": "2025-02-26",
  "short_description": "Phil Thomas, Scotiabank's Group Head & Chief Risk Officer, will be participating in a fireside chat at the 2025 RBC Capital Markets Global Financial Institutions Conference in New York on March...",
  "content": "TORONTO,Feb. 26, 2025/CNW/ - Phil Thomas, Scotiabank's Group Head & Chief Risk Officer, will be participating in a fireside chat at the 2025 RBC Capital Markets Global Financial Institutions Conference inNew Yorkon March 5th, 2025. Mr. Thomas is scheduled to participate from 8:40 a.m. to 9:10 a.m. ET.\n\nInterested parties may listen to Mr. Thomas' session live onthe Events and Presentations sectionof Scotiabank's Investor Relations page atwww.scotiabank.com/investorrelations. An archived audio webcast will be available after the conference.\nAbout Scotiabank\nScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-02-26-Scotiabanks-Group-Head-Chief-Risk-Officer-Phil-Thomas-to-Speak-at-the-2025-RBC-Capital-Markets-Global-Financial-Institutions-Conference",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}