{
  "title": "Scotiabank Announces Dividend on Outstanding Shares",
  "url": "https://scotiabank.investorroom.com/2025-02-25-Scotiabank-Announces-Dividend-on-Outstanding-Shares",
  "date": "2025-02-25",
  "short_description": "Scotiabank today announced a dividend on the outstanding shares of the Bank, payable April 28, 2025, to shareholders of record at the close of business on April 1, 2025: Common Shares Dividend No....",
  "content": "TORONTO,Feb. 25, 2025/CNW/ - Scotiabank today announced a dividend on the outstanding shares of the Bank, payableApril 28, 2025, to shareholders of record at the close of business onApril 1, 2025:\n\nCommon Shares\nHolders may elect to receive their dividends in common shares of the Bank in lieu of cash dividends, in accordance with the Bank's Shareholder Dividend and Share Purchase Plan (the \"Plan\"). Under the Plan, the Bank determines whether the additional common shares will be purchased on the open market or issued by the Bank from treasury.\nAs previously announced, until such time as the Bank elects otherwise, the Bank has discontinued the issuance of common shares from treasury under the Plan. Purchases of common shares under the Plan will be made by Computershare Trust Company ofCanada, as agent under the Plan, in the secondary market in accordance with the provisions of the Plan. All brokerage commissions or service charges in connection with such purchases will be paid by the Bank.\nAbout Scotiabank\nScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-02-25-Scotiabank-Announces-Dividend-on-Outstanding-Shares",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}