{
  "title": "Scotia Global Asset Management announces February 2025 cash distributions for Scotia ETFs",
  "url": "https://scotiabank.investorroom.com/2025-02-18-Scotia-Global-Asset-Management-announces-February-2025-cash-distributions-for-Scotia-ETFs",
  "date": "2025-02-18",
  "short_description": "Scotia Global Asset Management announced today the February 2025 cash distributions for the Scotia ETFs listed on the Cboe Canada exchange, which pay on a monthly basis. Unitholders of record on...",
  "content": "TORONTO,Feb. 18, 2025/CNW/ - Scotia Global Asset Management announced today theFebruary 2025cash distributions for the Scotia ETFs listed on the Cboe Canada exchange, which pay on a monthly basis. Unitholders of record onFebruary 25, 2025will receive a cash distribution payable onMarch 4, 2025, as noted below.\n\nScotia ETF name\nTickersymbol\nCash distributionper unit ($)\nDistributionfrequency\nScotia Canadian Bond Index Tracker ETF\nSITB\n0.041\nMonthly\nScotia Responsible Investing Canadian Bond Index ETF\nSRIB\n0.042\nMonthly\nFor more information on the Scotia ETFs, please visit theScotia Exchange Traded Funds (ETF) website.\nCommissions, trailing commissions, management fees and expenses may be associated with mutual fund investments, including exchange-traded funds (ETFs). Please read the prospectus before investing. Mutual funds and ETFs are not guaranteed, their values change frequently and past performance may not be repeated.\nAbout Scotia Global Asset ManagementScotia Global Asset Management® is a business name used by 1832 Asset Management L.P., a limited partnership, the general partner of which is wholly owned by Scotiabank. Scotia Global Asset Management offers a range of wealth management solutions, including mutual funds, ETFs, liquid alternative mutual funds, private asset funds and customized investment solutions for institutions and managed asset programs. For more information, please visitwww.scotiagam.com.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atOctober 31, 2024), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-02-18-Scotia-Global-Asset-Management-announces-February-2025-cash-distributions-for-Scotia-ETFs",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}