{
  "title": "Beyond a will: Canadians not discussing final years",
  "url": "https://scotiabank.investorroom.com/2025-02-06-Beyond-a-will-Canadians-not-discussing-final-years",
  "date": "2025-02-06",
  "short_description": "Many Canadians are not completely prepared when it comes to their later years, according to a recent survey by Scotiatrust®: Wills and Estate Planning Survey*. Of those surveyed, forty-one per...",
  "content": "Survey shows many Canadians uncomfortable with end-of-life discussions\nTORONTO,Feb. 6, 2025/CNW/ - Many Canadians are not completely prepared when it comes to their later years, according to a recent survey byScotiatrust®: Wills and Estate Planning Survey*. Of those surveyed, forty-one per cent do not have a power of attorney (POA) document that names someone to manage their finances or other assets if they become incapacitated, and 47 per cent lack a POA regarding their personal and medical care.\n\n\"As we continue to live longer, and not always in great health, we could be faced with illness or incapacitation and it's imperative to be prepared and ensure your wishes are met,\" saidRob McGavin, Managing Director, Scotiatrust. \"Having a POA helps to guide your loved ones in the event something unexpected happens, when they are likely to be in an emotional state.\"\nUncomfortable conversationsSixty-nine per cent of respondents said that they have an up-to-date will.  Of those who do not have a will, more than half of them (55 per cent) said they have not created one yet because they have not gotten around to it. And most respondents haven't talked to their loved ones about important end-of-life issues:\nRelationship statusAmongst those surveyed, there were notable differences in planning based on relationship status:\n\"Having conversations sooner and being transparent with your loved ones or advisor will help you manage the estate planning process and make critical decisions, easier,\" said McGavin. \"You are giving yourself a voice when you are no longer around or able to.\"\nLearn moreRead the fullwhitepaperhere.\nWith a unique team-based approach grounded in research, Scotia Wealth Management delivers a Total Wealth Plan for clients — an approach that is evolving to reflect longevity, health and wellbeing considerations for clients. Learn more about Scotiatrust and Scotia Wealth Management:https://www.scotiawealthmanagement.com/ca/en.html.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atOctober 31, 2024), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\n*Scotiatrust: Wills and Estate Planning Survey reached Canadians over the age of 50 with at least$500,000in investable assets.\nSOURCE Scotiabank\n",
  "id": "2025-02-06-Beyond-a-will-Canadians-not-discussing-final-years",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}