{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2021-08-13",
  "period": "",
  "accession_number": "0001104659-21-105120",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-21-105120-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) August 13, 2021 Citigroup Inc\n. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                        ​             10013               \n  NY(Address of principal                   (Zip Code)          \n  executive offices)                                            \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of\nthis chapter) or Rule 12b-2 of the Securities Exchange Act of\n1934 (§240.12b-2 of this chapter). Emerging growth company ☐ If\nan emerging growth company, indicate by check mark if the\nregistrant has elected not to use the extended transition period\nfor complying with any new or revised financial accounting\nstandards provided pursuant to Section 13(a) of the Exchange\nAct. ☐\n                         CITIGROUP INC.                         \n                                                                \n                   Current Report on Form 8-K                   \nItem 5.02 Departure of Directors or Certain Officers; Election\nof Directors; Appointment of Certain Officers; Compensatory\nArrangements of Certain Officers.\n\nCitigroup Inc. (Citi) has begun a Transformation Program across\nthe firm to drive excellence in its risk and control\nenvironment, its operations and its service to clients.\nColleagues at all levels are expected to play an active role in\nachieving these standards, and senior leaders will be\naccountable for driving progress. Citi’s compensation philosophy\nincludes the accountability senior leaders at the firm have –\nindividually and collectively – to meet the milestones required\nfor a successful Transformation. Lack of sufficient progress\nwill negatively affect the compensation of senior leaders, and\nsenior leaders will have the opportunity to benefit from the\nachievement of Citi’s Transformation goals.\n\nConsistent with this compensation philosophy, on August 13,\n2021, the Personnel and Compensation Committee of Citi’s Board\nof Directors approved a program for Mark Mason, Chief Financial\nOfficer, Paco Ybarra, CEO, Institutional Clients Group, and\nMichael Whitaker, Head of Enterprise Operations and Technology,\nthat provides an opportunity for each to earn additional\ncompensation based on the achievement of Citi’s Transformation\ngoals from August 2021 through December 2024 and satisfaction of\nother conditions. Under this program, Messrs. Mason, Ybarra and\nWhitaker each have the opportunity to earn up to an additional\n$5 million, payable based on collective performance in respect\nof Citi’s Transformation goals over a multi-year performance\nperiod, divided into three parts, with payment allocated as\nfollows: 25% in February 2023, 25% in February 2024 and 50%\nFebruary 2025.\n\nThe program also will apply to other senior leaders critical to\nhelping deliver a successful Transformation, excluding Jane\nFraser, Citi’s Chief Executive Officer, with the value varying\nbased on individual compensation levels. The portion of the\ntarget, if any, that the executives earn is tied to submission\nof suitable Transformation plans to Citi’s regulators in the\nU.S., timely execution of required interim measures, timely\nexecution of highest-priority risk-reduction Transformation plan\ncomponents, sustainable metrics in program execution,\nresourcing, risk reduction, and data governance, and\ndemonstrable, quality leadership in all job specific aspects of\nthe Transformation. Awards actually earned may be less than, but\nnot greater than, the target. The Committee will evaluate the\ncollective performance of program participants against these\nmeasures, with the baseline payout percentage being generally\nconsistent across all participants.\n\nPayment for each part will be in cash, in a lump sum, with the\nthird payment indexed to changes in the value of Citi’s common\nstock from the award date through the payment date.\n\nPayments in the event of any category of employment termination\nor change in job title or employment status are subject to\nCiti’s discretion. Cancellation and clawback is provided for in\nthe event of misconduct and certain other circumstances.\n                               2                                \nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    Description                                        \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  ​           ​                                                   \n  104        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \n3\n\nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                        ​     CITIGROUP INC.                   \n  ​                        ​     ​                                 \n  Dated: August 13, 2021  ​     ​                                 \n ────────────────────────────────────────────────────────────── \n  ​                        By:  /s/ Rohan Weerasinghe            \n                               Name: Rohan WeerasingheTitle:    \n  ​                        ​     General Counsel and Corporate    \n                               Secretary                        \n                                                                \n4\n"
}