{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2020-09-11",
  "period": "",
  "accession_number": "0001104659-20-104440",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-20-104440-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) September 9, 2020 Citigroup\nInc . (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                        ​             10013               \n  NY(Address of principal                   (Zip Code)          \n  executive offices)                                            \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ◻\n\nCITIGROUP INC. Current Report on Form 8-K Item 5.02. Departure\nof Directors or Certain Officers; Election of Directors;\nAppointment of Certain Officers; Compensatory Arrangements of\nCertain Officers. On September 9, 2020, Michael L. Corbat\nannounced that he plans to retire from his positions as Citi’s\nChief Executive Officer and a member of its Board of Directors\n(Board) in February of 2021. In connection with the retirement\nof Mr. Corbat, Citi’s Board appointed Jane Fraser as Citi’s new\nChief Executive Officer, effective as of the effective date of\nMr. Corbat’s retirement, and as a member of its Board, effective\nSeptember 10, 2020. Ms. Fraser, age 53, is currently the\nPresident of Citi and the Chief Executive Officer of Global\nConsumer Banking. Her global responsibilities include all\nConsumer businesses in 19 countries, including Retail Banking\nand Wealth Management, Credit Cards, Mortgages and the\nassociated Operations and Technology. Before this role, she was\nthe Chief Executive Officer of Citi’s Latin American region from\n2015 to 2019. From 2013 to 2015, she was the Chief Executive\nOfficer of the U.S. Consumer and Commercial Banking and\nCitiMortgage. From 2009 to 2013, Jane served as the Chief\nExecutive Officer of Citi's Private Bank. Prior to that, Jane\nwas the Global Head of Strategy and Mergers & Acquisitions for\nCiti from 2007 to 2009. She joined Citi in 2004 in the Corporate\nand Investment Banking division. Before joining Citi, Jane was a\nPartner at McKinsey & Company. She started her career at Goldman\nSachs in the Mergers & Acquisitions department in London and\nthen worked for Asesores Bursátiles in Madrid, Spain. Jane\nFraser is a member of the Board of Dean’s Advisors at Harvard\nBusiness School, serves on Stanford University’s Global Advisory\nCouncil and is a member of the Council on Foreign Relations.\nJane has an M.B.A. from Harvard Business School and an M.A. in\neconomics from Cambridge University. Item 9.01 Financial\nStatements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit Number    ​                                            \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.1              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  104.1             See the cover page of this Current Report   \n                    on Form 8-K, formatted in Inline XBRL.      \n                                                                \n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: September 11,   \n  2020​​​By:/s/ Rohan Weerasinghe​​Rohan Weerasinghe​​General Counsel  \n  and Corporate Secretary​​                                       \n                                                                \n"
}