{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2023-02-21",
  "period": "",
  "accession_number": "0001410578-23-000143",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001410578-23-000143-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) February 16, 2023 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01. Other\nEvents. On February 16, 2023 (the Grant Date), the Compensation,\nPerformance Management and Culture Committee of the Citigroup\nInc. (Citi) Board of Directors (the Compensation Committee)\napproved incentive compensation awards for 2022 performance to\nCiti's Chief Executive Officer (CEO) Jane Fraser. In setting Ms.\nFraser's incentive compensation for 2022, the Compensation\nCommittee considered Ms. Fraser's individual performance,\nincluding the following highlights:\n                                                                \n     2022 was Ms. Fraser’s first full calendar year as our      \n     CEO. She has established a clear set of priorities for     \n     Citi to increase shareholder value over time. These        \n  ●  priorities are Citi’s Transformation, Strategic Refresh,   \n     and Improved Culture and Talent. Execution of this         \n     strategy will generate improved returns over the           \n     medium-term.                                               \n                                                                \n                                                                \n     Notwithstanding challenging macroeconomic and              \n     geopolitical developments, under Ms. Fraser’s leadership   \n  ●  Citi made solid progress on each of our priorities, and    \n     the Compensation Committee recognizes the strategic        \n     direction that took shape during 2022.                     \n                                                                \n                                                                \n     Two of our major goals for 2022 were to put a strategic    \n     plan in place focused on five interconnected businesses    \n  o  designed to create long-term value for our shareholders    \n     and to simplify the firm. We made significant progress     \n     during 2022 towards these goals by:                        \n                                                                \n                                                                \n      Closing sales of five consumer businesses in Australia,   \n  ◾  the Philippines, Thailand, Malaysia and Bahrain,          \n      including three in the fourth quarter of 2022.            \n                                                                \n                                                                \n      Making substantial progress in winding down our consumer  \n  ◾  business in Korea, reducing our overall exposure in       \n      Russia, and announcing the wind down of our consumer      \n      business in China.                                        \n                                                                \n                                                                \n  ◾  Signing four additional consumer markets sales in 2022    \n      and working towards closing those in 2023.                \n                                                                \n                                                                \n  ◾  Re-segmenting the organization to align with Citi’s       \n      strategy.                                                 \n                                                                \n                                                                \n     During 2022 we also brought in very strong talent, met     \n  o  our representation goals, and strengthened our culture of  \n     enhanced accountability, excellence, and shareholder       \n     alignment across Citi.                                     \n                                                                \n                                                                \n     Citi’s CEO has made the strengthening of Citi’s risk and   \n     control environment a strategic priority, and as a result  \n  o  of work to date, management has made progress on           \n     addressing the primary drivers of our risk management      \n     issues.                                                    \n                                                                \n                                                                \n     In addition to the foregoing, an ongoing priority for      \n     Citi management is the remediation of the issues           \n     identified in the Consent Orders issued in 2020 by the     \n     Federal Reserve Board and the Office of the Comptroller    \n     of the Currency. Citi provides both regulators on an       \n  o  ongoing basis information regarding its plans and          \n     progress, and continues to work constructively with the    \n     regulators to reflect their feedback on remediation        \n     efforts. The Citi Board of Directors has determined that   \n     our plans are responsive to our objectives and that we     \n     continue to make progress on our execution.                \n                                                                \n                                                                \n     In making its determinations, the Compensation Committee   \n     considered Citi’s absolute and relative total shareholder  \n  ●  returns for 2022, including the various elements of        \n     Citi’s executive compensation program that tie             \n     compensation to total shareholder returns.                 \n                                                                \n2\n                                                                \n     In setting Ms. Fraser’s incentive compensation for 2022,   \n  ●  in addition to the foregoing performance assessments, the  \n     Compensation Committee took into account competitive       \n     market levels of pay for CEOs of peer institutions.        \n                                                                \nCiti’s 2022 financial performance highlights included:\n                                                  \n  ●  Revenues of $75.3 billion, up 5% from 2021.  \n                                                  \n                                                       \n  ●  Net income of $14.8 billion, down 32% from 2021.  \n                                                       \n                                                       \n  ●  Earnings per share of $7.00, down 31% from 2021.  \n                                                       \n                                                                \n     The return of $7.3 billion in capital to Citi’s common     \n  ●  shareholders, and a Common Equity Tier 1 Capital (CET1)    \n     ratio of 13.0%.                                            \n                                                                \nThe Compensation Committee increased the portion of Ms. Fraser’s\nincentive compensation that will be paid in deferred Citi common\nstock awards from 20% in 2021 to 35% for 2022, and reduced the\nportion of Ms. Fraser’s incentive compensation that will be paid\nin cash from 30% to 15%. This change further aligns Ms. Fraser’s\nincentive compensation with the interests of shareholders. For\n2022, the Compensation Committee determined that Ms. Fraser’s\ncompensation is $24.5 million, consisting of a flat base salary\nof $1.5 million and a total incentive award of $23 million as\nindicated in the following table.\n                                                                \n                 CEO Compensation for 2022                      \n  Element        Form                            Amount         \n  Base Salary    Cash                            $1.5 million   \n  Cash           Cash                                           \n  Incentive      (15% of total incentive         $3.45 million  \n                 award)                                         \n                 Deferred Stock                                 \n  Deferred       (35% of total incentive                        \n  Incentive      award) Vests ratably over 4     $8.05 million  \n                 years subject to performance                   \n                 conditions                                     \n                 Performance Share Units                        \n                 (PSUs)                                         \n                 (50% of total incentive                        \n                 award) Vests based on                          \n                 equally weighted return on      $11.5 million  \n                 tangible common equity and                     \n                 tangible book value per                        \n                 share performance over 3                       \n                 years                                          \n  Total                                          $24.5 million  \n                                                                \nConsistent with prior years, the number of shares of deferred\nstock granted for 2022 was determined by dividing the nominal\namount awarded in deferred stock by the average of the closing\nprices of Citi common stock on the five business days\nimmediately preceding the Grant Date ($50.904). The target\nnumber of PSUs was also determined by dividing the nominal\namount awarded as PSUs by the same five-day average price.\nAdditional information regarding Citi’s incentive compensation\nprograms, including an explanation of the material elements of\nthe compensation for 2022 awarded to Ms. Fraser and the other\nnamed executive officers, will be presented in Citi’s 2023 Proxy\nStatement for the Annual Meeting of Stockholders, which is\nexpected to be filed with the U.S. Securities and Exchange\nCommission in March 2023.\n\n3\n\nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  ​           ​                                                   \n  101        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \n4\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: February 21,    \n  2023​​​By:/s/ Brent McIntosh​​Brent McIntosh​​General Counsel and    \n  Corporate Secretary​​​                                           \n                                                                \n5\n"
}