{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2025-02-03",
  "period": "",
  "accession_number": "0001104659-25-008670",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-25-008670-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) January 31, 2025 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.2 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 5.02 Departure of\nDirectors or Certain Officers; Election of Directors;\nAppointment of Certain Officers; Compensatory Arrangements of\nCertain Officers. On January 31, 2025, the Board of Directors\n(the Board) of Citigroup Inc. (Citigroup) elected Titilope Cole\nas a director of Citigroup. Ms. Cole is the former Head of\nLegacy Franchises of Citigroup. Ms. Cole also serves on the\nBoard of DataDog, Inc., a provider of cloud monitoring and\nsecurity solutions. Also, on January 31, 2025, the Board\nappointed Ms. Cole to the following Committees of the Board: the\nRisk Management Committee, the Technology Committee and the\nTransformation Oversight Committee. Ms. Cole was also appointed\na Board member of Citibank, N.A., effective February 3, 2025.\nBecause Ms. Cole previously served as the former Head of Legacy\nFranchises, the Board determined that she is not independent in\naccordance with the director independence standards established\nunder Citigroup’s Corporate Governance Guidelines, which are\nintended to comply with the New York Stock Exchange corporate\ngovernance rules, and all other applicable laws, rules and\nregulations. There are no family relationships between Ms. Cole\nand any officer or other director of Citigroup or any related\nparty transactions involving Ms. Cole and Citigroup. Ms. Cole is\na party to compensatory agreements arising from her prior\nemployment at Citigroup providing for the delivery to her in the\nfuture of shares of Citigroup common stock, subject to certain\nconditions. Such compensation was approved by the Compensation,\nPerformance Management and Culture Committee of Citigroup’s\nBoard as earned in the ordinary course in connection with her\nemployment. There is no arrangement or understanding between Ms.\nCole and any other person pursuant to which she was selected as\na director. Ms. Cole will receive compensation as a non-employee\ndirector in accordance with Citigroup’s non-employee director\ncompensation practices described in “Proposal 1: Election of\nDirectors – Directors’ Compensation” of Citigroup’s Annual Proxy\nStatement filed with the U.S. Securities and Exchange Commission\non March 19, 2024. A copy of Citigroup’s press release relating\nto the election of Ms. Cole as a director is being furnished as\nExhibit 99.1 to this Current Report on Form 8-K. Item 9.01\nFinancial Statements and Exhibits. (d) Exhibits\n                                                                \n                    ​                                            \n  Exhibit Number    ​                                            \n  ​                  Citigroup Inc. Press Release dated          \n  99.1              February 3, 2025.                           \n ────────────────────────────────────────────────────────────── \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.2              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  104               The cover page of this Current Report on    \n                    Form 8-K, formatted in Inline XBRL.         \n                                                                \n2\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: February 3,     \n  2025​​​By:/s/ Brent J. McIntosh​​Brent J. McIntosh​​Chief Legal      \n  Officer & Corporate Secretary​​​                                 \n                                                                \n3\n"
}