{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2023-09-13",
  "period": "",
  "accession_number": "0001104659-23-100516",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-23-100516-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) September 13, 2023 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.2 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17\nCFR§230.405) or Rule 12b-2 of the Securities Exchange Act of\n1934 (17 CFR §240.12b-2). Emerging growth company ☐ If an\nemerging growth company, indicate by check mark if the\nregistrant has elected not to use the extended transition period\nfor complying with any new or revised financial accounting\nstandards provided pursuant to Section 13(a) of the Exchange\nAct. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 5.02 Departure of\nDirectors or Certain Officers; Election of Directors;\nAppointment of Certain Officers; Compensatory Arrangements of\nCertain Officers. On September 13, 2023, Citigroup Inc. (Citi)\nannounced the below management changes, effective as of such\ndate.\n                                                                \n     Peter Babej will no longer serve as Chief Executive        \n     Officer of Citi’s Asia Pacific region. Mr. Babej will      \n     serve as Citi’s Interim Head of Banking and as a member    \n  ●  of Citi’s Executive Management Team, reporting to Citi’s   \n     Chief Executive Officer, Jane Fraser, through his          \n     retirement effective in the first half of 2024 on a date   \n     to be determined.                                          \n                                                                \n                                                                \n     Anand Selvakesari will no longer serve as Chief Executive  \n     Officer of Personal Banking and Wealth Management (PBWM)   \n  ●  of Citi. Mr. Selvakesari will continue in his role as      \n     Citi’s Chief Operating Officer, and as a member of Citi’s  \n     Executive Management Team, reporting to Citi’s Chief       \n     Executive Officer.                                         \n                                                                \n                                                                \n     Paco Ybarra, who as previously disclosed (see Exhibit      \n     99.1) will retire in the first half of 2024 on a date to   \n     be determined, will no longer serve as Chief Executive     \n     Officer of the Institutional Clients Group (ICG) of Citi   \n  ●  and will cease to be a Citi executive officer (Section 16  \n     insider).  Mr. Ybarra will become a Senior Advisor to      \n     Citi’s Executive Management Team and will serve in that    \n     capacity though his retirement date, reporting to Citi’s   \n     Chief Executive Officer.                                   \n                                                                \nItem 8.01 Other Information. In connection with the management\nchanges noted in Item 5.02 above, on September 13, 2023, Citi\nalso announced it will be making changes to its operating model\nthat will simplify the firm and will further align its\norganizational structure with its business strategy. This new\noperating model will elevate the leaders of Citi’s five key\nbusinesses, who will report directly to Citi’s Chief Executive\nOfficer, and will eliminate management layers. Citi’s new\noperating model will involve elimination of ICGand PBWM, as of\nthe fourth quarter of 2023, and will result in the following\nfive new reportable operating segments:\n                                                                \n  ●  Services, consisting of Treasury and Trade Solutions and   \n     Securities Services.                                       \n                                                                \n                                                              \n  ●  Markets, consisting of Fixed Income and Equity markets.  \n                                                              \n                                                                \n  ●  Banking, consisting of Investment banking and Corporate    \n     banking.                                                   \n                                                                \n                                                                \n  ●  Global Wealth Management, consisting of Private bank,      \n     Wealth at Work and Citigold.                               \n                                                                \n                                                                \n  ●  U.S. Personal Banking, consisting of Cards (Branded cards  \n     and Retail services) and Retail banking.                   \n                                                                \nActivities not assigned to the above reportable operating\nsegments will be included in All Other, which will consist of\nLegacy Franchises (Asia consumer banking, Mexico consumer\nbanking and Mexico small business and middle-market banking and\nLegacy Holdings Assets) and Corporate/Other. As a result of\nthese changes, Citi will revise its financial reporting\nstructure to align with the management and operating model\nchanges, effective as of the end of the fourth quarter of 2023.\nAs part of its overall simplification initiatives, in addition\nto the elimination of the ICGand PBWMlayers, Citi will also\nconsolidate its regional structure, creating one international\ngroup, centralize client capabilities and streamline its global\nstaff functions. Citi expects to incur charges through the first\nhalf of 2024 as additional phases of its overall simplification\ninitiatives are finalized and implemented.\n\n2\n\nItem 9.01 Financial Statements and Exhibits. (d) Exhibits\n                                                                \n  Exhibit    ​                                                   \n  Number     Citigroup Inc. Current Report on Form 8-K dated    \n  99.1       August 3, 2023.                                    \n ────────────────────────────────────────────────────────────── \n             Citigroup Inc. securities registered pursuant to   \n  99.2       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  104        The cover page of this Current Report on Form      \n             8-K, formatted in Inline XBRL.                     \n                                                                \n3\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: September 13,   \n  2023​​​By:/s/ Brent J. McIntosh​​Brent J. McIntosh​​Chief Legal      \n  Officer and Corporate Secretary​​​                               \n                                                                \n4\n"
}