{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2022-02-14",
  "period": "",
  "accession_number": "0001104659-22-022820",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-22-022820-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) February 10, 2022 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01. Other\nEvents. On February 10, 2022 (the Grant Date), the Personnel and\nCompensation Committee of the Citigroup Inc. (Citi) Board of\nDirectors (the Compensation Committee) approved incentive\ncompensation awards for 2021 performance to Citi’s Chief\nExecutive Officer (CEO) Jane Fraser. In setting Ms. Fraser’s\nincentive compensation for 2021, the Compensation Committee\nconsidered the following:\n                                                                \n     Ms. Fraser’s tenure as CEO commenced on February 26,       \n     2021.  She has quickly worked to establish a clear set of  \n     priorities for Citi that are intended to increase          \n     shareholder value over time.  These priorities are         \n     centered around Citi’s Transformation, Strategic Refresh,  \n     and Culture and Talent.  Execution of this strategy is     \n     expected to generate excess capital, which Citi can then   \n  ●  return to shareholders.                                    \n ────────────────────────────────────────────────────────────── \n                                                                \n                                                                \n     In April, Citi announced that it would exit 13 consumer    \n     markets in Asia, Europe and the Middle East and focus on   \n  ●  wealth management and its institutional business in those  \n     regions.  Similarly, Citi recently announced its           \n     intention to focus its franchise in Mexico on its          \n     Institutional and Private Bank clients                     \n                                                                \n                                                                \n     Consistent with those strategic actions, Citi is creating  \n     a new Personal Banking and Wealth Management (PBWM)        \n  ●  operating segment.  This is intended to align Citi’s       \n     organization and financial reporting with its refreshed    \n     strategy and to enable investors and others to better      \n     understand the performance of Citi’s businesses.           \n                                                                \n                                                                \n     In parallel with the strategic actions noted above, Citi   \n     has been focused on meeting the expectations of its        \n     regulators to address the Consent Orders entered into      \n  ●  with the Federal Reserve Board and the Office of the       \n     Comptroller of the Currency in October 2020.  Citi’s       \n     plans to address the Consent Orders were submitted to      \n     both regulators in the third quarter of 2021, and Citi     \n     has been refining and executing on those plans.            \n                                                                \n                                                                \n     Ms. Fraser has also put a renewed emphasis on Citi’s       \n     Environmental, Social and Governance practices.  Most      \n  ●  notably, she fulfilled a pledge she made on her first day  \n     as CEO of presenting an initial plan to achieve net zero   \n     greenhouse gas (GHG) emissions by 2050.                    \n                                                                \nCiti’s 2021 financial performance highlights included:\n                                                              \n  ●  Full year revenues of $71.9 billion, down 5% from 2020.  \n                                                              \n                                                                \n     Net income for the full year of $22.0 billion, primarily   \n  ●  reflecting an allowance for credit loss (ACL) release      \n     driven by continued improvement in both the macroeconomic  \n     environment and portfolio credit quality.                  \n                                                                \n                                              \n  ●  Full year earnings per share of $10.14.  \n                                              \n                                                                \n     The return of nearly $12 billion in capital to Citi’s      \n     common shareholders, and growth of its book value per      \n  ●  share by 7% to $92.21.  Citi ended the year with a Common  \n     Equity Tier 1 Capital (CET1) ratio of 12.3%, based on the  \n     Basel III Standardized Approach framework.                 \n                                                                \nUnderpinning the foregoing specific priorities, Ms. Fraser’s\nindividual performance in respect of four performance pillars –\nFinancial, Leadership, Client and Franchise, and Risk and\nControls – her focus on establishing a culture of enhanced\naccountability and excellence across Citi, and competitive\nmarket levels of pay were considered by the Compensation\nCommittee. The Compensation Committee also increased the portion\nof Ms. Fraser’s incentive compensation that will be paid in\nPerformance Share Units in 2021 from 35% to 50%.\n\n2\n\nThe Compensation Committee determined that Ms. Fraser’s\ncompensation for 2021 is $22.5 million, consisting of a base\nsalary of $1.333 million and a total incentive award of $21.167\nmillion. The base salary reflects amounts received at the\nannualized rate of $1.5 million for the 10 months of the year\nduring which she was CEO. The total incentive award was\ndelivered in a mix of cash, deferred stock awarded under Citi’s\nCapital Accumulation Program (CAP), and Performance Share Units\n(PSUs), as indicated in the following table:\n                                                                \n                      CEO Compensation for                      \n                      2021                                      \n  Element             Form                     Amount           \n  Base Salary         Cash                     $1.333 million   \n                      Cash                                      \n  Cash Incentive      (30% of total incentive  $6.350 million   \n                      award)                                    \n                      Deferred Stock                            \n                      (20% of total incentive                   \n  Deferred Incentive  award) Vests ratably     $4.233 million   \n                      over 4 years subject to                   \n                      performance conditions                    \n                      Performance Share Units                   \n                      (50% of total incentive                   \n                      award) Vests based on                     \n                      equally weighted return                   \n                      on tangible common       $10.584 million  \n                      equity and tangible                       \n                      book value per share                      \n                      performance over 3                        \n                      years                                     \n  Total                                        $22.500 million  \n                                                                \nConsistent with prior years, the number of shares of deferred\nstock granted for 2021 was determined by dividing the nominal\namount awarded in deferred stock by the average of the closing\nprices of Citi common stock on the five business days\nimmediately preceding the Grant Date ($66.532). The target\nnumber of PSUs was also determined by dividing the nominal\namount awarded as PSUs by the same five-day average price.\nAdditional information regarding Citi’s incentive compensation\nprograms, including an explanation of the material elements of\nthe compensation for 2021 awarded to Ms. Fraser and the other\nnamed executive officers, will be presented in Citi’s 2022 Proxy\nStatement, which is expected to be filed with the U.S.\nSecurities and Exchange Commission in March 2022. Item 9.01\nFinancial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  ​           ​                                                   \n  101        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \n3\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: February 14,    \n  2022​​​By:/s/ Brent McIntosh​​Brent McIntosh​​General Counsel &      \n  Corporate Secretary​​​                                           \n                                                                \n4\n"
}