{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2021-08-09",
  "period": "",
  "accession_number": "0001104659-21-102151",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-21-102151-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) August 9, 2021 Citigroup Inc .\n(Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                        ​             10013               \n  NY(Address of principal                   (Zip Code)          \n  executive offices)                                            \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of\nthis chapter) or Rule 12b-2 of the Securities Exchange Act of\n1934 (§240.12b-2 of this chapter). Emerging growth company ☐ If\nan emerging growth company, indicate by check mark if the\nregistrant has elected not to use the extended transition period\nfor complying with any new or revised financial accounting\nstandards provided pursuant to Section 13(a) of the Exchange\nAct. ☐\n                         CITIGROUP INC.                         \n                                                                \n                   Current Report on Form 8-K                   \nItem 8.01 Other Events\n\nAs part of its previously announced intent to exit consumer\nfranchises in 13 markets acrossAsiaandEMEA, Citigroup Inc.\n(Citi) completed negotiations to sell its Australia consumer\nbanking business and, having received approval from the Citi\nBoard of Directors, entered into a definitive sales agreement on\nAugust 9, 2021. The business, which is part of Citi’sGlobal\nConsumer Bankingsegment, had approximately $9.0 billion of\nassets including $8.9 billion of loans (net of allowance), and\n$6.8 billion of deposits as of June 30, 2021. The sale, which is\nsubject to regulatory approvals and other closing conditions, is\nexpected to occur in the first half of 2022. In the third\nquarter of 2021, the business will be reported as held-for-sale\n(HFS). As a result, Citi’s third quarter 2021 financial results\nwill include an approximate pretax loss on sale of $670 million\n($580 million after-tax), with both amounts subject to closing\nadjustments. The loss on sale primarily reflects the impact of a\npretax $610 million currency translation adjustment (CTA) loss\n(net of hedges) already reflected in the Accumulated Other\nComprehensive Income (AOCI) component of equity. Upon closing,\nthe CTA-related balance would be removed from the AOCI component\nof equity, resulting in a neutral impact from CTA to Citi’s\nCommon Equity Tier 1 Capital. Ultimately, the sale is expected\nto result in an improvement in Citi’s Common Equity Tier 1\nCapital ratio due to the reduction in associated risk weighted\nassets.\n\nCertain statements in this current report on Form 8-K are\n“forward-looking statements” within the meaning of the rules and\nregulations of the U.S. Securities and Exchange Commission\n(SEC). These statements are based on management’s current\nexpectations and are subject to uncertainty and changes in\ncircumstances. These statements are not guarantees of future\nresults or occurrences. Actual results and capital and other\nfinancial condition may differ materially from those included in\nthese statements due to a variety of factors. These factors\ninclude, among others, consummation of the planned sale of the\nAustralia consumer banking business, including obtaining\nregulatory approvals and satisfaction of other closing\nconditions, the impact of closing adjustments, realization of\nthe expected impacts on capital, and the precautionary\nstatements included in this current report. These factors also\nconsist of those contained in Citi’s filings with the SEC,\nincluding without limitation the “Risk Factors” section of\nCiti’s 2020 Form 10-K. Any forward-looking statements made by or\non behalf of Citi speak only as to the date they are made, and\nCiti does not undertake to update forward-looking statements to\nreflect the impact of circumstances or events that arise after\nthe date the forward-looking statements were made.\n\nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    Description                                        \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  ​           ​                                                   \n  104        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                       ​     CITIGROUP INC.                    \n  ​                       ​     ​                                  \n  Dated: August 9, 2021  ​     ​                                  \n ────────────────────────────────────────────────────────────── \n  ​                       By:  /s/ Johnbull E. Okpara            \n                              Name: Johnbull E. OkparaTitle:    \n  ​                       ​     Controller and Chief Accounting   \n                              Officer                           \n                                                                \n"
}