{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2024-06-28",
  "period": "",
  "accession_number": "0001410578-24-001065",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001410578-24-001065-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) June 28, 2024 Citigroup Inc.\n(Exact name of registrant as specified in its charter)\n                                                                \n  Delaware            1-9924               52-1568099           \n  (State or other     -CommissionFile      -IRS                 \n  jurisdictionof      Number               EmployerIdentifica…  \n  incorporation)                           No.                  \n  ​                    ​                     ​                     \n  388 Greenwich                                                 \n  Street, New                                                   \n  York,New            ​                     10013(Zip Code)      \n  York(Address                                                  \n  of principal                                                  \n  executive offices)                                            \n                                                                \n( 212 ) 559-1000 (Registrant’s telephone number, including area\ncode) Check the appropriate box below if the Form 8-K filing is\nintended to simultaneously satisfy the filing obligation of the\nregistrant under any of the following provisions: ☐Written\ncommunications pursuant to Rule 425 under the Securities Act (17\nCFR 230.425) ☐Soliciting material pursuant to Rule 14a-12 under\nthe Exchange Act (17 CFR 240.14a-12) ☐Pre-commencement\ncommunications pursuant to Rule 14d-2(b) under the Exchange Act\n(17 CFR 240.14d-2(b)) ☐Pre-commencement communications pursuant\nto Rule 13e-4(c) under the Exchange Act (17 CFR 240.13e-4(c))\nSecurities registered pursuant to Section 12(b) of the\nSecurities Exchange Act of 1934 formatted in Inline XBRL: See\nExhibit 99.1 Indicate by check mark whether the registrant is an\nemerging growth company as defined in Rule 405 of the Securities\nAct of 1933 (17 CFR §230.405) or Rule 12b-2 of the Securities\nExchange Act of 1934 (17 CFR §240.12b-2). Emerging growth\ncompany ☐ If an emerging growth company, indicate by check mark\nif the registrant has elected not to use the extended transition\nperiod for complying with any new or revised financial\naccounting standards provided pursuant to Section 13(a) of the\nExchange Act. ☐\n                         CITIGROUP INC.                         \n                                                                \n                   Current Report on Form 8-K                   \nItem 8.01 Other Events.\n\nEffective October 1, 2024, Citigroup Inc.’s (Citi) indicative\nStress Capital Buffer (SCB) requirement is 4.1%, a decrease of\n20 bps from the current 4.3%, and Citi’s preliminary\nStandardized Common Equity Tier 1 (CET1) capital ratio\nregulatory requirement is 12.1%, 20 bps down from the current\n12.3%.\n\nAs of March 31, 2024, Citi's Standardized CET1 capital ratio was\n13.5%. The Federal Reserve Board will provide Citi with its\nfinal SCB requirement by August 31, 2024, and that requirement\nwill become effective on October 1, 2024, and will remain in\neffect until September 30, 2025.\n\nCiti’s planned capital actions include an increase of Citi’s\nquarterly common stock dividend from $0.53 to $0.56 per share\n(subject to quarterly approval by Citi’s Board of Directors),\nstarting in the third quarter of 2024.\n\nCertain statements in this report are \"forward-looking\nstatements\" within the meaning of the Private Securities\nLitigation Reform Act of 1995. These statements are based on\nmanagement's current expectations and are subject to uncertainty\nand changes in circumstances. These statements are not\nguarantees of future results or occurrences. Citi’s final Stress\nCapital Buffer requirement and actual capital levels and capital\nactions (including common stock dividends) may differ materially\nfrom those included in these statements due to a variety of\nfactors. These factors include, among others: macroeconomic,\ngeopolitical and other challenges and uncertainties, including\nthose related to economic growth, inflation and interest rates;\nthe potential outcomes of the extensive legal and regulatory\nproceedings, examinations, investigations, consent orders and\nrelated compliance efforts and other inquiries to which Citi is\nor may be subject; ongoing regulatory and legislative\nuncertainties and changes, including changes in regulatory\ncapital rules, requirements or interpretations; and the\nprecautionary statements included in this report. These factors\nalso consist of those contained in Citi's other filings with the\nU.S. Securities and Exchange Commission, including without\nlimitation the \"Risk Factors\" section of Citi's 2023 Form 10-K.\nAny forward-looking statements made by or on behalf of Citi\nspeak only as to the date they are made, and Citi does not\nundertake to update forward-looking statements to reflect the\nimpact of circumstances or events that arise after the date the\nforward-looking statements were made.\n                               2                                \nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  104        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \n3\n\nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                           CITIGROUP INC.                     \n  ​                      ​     ​                                   \n  Dated: June 28, 2024  ​     ​                                   \n ────────────────────────────────────────────────────────────── \n  ​                      By:  /s/ Johnbull E. Okpara             \n  ​                      ​     Johnbull E. Okpara                 \n                             Controller and Chief Accounting    \n  ​                      ​     Officer (Principal Accounting      \n                             Officer)                           \n                                                                \n4\n"
}