{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2021-10-25",
  "period": "",
  "accession_number": "0001104659-21-129208",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-21-129208-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) October 22, 2021 Citigroup Inc\n. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                        ​             10013               \n  NY(Address of principal                   (Zip Code)          \n  executive offices)                                            \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of\nthis chapter) or Rule 12b-2 of the Securities Exchange Act of\n1934 (§240.12b-2 of this chapter). Emerging growth company ☐ If\nan emerging growth company, indicate by check mark if the\nregistrant has elected not to use the extended transition period\nfor complying with any new or revised financial accounting\nstandards provided pursuant to Section 13(a) of the Exchange\nAct. ◻\n                                                                \n  CITIGROUP INC.Current Report on Form 8-K​Item 2.05  Costs      \n  Associated with Exit or Disposal Activities​As part of the     \n  previously announced intent of Citigroup Inc. (Citi) to exit  \n  its consumer franchises in 13 markets acrossAsiaandEMEA,      \n  Citi has decided to wind down and close its Korea consumer    \n  banking business. All necessary Citi-related Board approvals  \n  for this action were received by October 22, 2021. In         \n  connection with the wind down plan, Citi expects to incur     \n  significant wind down and related charges through the end of  \n  2023, consisting of cash expenditures related to voluntary    \n  termination benefits and related charges. Citibank Korea      \n  Inc. has begun negotiation of the voluntary termination       \n  benefits and related charges with employee unions, and is     \n  unable at this time to provide an estimate of the total       \n  amount or range of amounts expected to be incurred in         \n  connection with the wind down plan. Citi intends to file an   \n  amendment to this Current Report on Form 8-K within four      \n  business days after it makes a determination of an estimate   \n  of the total amount or range of amounts expected to be        \n  incurred in connection with the wind down plan.​Certain        \n  statements in this Current Report on Form 8-K are             \n  “forward-looking statements” within the meaning of the rules  \n  and regulations of the U.S. Securities and Exchange           \n  Commission (SEC). These statements are based on management’s  \n  current expectations and are subject to uncertainty and       \n  changes in circumstances. These statements are not            \n  guarantees of future results or occurrences. Actual results   \n  and capital and other financial condition may differ          \n  materially from those included in these statements due to a   \n  variety of factors. These factors include, among others, the  \n  successful wind down and closure of the Korea consumer        \n  banking business, including within the expected timeframe,    \n  the outcome of negotiations with employee unions, the         \n  incurrence of unexpected additional charges or expenses, and  \n  the precautionary statements included in this current         \n  report. These factors also consist of those contained in      \n  Citi’s filings with the SEC, including without limitation     \n  the “Risk Factors” section of Citi’s 2020 Form 10-K. Any      \n  forward-looking statements made by or on behalf of Citi       \n  speak only as to the date they are made, and Citi does not    \n  undertake to update forward-looking statements to reflect     \n  the impact of circumstances or events that arise after the    \n  date the forward-looking statements were made.​​                \n                                                                \n                                                                \n  2                                                             \n                                                                \nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit Number    Description                                 \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.1              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  104               See the cover page of this Current Report   \n                    on Form 8-K, formatted in Inline XBRL.      \n                                                                \n3\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: October 25,     \n  2021​​​By:/s/ Johnbull E. Okpara​​Johnbull E. Okpara​​Controller     \n  and Chief Accounting Officer​​​                                  \n                                                                \n4\n"
}