{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2023-01-13",
  "period": "",
  "accession_number": "0001410578-23-000025",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001410578-23-000025-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) January 11, 2023 Citigroup Inc\n. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant’s telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.2 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 5.02 Departure of\nDirectors or Certain Officers; Election of Directors;\nAppointment of Certain Officers; Compensatory Arrangements of\nCertain Officers. On January 11, 2023, the Board of Directors\n(the Board) of Citigroup Inc. (Citigroup) elected Casper W. von\nKoskull as a Director of Citigroup. Mr. von Koskull is the\nformer President and Group Chief Executive Officer of Nordea\nBank Abp. Also on January 11, 2023, the Board appointed Mr. von\nKoskull to the following Committees of the Board: Compensation,\nPerformance Management, and Culture Committee; Nomination,\nGovernance and Public Affairs Committee; Risk Management\nCommittee; and Transformation Oversight Committee. The Board\ndetermined that Mr. von Koskull is independent in accordance\nwith the director independence standards established under\nCitigroup’s Corporate Governance Guidelines, which are intended\nto comply with the New York Stock Exchange corporate governance\nrules, and other applicable laws, rules, and regulations. There\nare no family relationships between Mr. von Koskull and any\nofficer or other director of Citigroup or any related party\ntransactions involving Mr. von Koskull and Citigroup. There is\nno arrangement or understanding between Mr. von Koskull and any\nother person pursuant to which he was selected as a director.\nMr. von Koskull was employed by a predecessor firm of Citigroup\nfrom October 1984 to June 1994. Mr. von Koskull will receive\ncompensation as a non-employee director in accordance with\nCitigroup’s non-employee director compensation practices\ndescribed in “Proposal 1: Election of Directors – Directors’\nCompensation” of Citigroup’s Annual Proxy Statement filed with\nthe U.S. Securities and Exchange Commission on March 15, 2022. A\ncopy of Citigroup’s press release relating to the election of\nMr. von Koskull as a director is being furnished as Exhibit 99.1\nto this Current Report on Form 8-K. Item 9.01 Financial\nStatements and Exhibits. (d) Exhibits\n                                                                \n                    ​                                            \n  Exhibit Number    ​                                            \n  ​                  Citigroup Inc. Press Release dated January  \n  99.1              12, 2023.                                   \n ────────────────────────────────────────────────────────────── \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.2              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  104               The cover page of this Current Report on    \n                    Form 8-K, formatted in Inline XBRL.         \n                                                                \n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: January 13,     \n  2023​​​By:/s/ Brent J. McIntosh​​Brent J. McIntosh​​General Counsel  \n  and Corporate Secretary​​​                                       \n                                                                \n"
}