{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2022-06-27",
  "period": "",
  "accession_number": "0001104659-22-074860",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-22-074860-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) June 23, 2022 Citigroup Inc .\n(Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 7.01 Regulation\nFD Disclosure. On June 23, 2022, the Federal Reserve Board\ncommunicated that Citigroup Inc.’s (Citi) Stress Capital Buffer\n(SCB) requirement would increase from the currently effective\nrequirement of 3.0% to 4.0% for the four-quarter window of 4Q\n2022 to 3Q 2023. Accordingly, effective October 1, 2022, Citi is\nrequired to maintain an 11.5% effective minimum Common Equity\nTier 1 (CET 1) Capital ratio under the Standardized Approach,\nincorporating this SCB and its current GSIB surcharge of 3.0%.\nCiti’s effective minimum CET 1 Capital ratio under the Advanced\nApproaches (using the fixed 2.5% Capital Conservation Buffer)\nwill remain unchanged at 10%. Commencing January 1, 2023, Citi’s\nGSIB surcharge will increase from 3.0% to 3.5%, which will be\napplicable to both the Standardized Approach and the Advanced\nApproaches, resulting in a minimum CET 1 regulatory requirement\nof 12% under the Standardized Approach and 10.5% under the\nAdvanced Approaches, both as of such date. As of March 31, 2022,\nCiti’s CET 1 Capital ratio was 11.4% under both the Standardized\nand Advanced Approaches. Citi plans to maintain the current\ncommon dividend of $0.51 per share in the third quarter of 2022.\nCiti’s quarterly common dividend is subject to approval by\nCiti’s Board of Directors and the latest financial and\nmacroeconomic conditions. Certain statements in this report are\n\"forward-looking statements\" within the meaning of the Private\nSecurities Litigation Reform Act of 1995. These statements are\nbased on management’s current expectations and are subject to\nuncertainty and changes in circumstances. These statements are\nnot guarantees of future results or occurrences. Actual results\nand capital and other financial condition may differ materially\nfrom those included in these statements due to a variety of\nfactors, including, among others, the ongoing or forecasted\nimpacts to Citigroup’s results of operations and financial\ncondition related to or resulting from Russia’s military action\nin Ukraine, including the imposition of additional sanctions and\nexport controls, as well as the broader impacts to financial\nmarkets and the global macroeconomic and geopolitical\nenvironments; higher inflation and its impacts; higher interest\nrates and the impacts on macroeconomic conditions, customer and\nclient behavior, as well as Citi’s funding costs; regulatory\nrequirements; macroeconomic and other challenges and\nuncertainties related to the COVID-19 pandemic, such as the\nimpacts to the U.S. and global economies; consummation of Citi’s\nexits and wind-down, and the impact of any additional CTA or\nother losses; and the precautionary statements included in this\nreport. These factors also consist of those contained in Citi’s\nfilings with the U.S. Securities and Exchange Commission,\nincluding without limitation the \"Risk Factors\" section of\nCiti’s 2021 Form 10-K. Any forward-looking statements made by or\non behalf of Citi speak only as to the date they are made, and\nCiti does not undertake to update forward-looking statements to\nreflect the impact of circumstances or events that arise after\nthe date the forward-looking statements were made. Item 9.01\nFinancial Statements and Exhibits. (d) Exhibits\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  104        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n                        ​     ​                                   \n  ​                           CITIGROUP INC.                     \n  ​                           ​                                   \n  Dated: June 27, 2022  ​     ​                                   \n  ​                      By:  /s/ Johnbull E. Okpara             \n  ​                      ​     Johnbull E. Okpara                 \n  ​                      ​     Controller and Chief Accounting    \n                             Officer                            \n  ​                      ​     -Principal Accounting Officer      \n                                                                \n"
}