{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2023-07-03",
  "period": "",
  "accession_number": "0001410578-23-001468",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001410578-23-001468-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington,\nD.C. 20549 FORM 8-K CURRENT REPORT PURSUANT TO SECTION 13 OR\n15(d) OF THE SECURITIES EXCHANGE ACT OF 1934 Date of Report\n(date of earliest event reported): June 30, 2023 Citigroup Inc.\n(Exact name of registrant as specified in its charter)\n                                                                \n  ​                    ​                     ​                     \n  Delaware            1-9924               52-1568099           \n  (State or other                          -I.R.S. Employer     \n  jurisdiction of     -Commission File     Identification       \n  incorporation or    Number               Number               \n  organization)                                                 \n                                                                \n388 Greenwich Street New York , New York 10013(Address of\nprincipal executive offices) ( 212 ) 559-1000 (Registrant's\ntelephone number, including area code) Check the appropriate box\nbelow if the Form 8-K filing is intended to simultaneously\nsatisfy the filing obligation of the registrant under any of the\nfollowing provisions: ☐Written communications pursuant to Rule\n425 under the Securities Act (17 CFR 230.425) ☐Soliciting\nmaterial pursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01 Other\nEvents. Effective October 1, 2023, Citigroup Inc.’s (Citi)\nindicative Stress Capital Buffer (SCB) requirement is 4.3%, up\nfrom the current 4.0%, and Citi’s preliminary Standardized\nCommon Equity Tier 1 (CET1) capital ratio regulatory requirement\nis 12.3%, up from the current 12.0%. As of March 31, 2023,\nCiti's Standardized CET1 capital ratio was 13.44%. The Federal\nReserve Board will provide Citi with its final SCB requirement\nby August 31, 2023, and that requirement will become effective\non October 1, 2023, and will remain in effect until September\n30, 2024. Citi’s Board of Directors approved a plan to increase\nthe current quarterly common stock dividend of $0.51 to $0.53\nper share for the third quarter of 2023. Citi’s quarterly common\nstock dividends are subject to approval by Citi’s Board of\nDirectors at the customary times that those dividends are\ndeclared. Certain statements in this report are \"forward-looking\nstatements\" within the meaning of the Private Securities\nLitigation Reform Act of 1995. These statements are based on\nmanagement's current expectations and are subject to uncertainty\nand changes in circumstances. These statements are not\nguarantees of future results or occurrences. Citi’s final SCB\nrequirement and actual capital levels and capital actions\n(including common stock dividends) may differ materially from\nthose included in these statements due to a variety of factors.\nThese factors include, among others: elevated interest rates and\nthe impacts on macroeconomic conditions, customer and client\nbehavior, as well as Citi’s funding costs; potential recessions\nin the U.S., Europe and other countries; revisions to the U.S.\nBasel III rules; continued elevated levels of inflation and its\nimpacts; Citi’s ability to execute against its transformation\nand other strategic initiatives, including consummation of its\nremaining exits and wind-downs; potential increased regulatory\nrequirements and costs, and potential impacts to macroeconomic\nconditions, as a result of recent bank failures; and the\nprecautionary statements included in this report. These factors\nalso consist of those contained in Citi's filings with the U.S.\nSecurities and Exchange Commission, including without limitation\nthe \"Risk Factors\" section of Citi's 2022 Form 10-K. Any\nforward-looking statements made by or on behalf of Citi speak\nonly as to the date they are made, and Citi does not undertake\nto update forward-looking statements to reflect the impact of\ncircumstances or events that arise after the date the forward-\nlooking statements were made. Item 9.01 Financial Statements and\nExhibits. (d) Exhibits.\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n             Cover Page Interactive Data File - the cover page  \n  104        XBRL tags are embedded within the Inline XBRL      \n             document.                                          \n                                                                \nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized. Dated: June 30, 2023\n                                                  \n    ​     CITIGROUP INC.                           \n    ​     ​                                         \n    By:  /s/ Johnbull E. Okpara                   \n    ​     Johnbull E. Okpara                       \n    ​     Controller and Chief Accounting Officer  \n    ​     -Principal Accounting Officer            \n                                                  \n"
}