{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2020-06-19",
  "period": "",
  "accession_number": "0001104659-20-075249",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-20-075249-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) June 18, 2020 Citigroup Inc.\n(Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.01 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ◻\n                         CITIGROUP INC.                         \n                                                                \n                   Current Report on Form 8-K                   \nItem 5.02. Departure of Directors or Certain Officers; Election\nof Directors; Appointment of Certain Officers; Compensatory\nArrangements of Certain Officers.\n\nOn June 18, 2020, the Personnel and Compensation Committee (the\nCommittee) of the Board of Directors of Citigroup Inc.\n(Citigroup or the Company) approved, effective for 2020, a new\nannual base salary of £1,000,000, up from £850,000, and a new\nannual fixed role-based allowance of £5,500,000, up from\n£4,478,000, for Paco Ybarra, the Chief Executive Officer of the\nInstitutional Clients Group of the Company (the CEO of ICG).\n\nMr. Ybarra’s role-based allowance is based on certain guidelines\nrelated to the significance of his role and responsibilities\nwithin the Company and is designed to comply with U.K. and E.U.\nregulatory guidance. In accordance with that guidance, Mr.\nYbarra’s annual incentive award must not exceed two times his\nfixed compensation (i.e., his base salary and role-based\nallowance) and Mr. Ybarra’s entire incentive award is deferred\n(with no immediate bonus component). Consistent with Citigroup’s\nexecutive compensation program as described in Citigroup’s\nAnnual Proxy Statement filed with the U.S. Securities and\nExchange Commission on March 11, 2020, the Committee will\ndetermine Mr. Ybarra’s 2020 annual incentive award (and,\ntherefore, total compensation for 2020) after year-end, based on\nfinancial and non-financial factors.\n\nThe changes in base salary and role-based allowance were made\nafter consultation with the Committee’s independent compensation\nconsultant and are intended in part to allow for total annual\ncompensation in line with the market median for his current role\nas CEO of the ICG, considering compensation at U.S.-based global\nbanks, while complying with applicable regulatory guidance. The\nchanges are not reflective of, or dependent upon, 2020 Company\nor individual performance, and relate solely to Mr. Ybarra’s\nrole and responsibilities with the Company. The changes in base\nsalary and role-based allowance do not imply an intent to\ncompensate Mr. Ybarra at the maximum level permitted under the\nU.K. and E.U. regulatory limits. Mr. Ybarra’s annual incentive\nwill reflect performance.\n\nItem 9.01 Financial Statements and Exhibits. (d) Exhibits\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.01      Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  104        The cover page of this Current Report on Form      \n             8-K, formatted in Inline XBRL.                     \n                                                                \nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                           CITIGROUP INC.                     \n  ​                           ​                                   \n  ​                           ​                                   \n  Dated: June 19, 2020  ​     ​                                   \n  ​                      By:  /s/ Rohan Weerasinghe              \n  ​                      ​     Rohan Weerasinghe                  \n  ​                      ​     General Counsel and Corporate      \n                             Secretary                          \n                                                                \n"
}