{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2025-02-18",
  "period": "",
  "accession_number": "0001104659-25-014783",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-25-014783-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) February 13, 2025 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant’s telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01. Other\nEvents. On February 13, 2025 (the Grant Date), the Compensation,\nPerformance Management and Culture Committee of the Citigroup\nInc. (Citi) Board of Directors (the Compensation Committee)\napproved incentive compensation awards for 2024 performance to\nCiti’s Chief Executive Officer (CEO), Jane Fraser. The\nCompensation Committee’s 2024 incentive compensation\ndetermination reflects its belief that Ms. Fraser’s strategic\nand other priorities are sound and that she is executing on them\npromptly and thoughtfully, with an eye towards enhanced safety\nand soundness, improved returns and laying the foundation for\nlong-term sustainable growth. These priorities include executing\non Citi’s risk and control transformation; aligning Citi’s\norganizational structure to its business strategy and increasing\naccountability, transparency and focus of execution for Citi’s\nbusinesses; and exiting or winding down Citi’s remaining\ninternational consumer markets to simplify the business. Citi’s\ncompensation process starts with goal setting at the beginning\nof the year in which the Compensation Committee approves\nscorecards for Ms. Fraser and Citi’s other executive officers.\nThe scorecards include both individual and corporate metrics and\ndrive performance assessments across Financial, Risk and\nControl, Client and Franchise, and Leadership performance\npillars. Year-end performance assessments occur in conjunction\nwith market benchmarking versus peers, which lead to the\nCompensation Committee determinations on total incentive values.\nThe following factors were elements of the Compensation\nCommittee’s 2024 compensation determination for Ms. Fraser:\n                                     \n  ●  As Citi’s CEO, Ms. Fraser has:  \n                                     \n                                                                \n     Led Citi to achieve 2024 results evidencing that the       \n     strategy to focus on five interconnected businesses and    \n     to exit 14 international consumer markets, which we laid   \n  o  out at our Investor Day three years ago, is delivering     \n     stronger financial performance, including, in addition to  \n     the financial performance summarized below, the            \n     following:                                                 \n                                                                \n                                                                \n     Provided greater transparency into the core businesses’    \n  ■  financial performance, including the completion of Citi’s  \n     first Investor Day since 2022.                             \n                                                                \n                                                                \n     Accelerated investments in the businesses in order to      \n  ■  modernize our infrastructure, automate processes and       \n     enhance data and analytics.                                \n                                                                \n                                                                \n     Attracted external talent in key strategic areas, such as  \n  ■  our Banking and Wealth businesses and our technology       \n     function, to enhance performance and returns.              \n                                                                \n                                                                \n     Flattened the management model, thereby eliminating        \n  ■  layers and regional structures and enhancing the           \n     leadership accountability in each of our five              \n     interconnected businesses.                                 \n                                                                \n                                                                \n     Separated our consumer, small and middle market            \n     businesses in Mexico (Banamex) from our Markets, Banking,  \n     Wealth and Services businesses, in furtherance of our      \n  ■  journey to IPO Banamex; on track to complete the           \n     wind-downs of Citi’s consumer businesses in China and      \n     Korea and our overall presence in Russia; commenced the    \n     sales process for our consumer business in Poland.         \n                                                                \n                                                                \n     Increased year-over-year revenues in each of Citi’s five   \n  ■  businesses – Markets, Banking, Wealth, U.S. Personal       \n     Banking (USPB) and Services – including record revenues    \n     in Services, Wealth and USPB.                              \n                                                                \n                                                                \n  ■  Generated positive operating leverage for the full year    \n     for the firm, as well as for each of the five businesses.  \n                                                                \n                                                                \n     Continued to execute on remediation of issues identified   \n     in the Consent Orders issued in 2020 by the Federal        \n  o  Reserve Board (FRB) and the Office of the Comptroller of   \n     the Currency, recognizing that there is substantial work   \n     to be done.                                                \n                                                                \n2\n                                                                \n     Notably, in regard to the work to be done, in 2024, the    \n     FRB and OCC entered into Civil Money Penalty Consent       \n  ■  Orders with Citi in the amount of approximately $61        \n     million and $75 million, respectively, related to the      \n     2020 Consent Orders, as well as an amendment to the OCC’s  \n     2020 Consent Order.                                        \n                                                                \n                                                                \n  o  Closed the 2013 Consent Order with the FRB related to      \n     anti-money laundering and Bank Secrecy Act deficiencies.   \n                                                                \n                                                            \n  ●  Citi’s overall 2024 financial performance, including:  \n                                                            \n                                                            \n  o  Full year revenues of $81.1 billion, up 3% from 2023.  \n                                                            \n                                                                \n  o  Net income for the full year of $12.7 billion, up 37%      \n     from 2023.                                                 \n                                                                \n                                                                \n  o  Full year diluted earnings per share of $5.94, up 47%      \n     from 2023.                                                 \n                                                                \n                                                                \n     The return of $6.7 billion in capital to Citi’s common     \n  o  shareholders, and a Common Equity Tier 1 Capital (CET1)    \n     ratio of 13.6% under the Basel III Standardized Approach.  \n                                                                \n                                                                \n     Citi’s absolute and relative total shareholder returns     \n  ●  during 2024, including the various elements of Citi’s      \n     executive compensation program that tie compensation to    \n     total shareholder returns.                                 \n                                                                \n                                                                \n  ●  Competitive market levels of pay for CEOs of peer          \n     institutions.                                              \n                                                                \n3\n\nFor 2024, the Compensation Committee determined that Ms.\nFraser’s direct compensation is $34.5 million, consisting of a\nflat base salary of $1.5 million and a total incentive award of\n$33 million as indicated in the following table.\n                                                                \n               CEO Compensation for 2024                        \n  Element      Form                             Amount          \n  Base Salary  Cash                             $1.5 million    \n  Cash         Cash                             $4.95 million   \n  Incentive    (15% of total incentive award)                   \n               Deferred Stock                                   \n  Deferred     (35% of total incentive award)                   \n  Incentive    Vests ratably over 4 years       $11.55 million  \n               subject to performance                           \n               conditions                                       \n               Performance Share Units (PSUs)                   \n               (50% of total incentive award)                   \n               Vests based on equally weighted                  \n               tangible book value per share    $16.5 million   \n               over 3 years and weighted                        \n               average return on tangible                       \n               common equity                                    \n  Total                                         $34.5 million   \n                                                                \nConsistent with prior years, the number of shares of deferred\nstock granted for 2024 was determined by dividing the nominal\namount awarded in deferred stock by the average of the closing\nprices of Citi common stock on the five business days\nimmediately preceding the Grant Date ($81.432). The target\nnumber of PSUs was also determined by dividing the nominal\namount awarded as PSUs by the same five-day average price.\nAdditional information regarding Citi’s incentive compensation\nprograms, including an explanation of the material elements of\nthe compensation for 2024 awarded to Ms. Fraser and the other\nnamed executive officers, will be presented in Citi’s 2025 Proxy\nStatement for the Annual Meeting of Stockholders, which is\nexpected to be filed with the U.S. Securities and Exchange\nCommission in March 2025.\n\n4\n\nItem 9.01 Financial Statements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit Number    ​                                            \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.1              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  101               See the cover page of this Current Report   \n                    on Form 8-K, formatted in Inline XBRL.      \n                                                                \n5\n\nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                          ​     CITIGROUP INC.                 \n  ​                          ​     ​                               \n  Dated: February 18, 2025  ​     ​                               \n ────────────────────────────────────────────────────────────── \n  ​                          By:  /s/ Brent J. McIntosh          \n  ​                          ​     Brent J. McIntosh              \n  ​                          ​     Chief Legal Officer and        \n                                 Corporate Secretary            \n                                                                \n6\n"
}