{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2022-01-11",
  "period": "",
  "accession_number": "0001410578-22-000010",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001410578-22-000010-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) January 11, 2022 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ◻\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01 Other\nEvents. As part of its previously disclosed strategic review, on\nJanuary 11, 2022, Citigroup Inc. (Citi) announced that it\nintends to exit the consumer, small business and middle market\nbanking operations of Citibanamex, which would advance Citi ’s\nstrategic goals to invest in businesses aligned with Citi ’s\ncore strengths, simplify its operations and drive long-term\nshareholder value. The businesses in the intended exit include\nthe Mexico consumer and small business banking operations,\nreported as part of Citi ’s Global Consumer Bankingsegment, as\nwell as the Mexico middle market banking business, reported in\nCiti ’s Institutional Clients Groupsegment. The Mexico consumer\nand small business banking operations included in the intended\nexit represent the entirety of the Latin America Global Consumer\nBankingunit. Citi will continue to operate a locally-licensed\nbanking business in Mexico through its global Institutional\nClients Group, which remains important to Citi ’s global\nnetwork. The method and timing of Citi ’s exit from its\nconsumer, small business and middle market banking operations in\nMexico, which could include a sale or a public market\nalternative, will be determined by Citi and will be aligned with\nits objectives of maximizing shareholder value and strengthening\nboth the businesses that Citi will exit and those it will\nretain. The exit process is subject to various conditions and\napprovals, including applicable regulatory approvals in both the\nU.S. and Mexico. Certain statements in this Current Report on\nForm 8-K are “ forward-looking statements ” within the meaning\nof the rules and regulations of the U.S. Securities and Exchange\nCommission (SEC). These statements are based on management ’ s\ncurrent expectations and are subject to uncertainty and changes\nin circumstances. These statements are not guarantees of future\nresults or occurrences. Actual results and capital and other\nfinancial condition may differ materially from those included in\nthese statements due to a variety of factors. These factors\ninclude, among others, consummation of the intended exit, such\nas satisfying various conditions and approvals, macroeconomic\nchallenges and uncertainties and local banking conditions; the\nincurrence of unexpected charges or expenses; the impact of the\naccounting for currency translation adjustments related to the\naffected businesses; and the precautionary statements included\nin this current report. These factors also consist of those\ncontained in Citi ’ s filings with the SEC, including without\nlimitation the “ Risk Factors ” section of Citi ’ s 2020 Form\n10-K. Any forward-looking statements made by or on behalf of\nCiti speak only as to the date they are made, and Citi does not\nundertake to update forward-looking statements to reflect the\nimpact of circumstances or events that arise after the date the\nforward-looking statements were made. Item 9.01 Financial\nStatements and Exhibits. (d) Exhibits.\n                                                                \n  Exhibit    ​                                                   \n  Number                                                        \n  ​           ​                                                   \n             Citigroup Inc. securities registered pursuant to   \n  99.1       Section 12(b) of the Securities Exchange Act of    \n             1934 as of the filing date.                        \n  ​           ​                                                   \n  101        See the cover page of this Current Report on Form  \n             8-K, formatted in Inline XBRL.                     \n                                                                \n2\n                                                                \n  SIGNATURE​Pursuant to the requirements of the Securities       \n  Exchange Act of 1934, the registrant has duly caused this     \n  report to be signed on its behalf by the undersigned          \n  hereunto duly authorized.​​​CITIGROUP INC.​​​Dated: January 11,     \n  2022​​​By:/s/ Johnbull E. Okpara​​Johnbull E. Okpara​​Controller     \n  and Chief Accounting Officer​​​                                  \n                                                                \n3\n"
}