{
  "cik": 831001,
  "company_name": "Citigroup",
  "ticker": "C",
  "form_type": "8-K",
  "filing_date": "2024-02-20",
  "period": "",
  "accession_number": "0001104659-24-025567",
  "file_url": "https://www.sec.gov/Archives/edgar/data/831001/0001104659-24-025567-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM 8-K CURRENT REPORT Pursuant to Section 13 or\n15(d) of the Securities Exchange Act of 1934 Date of Report\n(Date of earliest event reported) February 15, 2024 Citigroup\nInc. (Exact name of registrant as specified in its charter)\n                                                                \n  ​                             ​             ​                    \n  Delaware                     1-9924       52-1568099          \n  (State or other              -Commission  -IRS Employer       \n  jurisdiction                 File Number  Identification No.  \n  of incorporation)                                             \n  ​                             ​             ​                    \n  388 Greenwich Street, New                                     \n  York,                                     10013               \n  New York(Address of          ​             (Zip Code)          \n  principal executive                                           \n  offices)                                                      \n                                                                \n( 212 ) 559-1000 (Registrant's telephone number,\nincluding area code) Check the appropriate box below if the Form\n8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following\nprovisions: ☐ Written communications pursuant to Rule 425 under\nthe Securities Act (17 CFR 230.425) ☐ Soliciting material\npursuant to Rule 14a-12 under the Exchange Act (17 CFR\n240.14a-12) ☐ Pre-commencement communications pursuant to Rule\n14d-2(b) under the Exchange Act (17 CFR 240.14d-2(b)) ☐ Pre-\ncommencement communications pursuant to Rule 13e-4(c) under the\nExchange Act (17 CFR 240.13e-4(c)) Securities registered\npursuant to Section 12(b) of the Securities Exchange Act of 1934\nformatted in Inline XBRL: See Exhibit 99.1 Indicate by check\nmark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (17 CFR\n§230.405) or Rule 12b-2 of the Securities Exchange Act of 1934\n(17 CFR §240.12b-2). Emerging growth company ☐ If an emerging\ngrowth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided\npursuant to Section 13(a) of the Exchange Act. ☐\n\nCITIGROUP INC. Current Report on Form 8-K Item 8.01. Other\nEvents. On February 15, 2024 (the Grant Date), the Compensation,\nPerformance Management and Culture Committee of the Citigroup\nInc. (Citi) Board of Directors (the Compensation Committee)\napproved incentive compensation awards for 2023 performance to\nCiti’s Chief Executive Officer (CEO) Jane Fraser. The\nCompensation Committee’s 2023 incentive compensation\ndetermination for Ms. Fraser reflected its belief that Ms.\nFraser’s strategic and other priorities are sound and that she\nis executing on them promptly and thoughtfully, with an eye\ntowards driving long-term sustainable growth, improved returns\nand enhanced safety and soundness. These priorities include\nsimplifying Citi; aligning Citi’s organizational structure to\nits business strategy and increasing accountability,\ntransparency and focus of execution for Citi’s businesses;\nexiting or winding down Citi’s remaining international consumer\nmarkets; and executing on Citi’s risk and control\nTransformation. Citi’s compensation process starts with goal\nsetting, in which the Compensation Committee approves scorecards\nfor Ms. Fraser and Citi’s other executive officers at the\nbeginning of each year. The scorecards include both individual\nand corporate metrics and drive performance assessments across\nFinancial, Risk and Control, Client and Franchise, and\nLeadership performance pillars. Year-end performance assessments\noccur in conjunction with market benchmarking versus peers,\nwhich lead to the Compensation Committee determination. The\nfollowing factors were a focus of the Compensation Committee’s\n2023 compensation determination for Ms. Fraser:\n                                     \n  ●  As Citi’s CEO, Ms. Fraser has:  \n                                     \n                                                                \n     Reset Citi’s strategy to focus on five interconnected      \n  o  businesses and to exit 14 international consumer markets.  \n     Under her leadership, Citi has:                            \n                                                                \n                                                                \n  ◾  Provided greater transparency into the core businesses’   \n      financial performance with new financial reporting.       \n                                                                \n                                                                \n      Invested in the businesses in order to modernize our      \n  ◾  infrastructure, automate processes and enhance data and   \n      analytics.                                                \n                                                                \n                                                                \n      Brought in external talent in key strategic areas, such   \n  ◾  as our Wealth business, to enhance performance and        \n      returns.                                                  \n                                                                \n                                                                \n      Closed nine of the 14 international consumer business     \n  ◾  exits, and wound down over 70% of our total retail loans  \n      and deposits in Russia, Korea and China.                  \n                                                                \n                                                                \n     Announced the most consequential set of changes to its     \n     organizational and management model since the 2008         \n     financial crisis. These include the creation of a          \n  o  centralized Client organization, elimination of redundant  \n     management layers and duplicative regional leadership      \n     structures, and elevation of the leaders of the five core  \n     businesses to raise accountability.                        \n                                                                \n                                                                \n     Continued to execute on remediation of issues identified   \n     in the Consent Orders issued in 2020 by the Federal        \n  o  Reserve Board and the Office of the Comptroller of the     \n     Currency, recognizing that there is substantial            \n     additional work to be done.                                \n                                                                \n                                                                \n      Notably, in 2023 the Federal Reserve Board announced the  \n  ◾  termination of its 2015 Cease and Desist Order related    \n      to certain foreign exchange activities.                   \n                                                                \n                                                            \n  ●  Citi’s overall 2023 financial performance, including:  \n                                                            \n                                                            \n  o  Full year revenues of $78.5 billion, up 4% from 2022.  \n                                                            \n                                                                \n  o  Net income for the full year of $9.2 billion, down 38%     \n     from 2022.                                                 \n                                                                \n                                                                \n  o  Full year diluted earnings per share of $4.04, down 42%    \n     from 2022.                                                 \n                                                                \n                                                                \n     The return of $6.1 billion in capital to Citi’s common     \n  o  shareholders, and a Common Equity Tier 1 Capital (CET1)    \n     ratio of 13.37% under the Basel III Standardized           \n     Approach.                                                  \n                                                                \n                                                                \n     Citi’s absolute and relative total shareholder returns     \n  ●  during 2023, including the various elements of Citi’s      \n     executive compensation program that tie compensation to    \n     total shareholder returns.                                 \n                                                                \n                                                                \n  ●  Competitive market levels of pay for CEOs of peer          \n     institutions.                                              \n                                                                \nFor 2023, the Compensation Committee determined that Ms.\nFraser’s compensation is $26.0 million, consisting of a flat\nbase salary of $1.5 million and a total incentive award of $24.5\nmillion as indicated in the following table.\n                                                                \n               CEO Compensation for 2023                        \n  Element      Form                             Amount          \n  Base Salary  Cash                             $1.5 million    \n  Cash         Cash                             $3.675 million  \n  Incentive    (15% of total incentive award)                   \n               Deferred Stock                                   \n  Deferred     (35% of total incentive award)                   \n  Incentive    Vests ratably over 4 years       $8.575 million  \n               subject to performance                           \n               conditions                                       \n               Performance Share Units (PSUs)                   \n               (50% of total incentive award)                   \n               Vests based on equally weighted                  \n               tangible book value per share    $12.25 million  \n               over 3 years and weighted                        \n               average return on tangible                       \n               common equity                                    \n  Total                                         $26.0 million   \n                                                                \nConsistent with prior years, the number of shares of deferred\nstock granted for 2023 was determined by dividing the nominal\namount awarded in deferred stock by the average of the closing\nprices of Citi common stock on the five business days\nimmediately preceding the Grant Date ($53.788). The target\nnumber of PSUs was also determined by dividing the nominal\namount awarded as PSUs by the same five-day average price.\nAdditional information regarding Citi’s incentive compensation\nprograms, including an explanation of the material elements of\nthe compensation for 2023 awarded to Ms. Fraser and the other\nnamed executive officers, will be presented in Citi’s 2024 Proxy\nStatement for the Annual Meeting of Stockholders, which is\nexpected to be filed with the U.S. Securities and Exchange\nCommission in March 2024. Item 9.01 Financial Statements and\nExhibits. (d) Exhibits.\n                                                                \n  Exhibit Number    ​                                            \n  ​                  ​                                            \n                    Citigroup Inc. securities registered        \n  99.1              pursuant to Section 12(b) of the            \n                    Securities Exchange Act of 1934 as of the   \n                    filing date.                                \n  ​                  ​                                            \n  101               See the cover page of this Current Report   \n                    on Form 8-K, formatted in Inline XBRL.      \n                                                                \nSIGNATURE Pursuant to the requirements of the Securities\nExchange Act of 1934, the registrant has duly caused this report\nto be signed on its behalf by the undersigned hereunto duly\nauthorized.\n                                                                \n  ​                          ​     CITIGROUP INC.                 \n  ​                          ​     ​                               \n  Dated: February 20, 2024  ​     ​                               \n ────────────────────────────────────────────────────────────── \n  ​                          By:  /s/ Brent McIntosh             \n  ​                          ​     Brent McIntosh                 \n  ​                          ​     Chief Legal Officer and        \n                                 Corporate Secretary            \n                                                                \n"
}