{
  "title": "Scotiabank Releases Updated Supplementary Financial Information Package Reflecting Changes in Business Segment Presentation",
  "url": "https://scotiabank.investorroom.com/2025-01-28-Scotiabank-Releases-Updated-Supplementary-Financial-Information-Package-Reflecting-Changes-in-Business-Segment-Presentation",
  "date": "2025-01-28",
  "short_description": "Scotiabank has released an abridged Supplementary Financial Information package with unaudited quarterly and annual financial information for fiscal years 2024 and 2023, reflecting changes in...",
  "content": "TORONTO,Jan. 28, 2025/CNW/ - Scotiabank has released an abridged Supplementary Financial Information package with unaudited quarterly and annual financial information for fiscal years 2024 and 2023, reflecting changes in business segment presentation that are effectiveNovember 1, 2024. There is no impact to the Bank's consolidated financial results.\n\nThese voluntary changes represent an important step in executing the Bank's strategy and reflect an updated approach to business segment presentation to be consistent with management's evaluation of the financial performance of the business segments. The changes support better decision making within the business segments around pricing and capital allocation to help the Bank achieve its financial and strategic medium-term objectives.\nThe updated disclosures primarily relate to the impact of methodology changes in the Bank's funds transfer pricing, which will result in substantially all liquidity costs allocated to the business segments, and reflect the Bank's strategic objective to maintain higher liquidity ratios.\nTo be consistent with the reporting of Scotiabank's recent minority investment in KeyCorp, the Bank has also made changes to the reporting of certain minority investments in International Banking (Bank ofXi'an) and Global Wealth Management (Bank of Beijing Scotia Asset Management), which will now be reported in the Other segment.\nFor better comparability of results across periods, prior period segmented results have been revised, resulting in an increase in the Other segment earnings of$998 millionin 2024 and$774 millionin 2023, with a corresponding decrease in the combined net income of the four business segments.\nThe changes do not impact the Bank's consolidated 2024 and 2023 reported and adjusted financial results. They also do not result in a revision to any of the Bank's or business segments' 2025 financial outlook detailed in the 2024 Annual Report, medium-term financial and strategic objectives, or financial growth objectives presented at the Bank'sDecember 13, 2023Investor Day.\nThe abridged Supplementary Financial Information package reflecting these changes is available atwww.scotiabank.com/ca/en/about/investors-shareholders/financial-result.html.\nScotiabank's first quarter earnings, which will be reported onFebruary 25, 2025, will reflect these changes.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atOctober 31, 2024), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-01-28-Scotiabank-Releases-Updated-Supplementary-Financial-Information-Package-Reflecting-Changes-in-Business-Segment-Presentation",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}