{
  "title": "Cedar Leaf Capital joins the Government of Alberta's bond underwriting syndicate",
  "url": "https://scotiabank.investorroom.com/2025-01-29-Cedar-Leaf-Capital-joins-the-Government-of-Albertas-bond-underwriting-syndicate",
  "date": "2025-01-29",
  "short_description": "Cedar Leaf Capital, Canada's first majority Indigenous-owned investment dealer, proudly joins the Government of Alberta's bond underwriting syndicate. \"We applaud the vision and efforts of the...",
  "content": "TORONTO, Jan. 29, 2025 /CNW/ - Cedar Leaf Capital, Canada's first majority Indigenous-owned investment dealer, proudly joins the Government of Alberta's bond underwriting syndicate.\n\"We applaud the vision and efforts of the Government of Alberta to strengthen Indigenous economic inclusion,\" said Clint Davis, CEO of Cedar Leaf Capital. \"We are proud to partner with the Government of Alberta and we look forward to working together to further support Indigenous participation in capital markets.\"\n\"The Government of Alberta is proud to lead the way on economic reconciliation by fostering greater Indigenous participation in Canada's capital markets,\" said Nate Horner, President of Treasury Board and Minister of Finance. \"On Monday morning, we reopened our 10-year benchmark bond and welcomed Canada's first majority Indigenous-owned investment dealer to our underwriting syndicate. This milestone – being the first government in Canada to include an Indigenous owned investment dealer - demonstrates our commitment to working in partnership with Indigenous Peoples and communities to drive meaningful progress and advance reconciliation across Alberta.\"\nAbout Cedar Leaf CapitalCedar Leaf Capital Inc. is Canada's first majority Indigenous-owned investment dealer, with a commitment to Indigenous economic reconciliation. The firm provides services as an underwriter or placement agent of new debt issues for corporate and government clients in Canada, with plans to potentially expand into advisory services and equity capital markets. Cedar Leaf Capital is a partnership between Scotiabank, Nch'ḵay̓ Development, Des Nedhe Group, and Chippewas of Rama First Nation. Cedar Leaf Capital operates as a registered Investment Dealer across all provinces and territories in Canada. The company is regulated by the Canadian Investment Regulatory Organization (CIRO). For more information, please visitcedarleafcapital.com\nSOURCE Cedar Leaf Capital\n\nFor more information, please contact: Scotiabank (on behalf of Cedar Leaf Capital), Diana Coletto, Global Communications, diana.coletto@scotiabank.com.",
  "id": "2025-01-29-Cedar-Leaf-Capital-joins-the-Government-of-Albertas-bond-underwriting-syndicate",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}