{
  "title": "Scotiabank enters into an agreement to transfer banking operations in Colombia, Costa Rica and Panama to Davivienda in exchange for an approximate 20% ownership stake in the combined banking operations",
  "url": "https://scotiabank.investorroom.com/2025-01-06-Scotiabank-enters-into-an-agreement-to-transfer-banking-operations-in-Colombia,-Costa-Rica-and-Panama-to-Davivienda-in-exchange-for-an-approximate-20-ownership-stake-in-the-combined-banking-operations",
  "date": "2025-01-06",
  "short_description": "Transfer of Colombia, Costa Rica and Panama businesses to Davivienda will create a bank with greater scale in each market. Scotiabank to receive an approximate 20% ownership stake in Davivienda on...",
  "content": "TORONTO,Jan. 6, 2025/CNW/ - Scotiabank announced today it has entered into an agreement with Davivienda to transfer Scotiabank's banking operations inColombia,Costa RicaandPanamato Davivienda. As part of the transaction, Mercantil Colpatria will sell its interest in Scotiabank Colpatria inColombia.\n\nThe transaction supports Scotiabank's operational efficiency efforts in its noncore markets and strengthens Scotiabank's strategic focus on building a connected value proposition focused on client primacy across its growth markets in the North American corridor andLatin America. The transaction also provides Scotiabank with the opportunity to participate in a business with a proven management team that will be well-positioned to become a leading franchise through increased scale, synergies and an expanded client base. Scotiabank and Davivienda intend to enter into a mutual referral agreement that will provide the opportunity for Scotiabank to continue to support Corporate, Wealth and Global Banking and Markets clients with its services across Davivienda's footprint.\n\"With this agreement, we advance our execution plan towards sustainable and higher returns across our International Banking markets,\" saidFrancisco Aristeguieta, Group Head, International Banking, Scotiabank. \"Davivienda is a proven operator which, through the combined entity, will deliver more scale and become an important partner in supporting our Global Wealth Management and Global Banking and Markets businesses inColombiaandCentral America.\"\nDavivienda is a financial institution with over 50 years of experience and is one of the most recognized banks inLatin Americafor its innovation and digital capabilities with operations inColombia,Costa Rica,El Salvador,Honduras,PanamaandMiami, serving more than 24.6 million clients.\nTransaction Highlights:Subject to the receipt of regulatory approvals in the relevant jurisdictions, the completion of the transaction is expected to occur in approximately 12 months from signing.\nScotiabank will receive a combination of newly issued common and preferred shares reflecting an approximate 20% equity ownership stake in the newly combined entity. As part of the agreement, Scotiabank will have the right to designate individual(s) to serve on the Board of Directors of Davivienda's combined operations commensurate with its ownership stake.\nScotiabank's operations that are part of this transaction will now be considered held for sale for accounting purposes, and an after-tax impairment loss of approximatelyCAD$1.4 billionwill be recognized in the first quarter of 2025. This is expected to reduce Scotiabank's Common Equity Tier 1 (\"CET1\") ratio by approximately 10-15 basis points. In addition, there may be changes to the loss up to closing from changes in the value of the shares received and carrying value of the assets being sold.\nWe estimate that additional losses of approximatelyCAD$0.3 billionwill be recorded on closing primarily relating to cumulative foreign currency translation losses.\nAt closing, Scotiabank's investment in Davivienda will be recorded as an investment in associate for accounting purposes. The CET1 ratio is expected to benefit an approximate 10-15 basis points, primarily from the reduction in risk-weighted assets.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atOctober 31, 2024), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nForward-looking statementsFrom time to time, our public communications include oral or written forward-looking statements. Statements of this type are included in this document, and may be included in other filings with Canadian securities regulators or the U.S. Securities and Exchange Commission (SEC), or in other communications. In addition, representatives of the Bank may include forward-looking statements orally to analysts, investors, the media and others. All such statements are made pursuant to the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995 and any applicable Canadian securities legislation. Forward-looking statements may include, but are not limited to, statements made in this document, the Management's Discussion and Analysis in the Bank's 2024 Annual Report under the headings \"Outlook\" and in other statements regarding the Bank's objectives, strategies to achieve those objectives, the regulatory environment in which the Bank operates, anticipated financial results, and the outlook for the Bank's businesses and for the Canadian, U.S. and global economies. Such statements are typically identified by words or phrases such as \"believe,\" \"expect,\" \"aim,\" \"achieve,\" \"foresee,\" \"forecast,\" \"anticipate,\" \"intend,\" \"estimate,\" \"outlook,\" \"seek,\"  \"schedule,\" \"plan,\" \"goal,\" \"strive,\" \"target,\" \"project,\" \"commit,\" \"objective,\" and similar expressions of future or conditional verbs, such as \"will,\" \"may,\" \"should,\" \"would,\" \"might,\" \"can\" and \"could\" and positive and negative variations thereof.\nBy their very nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties, which give rise to the possibility that our predictions, forecasts, projections, expectations or conclusions will not prove to be accurate, that our assumptions may not be correct and that our financial performance objectives, vision and strategic goals will not be achieved.\nWe caution readers not to place undue reliance on these statements as a number of risk factors, many of which are beyond our control and effects of which can be difficult to predict, could cause our actual results to differ materially from the expectations, targets, estimates or intentions expressed in such forward-looking statements.\nThe future outcomes that relate to forward-looking statements may be influenced by many factors, including but not limited to: general economic and market conditions in the countries in which we operate and globally; changes in currency and interest rates; increased funding costs and market volatility due to market illiquidity and competition for funding; the failure of third parties to comply with their obligations to the Bank and its affiliates, including relating to the care and control of information, and other risks arising from the Bank's use of third parties; changes in monetary, fiscal, or economic policy and tax legislation and interpretation; changes in laws and regulations or in supervisory expectations or requirements, including capital, interest rate and liquidity requirements and guidance, and the effect of such changes on funding costs; geopolitical risk; changes to our credit ratings; the possible effects on our business and the global economy of war, conflicts or terrorist actions and unforeseen consequences arising from such actions; technological changes, including the use of data and artificial intelligence in our business, and technology resiliency; operational and infrastructure risks; reputational risks; the accuracy and completeness of information the Bank receives on customers and counterparties; the timely development and introduction of new products and services, and the extent to which products or services previously sold by the Bank require the Bank to incur liabilities or absorb losses not contemplated at their origination; our ability to execute our strategic plans, including the successful completion of acquisitions and dispositions, including obtaining regulatory approvals; critical accounting estimates and the effect of changes to accounting standards, rules and interpretations on these estimates; global capital markets activity; the Bank's ability to attract, develop and retain key executives; the evolution of various types of fraud or other criminal behaviour to which the Bank is exposed; anti-money laundering; disruptions or attacks (including cyberattacks) on the Bank's information technology, internet connectivity, network accessibility, or other voice or data communications systems or services, which may result in data breaches, unauthorized access to sensitive information, denial of service and potential incidents of identity theft; increased competition in the geographic and in business areas in which we operate, including through internet and mobile banking and non-traditional competitors; exposure related to significant litigation and regulatory matters; environmental, social and governance risks, including climate change, our ability to implement various sustainability-related initiatives (both internally and with our clients and other stakeholders) under expected time frames, and our ability to scale our sustainable-finance products and services; the occurrence of natural and unnatural catastrophic events and claims resulting from such events, including disruptions to public infrastructure, such as transportation, communications, power or water supply; inflationary pressures; global supply-chain disruptions; Canadian housing and household indebtedness; the emergence or continuation of widespread health emergencies or pandemics, including their impact on the global economy, financial market conditions and the Bank's business, results of operations, financial condition and prospects; and the Bank's anticipation of and success in managing the risks implied by the foregoing. A substantial amount of the Bank's business involves making loans or otherwise committing resources to specific companies, industries or countries. Unforeseen events affecting such borrowers, industries or countries could have a material adverse effect on the Bank's financial results, businesses, financial condition or liquidity. These and other factors may cause the Bank's actual performance to differ materially from that contemplated by forward-looking statements. The Bank cautions that the preceding list is not exhaustive of all possible risk factors and other factors could also adversely affect the Bank's results, for more information, please see the \"Risk Management\" section of the Bank's 2024 Annual Report, as may be updated by quarterly reports.\nMaterial economic assumptions underlying the forward-looking statements contained in this document are set out in the 2024 Annual Report under the headings \"Outlook\", as updated by quarterly reports. The \"Outlook\" and \"2025 Priorities\" sections are based on the Bank's views and the actual outcome is uncertain. Readers should consider the above-noted factors when reviewing these sections. When relying on forward-looking statements to make decisions with respect to the Bank and its securities, investors and others should carefully consider the preceding factors, other uncertainties and potential events.\nAny forward-looking statements contained in this document represent the views of management only as of the date hereof and are presented for the purpose of assisting the Bank's shareholders and analysts in understanding the Bank's financial position, objectives and priorities, and anticipated financial performance as at and for the periods ended on the dates presented, and may not be appropriate for other purposes. Except as required by law, the Bank does not undertake to update any forward-looking statements, whether written or oral, that may be made from time to time by or on its behalf.\nAdditional information relating to the Bank, including the Bank's Annual Information Form, can be located on the SEDAR+ website atwww.sedarplus.caand on the EDGAR section of the SEC's website atwww.sec.gov.\nSOURCE Scotiabank\n",
  "id": "2025-01-06-Scotiabank-enters-into-an-agreement-to-transfer-banking-operations-in-Colombia,-Costa-Rica-and-Panama-to-Davivienda-in-exchange-for-an-approximate-20-ownership-stake-in-the-combined-banking-operations",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}