{
  "title": "Cedar Leaf Capital joins CPP Investments syndicate of dealers",
  "url": "https://scotiabank.investorroom.com/2025-01-28-Cedar-Leaf-Capital-joins-CPP-Investments-syndicate-of-dealers",
  "date": "2025-01-28",
  "short_description": "Cedar Leaf Capital, Canada's first majority Indigenous-owned investment dealer, proudly joins the syndicate of dealers for Canada Pension Plan Investment Board (CPP Investments). \"This is a...",
  "content": "TORONTO, Jan. 27, 2025 /CNW/ - Cedar Leaf Capital, Canada's first majority Indigenous-owned investment dealer, proudly joins the syndicate of dealers for Canada Pension Plan Investment Board (CPP Investments).\n\"This is a historic moment for Cedar Leaf Capital and marks the first time a majority Indigenous-owned investment dealer will participate in the debt market at this scale,\" says Clint Davis, CEO of Cedar Leaf Capital. \"We are honoured to have this partnership with CPP Investments, one of the strongest, most resilient and financially sustainable pension funds in the world. Our involvement in this syndicate demonstrates our collective commitment to supporting an inclusive and robust capital markets industry.\"\n\"We are pleased to welcome Cedar Leaf Capital into our Canadian Dollar syndicate representing CPP Investments in the debt market,\" said Sam Dorri, Managing Director of Financing & Balance Sheet Management. \"The inclusion of Cedar Leaf Capital enables us to further diversify our dealer base, reaffirming our commitment to the Canadian bond market.\"\nOn October 16, 2024, Cedar Leaf Capital announced that it received regulatory approval to open their doors for business. Cedar Leaf Capital is a partnership between Scotiabank, Nch'ḵay̓ Development, Des Nedhe Group, and Chippewas of Rama First Nation.\nAbout Cedar Leaf CapitalCedar Leaf Capital Inc. is Canada's first majority Indigenous-owned investment dealer, with a commitment to Indigenous economic reconciliation. The firm provides services as an underwriter or placement agent of new debt issues for corporate and government clients in Canada, with plans to potentially expand into advisory services and equity capital markets. Cedar Leaf Capital operates as a registered Investment Dealer across all provinces and territories in Canada. The company is regulated by the Canadian Investment Regulatory Organization (CIRO).\nAbout CPP InvestmentsCanada Pension Plan Investment Board (CPP Investments™) is a professional investment management organization that manages the Fund in the best interest of the more than 22 million contributors and beneficiaries of the Canada Pension Plan. In order to build diversified portfolios of assets, investments are made around the world in public equities, private equities, real estate, infrastructure and fixed income. Headquartered in Toronto, with offices in Hong Kong, London, Mumbai, New York City, San Francisco, São Paulo and Sydney, CPP Investments is governed and managed independently of the Canada Pension Plan and at arm's length from governments. At September 30, 2024, the Fund totalled C$675.1 billion. For more information, please visitwww.cppinvestments.comor follow us onLinkedIn,Instagramor on X@CPPInvestments.\nSOURCE Cedar Leaf Capital\n\nFor more information, please contact: Scotiabank (on behalf of Cedar Leaf Capital), Diana Coletto, Global Communications, diana.coletto@scotiabank.com; CPP Investments, Frank Switzer, Public Affairs and Communications, T: +1 416-523-8039, fswitzer@cppib.com",
  "id": "2025-01-28-Cedar-Leaf-Capital-joins-CPP-Investments-syndicate-of-dealers",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}