{
  "title": "CFTC Staff Issues Supplemental Letter Regarding No-Action Position on Reporting, Recordkeeping Requirements",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9042-25",
  "date": "2025-01-31",
  "date_standard": "2025-01-31",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9042-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9042-25</h1>\n<h1>\n<span>CFTC Staff Issues Supplemental Letter Regarding No-Action Position on Reporting, Recordkeeping Requirements </span>\n</h1>\n<p><b>January 31, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C</strong>.</span> — The Commodity Futures Trading Commission’s Division of Market Oversight and the Division of Clearing and Risk today announced they have taken a no-action position regarding swap data reporting and recordkeeping regulations. This position is in response to a request from KalshiEX LLC, a designated contract market, and Kalshi Klear LLC, a derivatives clearing organization, to modify CFTC Letter No. <a href=\"https://www.cftc.gov/csl/24-15/download\">24-15</a> to remove the condition prohibiting third-party clearing by participants and to cover fully-collateralized variable payout contracts.<span> </span><o:p></o:p></p><p>The Divisions will not recommend the Commission initiate an enforcement action against KalshiEX LLC, Kalshi Klear LLC, or their participants for failure to comply with certain swap-related recordkeeping requirements and for failure to report to swap data repositories data associated with binary option transactions and variable payout contract transactions executed on or subject to the rules of KalshiEX LLC and cleared through Kalshi Klear LLC, subject to the terms of the no-action letter. The supplemental letter also removes the condition in CFTC Letter No. <a href=\"https://www.cftc.gov/csl/24-15/download\">24-15</a> that prohibits Kalshi participants from clearing contracts through a third-party clearing member.<o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "ce9f9508ace59e5861ed5219ce90b22a",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}