{
  "title": "Federal Court Orders Lions of Forex and Owner to Pay $685,000 For Foreign Currency Fraud",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9039-25",
  "date": "2025-01-27",
  "date_standard": "2025-01-27",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9039-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9039-25</h1>\n<h1>\n<span>Federal Court Orders Lions of Forex and Owner to Pay $685,000 For Foreign Currency Fraud</span>\n</h1>\n<p><b>January 27, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\">WASHINGTON, D.C.</span> — The Commodity Futures Trading Commission today announced the Southern District of Florida entered orders of default final judgement against <strong>Roberto Pulido aka Berto Delvanicci </strong>and his company, <strong>Lions of Forex LLC</strong>, both of Miami, Florida.<o:p></o:p></p><p>The orders stem from the CFTC’s complaint filed Sept. 28, 2023, charging Pulido with fraudulently soliciting at least four clients to trade leveraged or margined retail off-exchange foreign currency (forex) and charging LOF with aiding and abetting Pulido’s fraudulent scheme [See CFTC Press Release No. <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8795-23\">8795-23</a>].<o:p></o:p></p><p>Under the terms of the orders, the defendants are required to pay, jointly and severally, approximately $172,000 in restitution to defrauded clients and over $516,000 in civil monetary penalties. The court’s decision also permanently enjoins the defendants from engaging in conduct that violates the Commodity Exchange Act, as charged, and permanently bans them from registering with the CFTC and from trading in any CFTC-regulated markets. The orders resolve the CFTC’s lawsuit against both defendants.<o:p></o:p></p><p><strong>Case Background<o:p></o:p></strong></p><p>The orders filed Nov. 13, 2024, find from approximately January 2019 to March 2021, Pulido, aided by LOF, fraudulently solicited clients to trade leveraged or margined retail off-exchange forex on their behalf. Several clients subscribed to a retail forex signals trading service LOF offered that would send signals to buy or sell retail forex for a monthly fee, and, for a higher monthly fee, offered live one-on-one training with Pulido. LOF offered this signals trading service through its website which touted Pulido as a “seven-figure trader.” Pulido, in various social media platforms claimed significant profits trading retail forex. After prospective clients were identified through LOF’s signals subscriptions, Pulido made various material misrepresentations and omissions to the clients, including falsely representing they would earn guaranteed monthly profits by having Pulido use his discretion to trade retail forex on their behalf, and clients could withdraw their funds at any time. However, Pulido failed to pay the promised monthly returns and when clients requested their funds, he did not return a significant portion of the clients’ funds.<o:p></o:p></p><p>The orders also find LOF aided Pulido’s fraud by, among other things, receiving client funds into its own bank accounts; allowing Pulido to use the accounts in connection with his fraudulent scheme; touting Pulido’s supposed trading expertise on the LOF website; and using the LOF email address to communicate with clients whom Pulido defrauded.<span>   </span><o:p></o:p></p><p>The CFTC appreciates the assistance of the Florida Office of Financial Regulation, the Eastern Caribbean Securities Regulatory Commission, and the Financial Services Authority of St. Vincent &amp; the Grenadines.<strong><o:p></o:p></strong></p><p>The Division of Enforcement staff responsible for this action include Elizabeth C. Brennan, David MacGregor, Lenel Hickson, Manal S. Sultan and former staff member Steven I. Ringer.<span>  </span> <o:p></o:p></p><p><strong>CFTC’s Commodity Fraud Advisory<o:p></o:p></strong></p><p>The CFTC has issued several customer protection <a href=\"http://www.cftc.gov/ConsumerProtection/FraudAwarenessPrevention/CFTCFraudAdvisories/index.htm\" target=\"_top\"><span>fraud advisories</span></a> that provide the warning signs of fraud, including the Foreign Currency (Forex) Trading Fraud Advisory, to help customers identify this sort of scam.<o:p></o:p></p><p>The CFTC strongly urges the public to verify a company’s registration with the Commission at <a href=\"http://www.nfa.futures.org/basicnet\"><span>NFA BASIC</span></a><span> </span>before committing funds. If unregistered, a customer should be wary of providing funds to that entity<o:p></o:p></p><p>Suspicious activities or information, such as possible violations of commodity trading laws, should be reported to the Division of Enforcement via a Toll-Free Hotline 866-FON-CFTC (866-366-2382) or <a href=\"http://www.cftc.gov/ConsumerProtection/FileaTiporComplaint/index.htm\" target=\"_top\"><span>file a tip or complaint</span></a> online or contact the <a href=\"https://www.whistleblower.gov/\"><span>CFTC Whistleblower Office</span></a>.  Whistleblowers are eligible to receive between 10 and 30 percent of the monetary sanctions collected paid from the CFTC Customer Protection Fund financed through monetary sanctions and paid to the CFTC by violators of the CEA.<span><strong><o:p></o:p></strong></span></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "bcebf405c5268af36803bd9efef2bf9e",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}