{
  "title": "Federal Court Orders International Enterprise to Pay Over $451 Million for Global Binary Options Fraud",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9040-25",
  "date": "2025-01-29",
  "date_standard": "2025-01-29",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9040-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9040-25</h1>\n<h1>\n<span>Federal Court Orders International Enterprise to Pay Over $451 Million for Global Binary Options Fraud</span>\n</h1>\n<p><b>January 29, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\">WASHINGTON, D.C.</span> — The Commodity Futures Trading Commission today announced the U.S. District Court for Northern District of Illinois issued an order of default judgment against five offshore entities and three individuals, finding them liable for fraud and other violations of the Commodity Exchange Act and CFTC regulations in connection with a global retail binary options fraud that victimized U.S. residents. The defendants executed their unlawful scheme through internet websites using fictitious trade names such as BigOption, BinaryBook, and BinaryOnline.<span> </span><o:p></o:p></p><p>The following foreign entities and Israeli citizens were found liable for, and enjoined from, fraud and other violations:<o:p></o:p></p><ul style=\"list-style-type:disc;\"><li class=\"BulletedHyperlink\">Yukom Communications Ltd., incorporated in Israel<o:p></o:p></li><li class=\"BulletedHyperlink\">Linkopia Mauritius Ltd., incorporated in Mauritius<o:p></o:p></li><li class=\"BulletedHyperlink\">Wirestech Limited d/b/a BigOption, incorporated in the Marshall Islands<o:p></o:p></li><li class=\"BulletedHyperlink\">WSB Investments Ltd. d/b/a BinaryBook, incorporated in Anguilla, the United Kingdom, St. Vincent and the Grenadines, and Gibraltar<o:p></o:p></li><li class=\"BulletedHyperlink\">Zolarex Ltd. d/b/a BinaryOnline, incorporated in the Marshall Islands<o:p></o:p></li><li class=\"BulletedHyperlink\">Yossi Herzog <o:p></o:p></li><li class=\"BulletedHyperlink\">Lee Elbaz <o:p></o:p></li><li class=\"BulletedHyperlink\">Shalom Peretz<o:p></o:p></li></ul><p>The order finds the defendants engaged in fraud and other violations and orders them to pay, jointly and severally, $112.9 million in restitution and a $338.7 million civil monetary penalty. The order also permanently enjoins them from engaging in conduct that violates the CEA, as charged, and permanently bans them from registering with the CFTC and from trading in any CFTC-regulated markets.<span> </span><o:p></o:p></p><p>The order stems from the CFTC’s complaint, filed Aug. 12, 2019, charging defendants with fraud and other violations. [See CFTC Press Release No.<span> </span><a href=\"https://www.cftc.gov/PressRoom/PressReleases/7995-19\">7995-19</a>]<o:p></o:p></p><p><strong>Case Background<o:p></o:p></strong></p><p>The order finds that from March 26, 2014, until the filing of the complaint on Aug. 12, 2019, the defendants made numerous fraudulent misrepresentations to customers on websites and through email and telephone solicitations, telling customers that binary option transactions were profitable, when in fact the substantial majority of their customers lost money, and individual brokers misrepresented their names, financial expertise, and physical location. The order finds the defendants misappropriated customer funds and made additional misrepresentations to thwart customers’ attempts to withdraw their funds, including failing to disclose material information about so-called “bonuses” and “risk-free trades.” The defendants also manipulated their trading platform’s risk settings to limit or prevent customers from being “in the money” with winning trades.<o:p></o:p></p><p><strong>Previous Settlement<o:p></o:p></strong></p><p>The court previously entered a consent order against another defendant involved in the fraud, Yakov Cohen, which resolved similar allegations against Cohen and required that he disgorge $7 million in ill-gotten gains received from his participation in the fraudulent binary options scheme.<span>  </span>[See CFTC Press Release <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8962-24\">8962-24</a>]<o:p></o:p></p><p><strong>Parallel Criminal Actions<o:p></o:p></strong></p><p>On Aug. 7, 2019, Elbaz was convicted by a federal jury of wire fraud and conspiracy to commit wire fraud in violation of criminal statutes based upon substantially the same underlying facts as alleged in the CFTC complaint, she was sentenced to 20 years in prison, and ordered to pay restitution of $28 million in<em> United States v. Elbaz</em>, No. 18-cr-00157 (D. Md.)<o:p></o:p></p><p>Cohen pled guilty to a charge of conspiracy to commit wire fraud predicated on the same conduct charged in CFTC’s complaint. He was sentenced to 5.5 years in prison on Aug.15, 2024 and ordered to pay $7 million in restitution on January 22, 2025, in <em>United States v. Yakov Cohen</em>, No. 19 cr 77-1 PX (D. Md.).<o:p></o:p></p><p>The CFTC thanks the U.S. Attorney’s Office for the District of Maryland for their assistance in this matter. <o:p></o:p></p><p>The Division of Enforcement staff responsible for this case are Heather Dasso, Elizabeth N. Pendleton, Elizabeth Streit, Scott R. Williamson, and Robert T. Howell.   <o:p></o:p></p><p>* * * * * * *<o:p></o:p></p><p><strong>Fraud Advisory</strong><o:p></o:p></p><p>The CFTC’s <a href=\"https://www.cftc.gov/About/CFTCOrganization/OCEO\">Office of Customer Education and Outreach</a> and the SEC’s Office of Investor Education and Advocacy have issued a joint <a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/fraudadv_binaryoptions.html\">investor alert</a> to warn about fraudulent schemes involving binary options and their trading platforms. The alert warns customers the perpetrators of these unlawful schemes may refuse to credit customer accounts, deny fund reimbursement, commit identity theft, and manipulate software to generate losing trades.<o:p></o:p></p><p><span lang=\"EN\">The CFTC also urges the public to verify a company’s registration at </span><a href=\"https://www.nfa.futures.org/basicnet/\"><span lang=\"EN\">NFA BASIC</span></a><span lang=\"EN\"> before committing funds. Customers should be wary of providing funds to any unregistered entity.</span><o:p></o:p></p><p>Suspicious activities or information, such as possible violations of commodity trading laws, can be reported to the Division of Enforcement via a toll-free hotline 866-FON-CFTC (866-366-2382) or <a href=\"http://www.cftc.gov/ConsumerProtection/FileaTiporComplaint/index.htm\">file a tip or complaint</a> online or contact the CFTC <a href=\"https://www.whistleblower.gov/\">Whistleblower Office</a>. Whistleblowers may be eligible to receive between 10 and 30 percent of the monetary sanctions collected, paid from the CFTC Customer Protection Fund financed through monetary sanctions paid to the CFTC by violators of the CEA.<o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "1dd52acda096517527f6c706d3ebe1c8",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}