{
  "title": "CFTC Charges Syracuse, N.Y., Man, His Firm with Fraud, Misappropriation",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9072-25",
  "date": "2025-05-09",
  "date_standard": "2025-05-09",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9072-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9072-25</h1>\n<h1>\n<span>CFTC Charges Syracuse, N.Y., Man, His Firm with Fraud, Misappropriation</span>\n</h1>\n<p><b>May 08, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission today announced it filed a complaint in the U.S. District Court for the Northern District of New York against <strong>Dean S. Dellas </strong>of Syracuse, New York,<strong> </strong>and his investment advisory company, <strong>DSD Capital Management, LLC</strong>,<strong> </strong>for fraud and misappropriation. </p><p>In its complaint, the CFTC seeks restitution, disgorgement of ill-gotten gains, civil monetary penalties, permanent trading and registration bans, and a permanent injunction against further violations of the Commodity Exchange Act, as charged.</p><p><strong>Case Background</strong></p><p>The complaint alleges Dellas and DSD Capital acted as commodity trading advisors who, from at least February 2021 through November 2023, committed fraud through material misrepresentations and omissions and misappropriation of more than $690,000 from at least two clients — a 61-year-old man (Client A) and his 91-year-old mother (Client B) — who had entrusted the defendants to manage their entire lifesavings.<span> </span></p><p>The complaint alleges the defendants, who had complete authority over Client A’s accounts, entered into tens of thousands of futures transactions without warning him of the inherent risks. These trades incurred more than $169,000 in trading losses and commissions. The defendants concealed these losses and commissions from Client A, assuring him his accounts were doing well. Although the defendants agreed and represented they would only charge fees equating to 10% of profits, they took considerably more than they were entitled. Indeed, despite the significant losses Client A had suffered, the defendants misappropriated more than $235,000 from Client A by secretly transferring to themselves large sums of Client A’s money and fraudulently charging excessive, unjustified fees.</p><p>The complaint also alleges after succeeding in defrauding Client A, the defendants expanded their fraud to Client A’s elderly mother, Client B. Without her knowledge, the defendants bought or sold futures contracts through Client B’s account tens of thousands of times, causing her to incur more than $196,000 in trading losses and commissions. The defendants actively concealed these losses from Client B and misappropriated more than $459,000 from her by transferring to themselves large sums of her money and fraudulently charging fees that were excessive and unjustified given the defendants’ promise to only charge fees equating to 10% of profits.</p><p>According to the complaint, to keep their fraud ongoing, the defendants took various steps to conceal and obfuscate their conduct. Among other things, Dellas concealed the substance of documents he directed Clients A and B to sign and impersonated them in dealings with futures commission merchants.<span>   </span></p><p><strong>Parallel Criminal Action</strong></p><p>On May 6, the U.S. Attorney’s Office for the Northern District of New York unsealed an indictment charging Dean Dellas with wire fraud and aggravated identity theft in connection with the same scheme alleged in the CFTC’s complaint. <em>United States v. Dellas</em>, <span>No. 5:25-cr-184 (N.D.N.Y.)</span>, ECF No. <span>1</span> (indictment).</p><p>The CFTC appreciates the assistance of the FBI and the U.S. Attorney’s Office for the Northern District of New York.</p><p>The Division of Enforcement staff responsible for this case are Chrystal Gonnella, Dmitriy Vilenskiy, Derek S. Hammond, Jonah E. McCarthy, A. Daniell Ullman II, and Paul G. Hayeck.</p><p style=\"background-color:white;vertical-align:baseline;\"><span style=\"border:1.0pt none windowtext;color:0in;\"><strong>CFTC Fraud Advisories</strong></span></p><p style=\"background-color:white;vertical-align:baseline;\"><span style=\"border:1.0pt none windowtext;padding:0in;\">The CFTC has issued several customer protection </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/index.htm\"><span style=\"border:1.0pt none windowtext;padding:0in;\">Fraud Advisories and Articles </span></a><span style=\"border:1.0pt none windowtext;padding:0in;\">about how customers can detect, avoid, and report scams.</span></p><p>The CFTC also strongly urges the public to verify a company’s registration with the CFTC at <a href=\"http://www.nfa.futures.org/basicnet\">NFA BASIC</a> before committing funds. If unregistered, a customer should be wary of providing funds to that entity.</p><p>Suspicious activities or information, such as possible violations of commodity trading laws, can be reported to the Division of Enforcement via a toll-free hotline 866-FON-CFTC (866-366-2382) or<a href=\"http://www.cftc.gov/ConsumerProtection/FileaTiporComplaint/index.htm\"> file a tip or complaint online</a> or contact the <a href=\"https://www.whistleblower.gov/\">Whistleblower Office</a>. Whistleblowers are eligible to receive between 10 and 30 percent of the monetary sanctions collected, paid from the Customer Protection Fund financed through monetary sanctions paid to the CFTC by violators of the CEA.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "5d1c97afe4616b67dd3590e6bc61b692",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}