{
  "title": "Acting Chairman Pham Statement on Court Sanctions Against CFTC",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9074-25",
  "date": "2025-05-13",
  "date_standard": "2025-05-13",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9074-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9074-25</h1>\n<h1>\n<span>Acting Chairman Pham Statement on Court Sanctions Against CFTC</span>\n</h1>\n<p><b>May 13, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>WASHINGTON, D.C. — </strong>Commodity Futures Trading Commission Acting Chairman Caroline D. Pham made the following statement regarding the Federal District Court <a href=\"https://www.cftc.gov/media/12106/ogc_KazmiReportRecommendationSactions051325/download\"><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>report and recommendations</span></a> for sanctions against the CFTC for misconduct in <em>CFTC v. Traders Global Group Inc</em>:</p><p>“Americans rightly demand the highest level of conduct, candor, professionalism, and ethics from the federal government—especially law enforcement agencies like the CFTC. As described in detail in the Court’s report, the CFTC engaged in willful and bad faith conduct by making multiple false statements to the Court and other ‘numerous instances of sanctionable behavior’ over the course of a year. This is inexcusable. The CFTC must now accept accountability so that appropriate corrective action can finally be taken to address the conduct issues, and the CFTC can put this behind us and move forward to restore the agency’s credibility and reputation.</p><p>“This case is a wakeup call to those of us who hold and serve the public’s trust. The conduct by CFTC staff and especially CFTC management in this case led to failures that were foreseeable, which means they were also avoidable. I first raised numerous concerns about CFTC conduct in this case nearly two years ago—even <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/phamstatement070324\">before</a> the complaint was filed, and again <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/phamstatement070324b\">during</a> the litigation when I reviewed CFTC emails evidencing management efforts to conceal the false statements from the Court. The CFTC not only disregarded my serious concerns and an <a href=\"https://www.grassley.senate.gov/imo/media/doc/grassley_to_cftc_-_staff_accountability.pdf\">oversight letter</a> from a member of Congress, but also engaged in a malicious campaign of retaliation and defamation designed to impugn my character and integrity. It is vindicating that the Court cites my prior statements that raised concerns in this case and my efforts to ensure accountability.</p><p>“While the Court’s findings have shined a bright light on the CFTC’s widespread violations of both the duty of candor to the Court and applicable rules of attorney professional conduct, these types of failures are rarely an isolated incident and point to a broader breakdown in the culture of the Division of Enforcement. This case clearly shows that the Division has for far too long maintained a culture that the CFTC is above the law and that breaking the rules is justified because the CFTC is a government agency. This culture is a slippery slope that turns good intentions into bad actions and normalizes wrongdoing.</p><p>“Worse, this culture has predictably led to the abuse of the government’s prosecutorial power and the violation of a defendant’s Constitutional right to due process. I have discovered that for years, many highly respected leaders of the legal profession and former government attorneys have repeatedly raised red flags about CFTC staff conduct in enforcement actions—even before I raised concerns as a Commissioner. It is therefore unsurprising that the Court finds that ‘[w]ithout the imposition of sanctions, [the CFTC’s] conduct appears likely to repeat itself.’</p><p>“Since I became Acting Chairman, I’ve wasted no time in fixing these issues. We’ve <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9044-25\">reorganized the CFTC’s Division of Enforcement</a>, ensuring cases are appropriately assigned based on staff experience and expertise. We’ve <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9054-25\">established transparent, public guidelines</a> to encourage greater self-reporting and cooperation in enforcement actions and <a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/opapham13\">launched an initiative</a> to reduce a backlog of noncompliance matters, redirecting resources to more serious fraud and manipulation cases. We’ve <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9063-25\">adopted a Justice Department policy</a> aimed at ending regulation by prosecution, and took steps to <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9067-25\">improve communication and referral procedures</a> between the Division of Enforcement and the CFTC’s other operating divisions. </p><p>“I also want to commend our new Director of Enforcement, <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9053-25\">Brian Young</a>, for taking immediate and proactive steps to promote an ethical culture and enhance continuing education and training opportunities for our enforcement staff to make sure this conduct never happens again, and the CFTC adheres to the highest standards.</p><p>“We are now closing this chapter so we can focus on the future. The CFTC is made up of hundreds of dedicated and talented public servants who routinely demonstrate our value to our markets and American taxpayers. This case does not reflect the CFTC’s people, our values, or our critical mission. Trust is earned, and the CFTC remains committed to delivering for the American people.<span>  </span>As an agency, we will take the lessons learned from this case and be better for it.”</p><p>The Court’s report finds that the CFTC’s conduct and internal communications “. . . implicate involvement of both the CFTC line attorneys and the highest levels of management in the CFTC’s Division of Enforcement.” The Court’s report also finds, “The CFTC, as one of the primary prudential regulators in the United States, has an obligation to discharge all of its obligations—statutory, regulatory, and ethical—faithfully. It also unquestionably has a duty of candor to the Court. However, at almost every stage in this case, the CFTC failed in this regard.” While some CFTC staff were removed from the case in 2024 following the filing of the sanctions motion, the CFTC has taken necessary measures to ensure accountability at all levels, including placing staff on administrative leave pending further investigation.</p><p><strong>Proactive CFTC Remediation and Reform Efforts</strong></p><p>Since being elevated to Acting Chairman in January, Pham has proactively led efforts to overhaul the CFTC’s Division of Enforcement and reform culture and conduct, develop staff, and leverage expertise and reduce siloing. The establishment of a new task force model allows CFTC attorneys to specialize in categories of cases, thereby enhancing relevant knowledge, practices and mentoring opportunities, and reducing the risk of legal or ethical lapses. </p><p>The Division of Enforcement has also launched a Basic Trial Advocacy Skills training series, with sessions ranging from opening, closing and direct examinations, interactions with jury and opposing counsel, and techniques to avoid creating misimpressions, with more sessions being planned. The sessions offer practical instruction on investigations and litigation as well as opportunities to discuss ethical and discovery dilemmas that can occur in real life litigation scenarios. </p><p>The Division of Enforcement also delivered various ethics training, including ensuring candor and openness in engagement with defense counsel. It also hosted a training on the American Bar Association’s Model Rules of Professional Conduct as applied to government attorneys, with additional trainings being planned. </p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "2dbb838add5dcbcad8949d53ea1bc107",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}