{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2023-01-17",
  "period": "",
  "accession_number": "0000019617-23-000083",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0000019617-23-000083-index.html",
  "text": "                                                                                                            \n                                               UNITED STATES                                                \n                                                                                                            \n                                                                                                            \n                                     SECURITIES AND EXCHANGE COMMISSION                                     \n                                                                                                            \n                                                                                                            \n                                           Washington, D.C. 20549                                           \n                                                                                                            \n                                                                                                            \n                                                  FORM 8-K                                                  \n                                                                                                            \n                                                                                                            \n                                               CURRENT REPORT                                               \n                                                                                                            \n                   Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934                   \n                                                                                                            \n                     Date of Report (date of earliest event reported): January 17, 2023                     \n                                                                                                            \n                                            JPMorgan Chase & Co.                                            \n                                                                                                            \n                           (Exact name of registrant as specified in its charter)                           \n                                                                                                            \n  Delaware                                                   1-5805                             13-2624428  \n  (State or other jurisdiction of                            -Commission File Number      -I.R.S. employer  \n  incorporation or organization)                                                        identification no.  \n  383 Madison Avenue,                                                                                       \n                                    New York,    New York                                            10179  \n  (Address of principal executive                                                                -Zip Code  \n  offices)                                                                                                  \n                                                                                                            \n                    Registrant’s telephone number, including area code: ( 212) 270-6000                     \nCheck the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following provisions:\n                                                                                              \n  ☐    Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)  \n                                                                                              \n                                                                                               \n  ☐    Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)  \n                                                                                               \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR             \n       240.14d-2(b))                                                                                        \n                                                                                                            \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR             \n       240.13e-4(c))                                                                                        \n                                                                                                            \n                        Securities registered pursuant to Section 12(b) of the Act:                         \n                                                                                                            \n  Title of each class                        Trading Symbol(s)    Name of each exchange on which            \n                                                                  registered                                \n  Common stock                               JPM                  The New York Stock Exchange               \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 5.75% Non-Cumulative Preferred          JPM PR D             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series DD                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 6.00% Non-Cumulative Preferred          JPM PR C             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series EE                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.75% Non-Cumulative Preferred          JPM PR J             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series GG                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.55% Non-Cumulative Preferred          JPM PR K             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series JJ                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share     JPM PR L             The New York Stock Exchange               \n  of 4.625% Non-Cumulative Preferred                                                                        \n  Stock, Series LL                                                                                          \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.20% Non-Cumulative Preferred          JPM PR M             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series MM                                                                                                 \n  Alerian MLP Index ETNs due May 24, 2024    AMJ                  NYSE Arca, Inc.                           \n  Guarantee of Callable Fixed Rate Notes                                                                    \n  due June 10, 2032 of JPMorgan Chase        JPM/32               The New York Stock Exchange               \n  Financial Company LLC                                                                                     \n                                                                                                            \nIndicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the\nSecurities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934\n(§240.12b-2 of this chapter).\n\nEmerging growth company ☐\n\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended\ntransition period for complying with any new or revised financial accounting standards provided pursuant to\nSection 13(a) of the Exchange Act. ☐\n\nItem 5.03 Amendments to Articles of Incorporation or Bylaws; Change in Fiscal Year.\n\nOn January 17, 2023, the Board of Directors of JPMorgan Chase & Co. (the “Firm”) adopted amendments to the\nFirm’s By-laws, effective January 17, 2023 (as so amended, the “By-laws”), to revise and clarify procedural\nand disclosure requirements for the Firm’s stockholders proposing business for consideration or nominating\ndirectors for election at meetings of stockholders, including in order to provide an orderly process in\nconsideration of the U.S. Securities and Exchange Commission’s recently adopted “universal proxy card” rules\nby, among other things:\n\n• Adding Sections 1.09(a)(3) and (5) to enhance disclosure requirements for stockholders intending to\nnominate directors or propose other business (other than proposals to be included in the Firm’s proxy\nstatement pursuant to Rule 14a-8 under the Securities Exchange Act of 1934, as amended (the “Exchange Act”))\n(“Proposing Stockholders”) at meetings of stockholders, including without limitation, to:\n\n◦ require a Proposing Stockholder’s notice to provide more inclusive disclosures and representations in\nrespect of any proposed nominee, including, among other things, information previously requested only in\nconnection with the By-laws’ proxy access requirements in Section 1.10;\n\n◦ require a Proposing Stockholder’s notice to provide more inclusive disclosures and representations in\nrespect of the Proposing Stockholder, including, among other things, information about other stockholders or\nbeneficial owners known to be supporting the nomination; and\n\n◦ clarifying that certain required disclosures and representations applicable to a Proposing Stockholder\nalso apply to any beneficial owner of stock on whose behalf the nomination is made, and any person acting in\nconcert with the Proposing Stockholder or such beneficial owner;\n\n• Adding Section 1.09(a)(6) to require, in connection with the nomination of persons for election to the\nBoard, that:\n\n◦ prior to submitting the Proposing Stockholder’s notice, a Proposing Stockholder request from the Secretary\nin writing the required forms of questionnaire, representation, and agreement;\n\n◦ the Proposing Stockholder’s notice include the completed questionnaire signed by each proposed nominee;\n\n◦ the Proposing Stockholder’s notice include the representation and agreements signed by, as applicable, the\nProposing Stockholder, each proposed nominee, and any other person on whose behalf the nomination is made\n(each, an “Applicable Person”), and, among other things\n\n▪ agreeing to update and supplement the disclosures in the Proposing Stockholder’s notice so that such\nnotice is true and accurate as of the record date and as of the date that is the 10th business day prior to\nthe stockholder meeting or any adjournment or postponement thereof;\n\n▪ agreeing that the proposed nominee will meet with the Firm’s Corporate Governance & Nominating Committee\n(“CGNC”) at the CGNC’s reasonable request, to discuss matters relating to the nomination; and\n\n▪ providing certain other representations and agreements previously requested only in connection with the\nBy-laws’ proxy access requirements in Section 1.10.\n\n• Adding Section 1.09(a)(7) to clarify that the Firm may, as a condition of any nomination being deemed\nproperly brought by a Proposing Stockholder before a stockholder meeting, require any Applicable Person to\nprovide additional information that could be (i) required by the Firm to assess the independence of the\nproposed nominee or whether such proposed nominee meets the requirements for membership on the Board or any\ncommittee thereof, or (ii) material to a reasonable stockholder’s understanding of the qualifications and\nfitness and/or independence of any proposed nominee, including, in the case of any proposed nominee that\ncurrently serves or has previously served on the Board, any violation of the Firm’s Corporate Governance\nPrinciples, Code of Conduct or any other Firm policies and guidelines applicable to directors;\n\n• Amending Section 1.09(c) to require a Proposing Stockholder to (i) use a proxy card color other than white\nand (ii) certify (and upon request by the Firm, provide reasonable evidence) that it has met the\nrequirements of Rule 14a-19 under the Exchange Act notice pursuant to Rule 14a-19(b) under the Exchange Act.\nChanges to Section 1.09(c) also clarify the procedures for the Firm to address deficiencies in stockholder\nnominations, including clarifying that, unless required by applicable law, if the Proposing Stockholder\nprovides notice pursuant to Rule 14a-19(b) under the Exchange Act and subsequently fails either to comply\nwith the requirements of Rule 14a-19(a)(2) or (3) under the Exchange Act or to timely provide reasonable\nevidence to the Firm that the Proposing Stockholder has met the requirements of Rule 14a-19(a)(3) under the\nExchange Act, then such nomination will be disregarded, notwithstanding any proxies or votes the Firm has\nreceived in respect of the Proposing Stockholder’s proposed nominees.\n\nOther amendments to the By-laws include: revising Sections 1.03, 1.04, 1.07, and 1.11 to conform with\ndevelopments in the Delaware General Corporation Law; revising Section 11.01 to clarify the scope of the\nEmergency By-laws; and making additional clarifying and conforming revisions.\n\nThe foregoing description of the amendments to the By-laws does not purport to be a complete summary and is\nqualified in its entirety by reference to the full text of the By-laws, a copy of which is attached as\nExhibit 3.2 and incorporated by reference herein .\n                                                     2                                                      \n                                                                                                            \n   Item 9.01 Financial Statements and Exhibits                                                              \n                                                                                                            \n(d) Exhibit\n                                                                                                            \n  Exhibit No.    Description of Exhibit                                                                     \n  3.2            By-laws of JPMorgan Chase & Co., as amended, effective January 17, 2023                    \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n  101            Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL         \n                 (Inline eXtensible Business Reporting Language).                                           \n  104            Cover Page Interactive Data File (embedded within the Inline XBRL document and included    \n                 in Exhibit 101).                                                                           \n                                                                                                            \n                                                     3                                                      \n                                                                                                            \n                                                 SIGNATURE                                                  \nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this\nreport to be signed on its behalf by the undersigned hereunto duly authorized.\n                        \n  JPMorgan Chase & Co.  \n  (Registrant)          \n                        \n                                \n  By:    /s/ John H. Tribolati  \n         John H. Tribolati      \n         Corporate Secretary    \n                                \n                              \n  Dated:    January 17, 2023  \n ──────────────────────────── \n                              \n                                                     4                                                      \n"
}