{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2024-01-18",
  "period": "",
  "accession_number": "0000019617-24-000109",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0000019617-24-000109-index.html",
  "text": "                                                                                                            \n                                               UNITED STATES                                                \n                                                                                                            \n                                                                                                            \n                                     SECURITIES AND EXCHANGE COMMISSION                                     \n                                                                                                            \n                                                                                                            \n                                           Washington, D.C. 20549                                           \n                                                                                                            \n                                                                                                            \n                                                  FORM 8-K                                                  \n                                                                                                            \n                                                                                                            \n                                               CURRENT REPORT                                               \n                                                                                                            \n                   Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934                   \n                                                                                                            \n                     Date of Report (date of earliest event reported): January 16, 2024                     \n                                                                                                            \n                                            JPMorgan Chase & Co.                                            \n                                                                                                            \n                           (Exact name of registrant as specified in its charter)                           \n                                                                                                            \n  Delaware                                                   1-5805                             13-2624428  \n  (State or other jurisdiction of                            -Commission File Number      -I.R.S. employer  \n  incorporation or organization)                                                        identification no.  \n  383 Madison Avenue,                                                                                       \n                                    New York,    New York                                            10179  \n  (Address of principal executive                                                                -Zip Code  \n  offices)                                                                                                  \n                                                                                                            \n                    Registrant’s telephone number, including area code: ( 212) 270-6000                     \nCheck the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following provisions:\n                                                                                              \n  ☐    Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)  \n                                                                                              \n                                                                                               \n  ☐    Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)  \n                                                                                               \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR             \n       240.14d-2(b))                                                                                        \n                                                                                                            \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR             \n       240.13e-4(c))                                                                                        \n                                                                                                            \n                        Securities registered pursuant to Section 12(b) of the Act:                         \n                                                                                                            \n  Title of each class                        Trading Symbol(s)    Name of each exchange on which            \n                                                                  registered                                \n  Common stock                               JPM                  The New York Stock Exchange               \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 5.75% Non-Cumulative Preferred          JPM PR D             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series DD                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 6.00% Non-Cumulative Preferred          JPM PR C             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series EE                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.75% Non-Cumulative Preferred          JPM PR J             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series GG                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.55% Non-Cumulative Preferred          JPM PR K             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series JJ                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share     JPM PR L             The New York Stock Exchange               \n  of 4.625% Non-Cumulative Preferred                                                                        \n  Stock, Series LL                                                                                          \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.20% Non-Cumulative Preferred          JPM PR M             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series MM                                                                                                 \n  Alerian MLP Index ETNs due May 24, 2024    AMJ                  NYSE Arca, Inc.                           \n  Guarantee of Callable Fixed Rate Notes                                                                    \n  due June 10, 2032 of JPMorgan Chase        JPM/32               The New York Stock Exchange               \n  Financial Company LLC                                                                                     \n                                                                                                            \nIndicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the\nSecurities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934\n(§240.12b-2 of this chapter).\n\nEmerging growth company ☐\n\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended\ntransition period for complying with any new or revised financial accounting standards provided pursuant to\nSection 13(a) of the Exchange Act. ☐\n\nItem 5.02(e) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain\nOfficers; Compensatory Arrangements of Certain Officers\n\nJPMorgan Chase & Co. (the “Firm”) announced that the independent members of the Board of Directors (the\n“Board”) approved the annual compensation for 2023 for Mr. James Dimon, CEO, in the amount of $36,000,000,\ncompared to last year’s annual compensation of $34,500,000. The annual compensation for 2023 reflects Mr.\nDimon’s stewardship of the Firm, with growth across all of its market leading lines of business, record\nfinancial results and a fortress balance sheet. In addition, the Firm successfully navigated and supported\nits clients and customers through the regional bank turmoil as well as completed the acquisition of First\nRepublic.\n\nMr. Dimon’s total compensation includes an annual base salary of $1,500,000 and performance-based variable\nincentive compensation of $34,500,000. $5,000,000 of the variable incentive compensation will be delivered\nin cash and the remaining $29,500,000 will be delivered in the form of at-risk Performance Share Units\n(\"PSUs\"). PSUs tie 100% of Mr. Dimon’s annual equity-based compensation to ongoing performance metrics,\nrepresenting 86% of his total variable incentive compensation. The key features of the PSU program are\nstructurally consistent with last year, including the financial metric (return on tangible common equity 1 -\n\"ROTCE\") with absolute and relative performance goals, payout levels, vesting and hold requirements, as well\nas clawback and recovery provisions 2 .\n\nAmid the significant challenges of the regional bank turmoil, ongoing, growing geopolitical tensions, global\neconomic uncertainty, and elevated inflation and higher rates, under Mr. Dimon's stewardship, the Firm\ncontinued to serve its clients and customers around the world to advance economic growth, while investing in\nand executing on long-term strategic initiatives. The Firm’s businesses saw continued momentum during 2023,\ndemonstrating the power of its years of investments and the value of its consistency and fortress\nprinciples. In 2023, the Firm reported record revenue for the 6 th consecutive year of $162.4 billion 1 and\nnet income of $49.6 billion, or $16.23 per share, with ROTCE of 21%. The Firm increased its quarterly common\ndividend from $1.00 to $1.05 per share and continued to reinforce its fortress balance sheet.\n\nThe Firm ended the year with a common equity Tier 1 ratio of 15.0%, CET1 capital of $250.6 billion and $1.4\ntrillion of cash and marketable securities, providing it with meaningful capacity to support clients and\nfurther invest in its business and communities. During 2023, the Firm raised over $2.3 trillion 3 of credit\nand capital for its consumer and institutional clients around the world, which includes individuals,\nhomeowners, small businesses, larger corporations, schools, hospitals, cities and countries in all regions\nof the world. The Firm continued its investments in technology, people, systems and products, as well as its\nsteadfast commitment to corporate responsibility, including helping to create a stronger, more inclusive\neconomy and advance cities and neighborhoods around the world, positioning the Firm for future success.\n\nAs part of determining Mr. Dimon’s compensation, the Board considered his holistic performance across\nfinancial and non-financial performance dimensions, including his continued exemplary leadership of the Firm\nwhich continues to be one of the largest financial services firms in the world and is a leader in investment\nbanking, financial services for consumers and small businesses, commercial banking, financial transaction\nprocessing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of\ncustomers, predominantly in the United States, and many of the world’s most prominent corporate,\ninstitutional and government clients globally.\n\nThe Board continues to recognize that the Firm is in a uniquely fortunate position to be led by such a\nhighly talented and experienced executive who continues to grow the company, maintain market leadership\npositions, strengthen the Firm’s reputation, invest in opportunities for the future, promote diversity and\nbest practices, manage risk and develop great leaders, while also maintaining his focus on the Firm’s\nclients.\n\n1 Revenue is on a managed basis. Managed revenue and ROTCE are non-GAAP financial measures. For further\ndiscussion, see notes (a) and (b) on page 6 of Exhibit 99.1 to the Firm’s Current Report on Form 8-K dated\nJanuary 12, 2024, which has been filed with the U.S. Securities and Exchange Commission, containing the\nFirm's earnings press release for the quarter ended December 31, 2023.\n\n2 Equity incentives are subject to the JPMorgan Chase Bonus Recoupment Policy which applies in the event of\na material restatement of the Firm's financial results as well as the Policy for the Recovery of Erroneously\nAwarded Incentive-Based Compensation. In addition, all equity awards granted in 2024 contain recapture\nprovisions that enable the Firm to cancel outstanding awards and/or recover the value of certain stock\ndistributed under the award in specified circumstances. In addition to recapture provisions, portions of\nequity awards awarded to the CEO are also subject to additional Protection-based Vesting provisions under\nwhich awards may be cancelled as determined by the Compensation & Management Development Committee of the\nBoard of Directors and ratified by the Board of Directors.\n\n3 Credit provided to clients represents new and renewed credit, including loans and commitments.\n                                                     2                                                      \n                                                                                                            \n   Item 9.01 Financial Statements and Exhibits                                                              \n                                                                                                            \n(d) Exhibit\n                                                                                                            \n  Exhibit No.    Description of Exhibit                                                                     \n  101            Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL         \n                 (Inline eXtensible Business Reporting Language).                                           \n  104            Cover Page Interactive Data File (embedded within the Inline XBRL document and included    \n                 in Exhibit 101).                                                                           \n                                                                                                            \n                                                     3                                                      \n                                                                                                            \n                                                 SIGNATURE                                                  \nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this\nreport to be signed on its behalf by the undersigned hereunto duly authorized.\n                        \n  JPMorgan Chase & Co.  \n  (Registrant)          \n                        \n                                \n  By:    /s/ John H. Tribolati  \n         John H. Tribolati      \n         Corporate Secretary    \n                                \n                              \n  Dated:    January 18, 2024  \n ──────────────────────────── \n                              \n                                                     4                                                      \n"
}