{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2025-01-23",
  "period": "",
  "accession_number": "0000019617-25-000056",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0000019617-25-000056-index.html",
  "text": "                                                                                                            \n                                               UNITED STATES                                                \n                                                                                                            \n                                                                                                            \n                                     SECURITIES AND EXCHANGE COMMISSION                                     \n                                                                                                            \n                                                                                                            \n                                           Washington, D.C. 20549                                           \n                                                                                                            \n                                                                                                            \n                                                  FORM 8-K                                                  \n                                                                                                            \n                                                                                                            \n                                               CURRENT REPORT                                               \n                                                                                                            \n                   Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934                   \n                                                                                                            \n                     Date of Report (date of earliest event reported): January 21, 2025                     \n                                                                                                            \n                                            JPMorgan Chase & Co.                                            \n                                                                                                            \n                           (Exact name of registrant as specified in its charter)                           \n                                                                                                            \n  Delaware                                                   1-5805                             13-2624428  \n  (State or other jurisdiction of                            -Commission File Number      -I.R.S. employer  \n  incorporation or organization)                                                        identification no.  \n  383 Madison Avenue,                                                                                       \n                                    New York,    New York                                            10179  \n  (Address of principal executive                                                                -Zip Code  \n  offices)                                                                                                  \n                                                                                                            \n                    Registrant’s telephone number, including area code: ( 212) 270-6000                     \nCheck the appropriate box below if the Form 8-K filing is intended to simultaneously satisfy the filing\nobligation of the registrant under any of the following provisions:\n                                                                                              \n  ☐    Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)  \n                                                                                              \n                                                                                               \n  ☐    Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR 240.14a-12)  \n                                                                                               \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 14d-2(b) under the Exchange Act (17 CFR             \n       240.14d-2(b))                                                                                        \n                                                                                                            \n                                                                                                            \n  ☐    Pre-commencement communications pursuant to Rule 13e-4(c) under the Exchange Act (17 CFR             \n       240.13e-4(c))                                                                                        \n                                                                                                            \n                        Securities registered pursuant to Section 12(b) of the Act:                         \n                                                                                                            \n  Title of each class                        Trading Symbol(s)    Name of each exchange on which            \n                                                                  registered                                \n  Common stock                               JPM                  The New York Stock Exchange               \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 5.75% Non-Cumulative Preferred          JPM PR D             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series DD                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 6.00% Non-Cumulative Preferred          JPM PR C             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series EE                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.75% Non-Cumulative Preferred          JPM PR J             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series GG                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.55% Non-Cumulative Preferred          JPM PR K             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series JJ                                                                                                 \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share     JPM PR L             The New York Stock Exchange               \n  of 4.625% Non-Cumulative Preferred                                                                        \n  Stock, Series LL                                                                                          \n  Depositary Shares, each representing a                                                                    \n  one-four hundredth interest in a share                                                                    \n  of 4.20% Non-Cumulative Preferred          JPM PR M             The New York Stock Exchange               \n  Stock,                                                                                                    \n  Series MM                                                                                                 \n  Guarantee of Callable Fixed Rate Notes                                                                    \n  due June 10, 2032 of JPMorgan Chase        JPM/32               The New York Stock Exchange               \n  Financial Company LLC                                                                                     \n  Guarantee of Alerian MLP Index ETNs due                                                                   \n  January 28, 2044 of JPMorgan Chase         AMJB                 NYSE Arca, Inc.                           \n  Financial Company LLC                                                                                     \n                                                                                                            \nIndicate by check mark whether the registrant is an emerging growth company as defined in Rule 405 of the\nSecurities Act of 1933 (§230.405 of this chapter) or Rule 12b-2 of the Securities Exchange Act of 1934\n(§240.12b-2 of this chapter).\n\nEmerging growth company ☐\n\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended\ntransition period for complying with any new or revised financial accounting standards provided pursuant to\nSection 13(a) of the Exchange Act. ☐\n\nItem 5.02(e) Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain\nOfficers; Compensatory Arrangements of Certain Officers\n\nJPMorgan Chase & Co. (the “Firm”) announced that the independent members of the Board of Directors (the\n“Board”) approved the annual compensation for 2024 for Mr. James Dimon, CEO, in the amount of $39,000,000,\ncompared to last year’s annual compensation of $36,000,000. The annual compensation for 2024 reflects Mr.\nDimon’s stewardship of the Firm, with growth across all of its market-leading lines of business, record\nfinancial results and a fortress balance sheet, and continues to demonstrate strong pay-for-performance\nalignment.\n\nMr. Dimon’s total compensation includes an annual base salary of $1,500,000 and performance-based variable\nincentive compensation of $37,500,000. $5,000,000 of the variable incentive compensation will be delivered\nin cash and the remaining $32,500,000 will be delivered in the form of at-risk Performance Share Units\n(\"PSUs\"). PSUs tie 100% of Mr. Dimon’s annual equity-based compensation to ongoing performance metrics,\nrepresenting 87% of his total variable incentive compensation. This significant weighting of pay mix to\nequity is designed to align with shareholders’ interests by encouraging continued focus on the long-term\nsuccess of the Firm. The key features of the PSU program are consistent with last year, including the\nfinancial metric (return on tangible common equity 1 - \"ROTCE\") with absolute and relative performance\ngoals, payout levels, vesting and hold requirements, as well as clawback and recovery provisions 2 .\n\nDuring the year, under Mr. Dimon's stewardship, the Firm continued to serve clients and customers against a\ndynamic global macro backdrop characterized by ongoing geopolitical tensions and economic uncertainty. The\nFirm generated strong current returns while investing in and executing on long-term strategic initiatives,\nconsistent with its fortress principles. In 2024, the Firm reported record revenue for the seventh\nconsecutive year of $180.6 billion 1 and record net income of $58.5 billion, or $19.75 per share, with ROTCE\nof 22% representing sustained strong relative outperformance compared to peers. The Firm increased its\nquarterly common dividend from $1.05 to $1.25 per share.\n\nThe Firm ended 2024 with a common equity Tier 1 (“CET1”) ratio of 15.7%, CET1 capital 3 of $275.5 billion\nand $1.4 trillion of cash and marketable securities 4 , providing it with meaningful capacity to support\nclients and further invest in its business and communities. During 2024, the Firm raised approximately $2.8\ntrillion of credit and capital 5 for its consumer and institutional clients around the world, which include\nindividuals, homeowners, small businesses, larger corporations, schools, hospitals, cities and countries.\nThe Firm continued its investments in technology, people and products, as well as its steadfast commitment\nto corporate responsibility, including helping to create a stronger, more inclusive economy and advance\ncities and neighborhoods, positioning the Firm for future success.\n\nThe Board evaluated Mr. Dimon’s holistic performance across financial and non-financial performance\ndimensions, as well as the competitive environment, in determining his compensation. As part of their\nevaluation and determination, the Board considered Mr. Dimon’s continued development of top executives to\nlead for today and the future, his continued commitment to shareholders and his longstanding exemplary\nleadership of a premier financial services firm. Under the J.P. Morgan and Chase brands, which include\ninvestment banking, financial services for consumers and small businesses, commercial banking, financial\ntransaction processing and asset management, the Firm serves millions of customers, predominantly in the\nUnited States, and many of the world’s most prominent corporate, institutional and government clients\nglobally.\n\nSeparately, Mr. Dimon and his family plan to sell approximately 1 million shares of their JPMorgan stock\nholdings for financial diversification and tax-planning purposes. While there is no intention to execute\nfurther sales at this time, they retain the option to do so in the future. After the contemplated sales, Mr.\nDimon will continue to have a significant stake in the company, with he and his family currently holding\napproximately 7.5 million shares. He also continues to have unvested Performance\n\n1 Revenue is on a managed basis. Managed revenue and ROTCE are non-GAAP financial measures. For further\ndiscussion, see notes (a) and (b) on page 6 of Exhibit 99.1 to the Firm’s Current Report on Form 8-K dated\nJanuary 15, 2025, which has been filed with the U.S. Securities and Exchange Commission, containing the\nFirm's earnings press release for the quarter ended December 31, 2024.\n\n2 Equity incentives are subject to the JPMorgan Chase Bonus Recoupment Policy which applies in the event of\na material restatement of the Firm's financial results as well as the Recovery of Erroneously Awarded\nIncentive-Based Compensation Policy. In addition, all equity awards granted in 2025 contain recapture\nprovisions that enable the Firm to cancel outstanding awards and/or recover the value of certain stock\ndistributed under the award in specified circumstances. In addition to recapture provisions, portions of\nequity awards granted to the CEO are also subject to additional Protection-based Vesting provisions under\nwhich awards may be cancelled as determined by the Compensation & Management Development Committee of the\nBoard of Directors and ratified by the Board of Directors.\n\n3 Estimated. For further discussion, see note (3) on page 7 of Exhibit 99.1 to the Firm’s Current Report on\nForm 8-K dated January 15, 2025, which has been filed with the U.S. Securities and Exchange Commission,\ncontaining the Firm's earnings press release for the quarter ended December 31, 2024.\n\n4 Estimated. For further discussion, see note (4) on page 7 of Exhibit 99.1 to the Firm’s Current Report on\nForm 8-K dated January 15, 2025, which has been filed with the U.S. Securities and Exchange Commission,\ncontaining the Firm's earnings press release for the quarter ended December 31, 2024.\n\n5 For further discussion, see note (12) on page 7 of Exhibit 99.1 to the Firm’s Current Report on Form 8-K\ndated January 15, 2025, which has been filed with the U.S. Securities and Exchange Commission, containing\nthe Firm's earnings press release for the quarter ended December 31, 2024.\n                                                     2                                                      \nShare Units relating to 683,880 shares 6 and Stock Appreciation Rights relating to 1,500,000 shares, subject\nto the terms and conditions of each grant. Mr. Dimon will use stock trading plans to sell his shares, in\naccordance with guidelines specified under Rule 10b5-1 of the Securities and Exchange Act of 1934.\n\n6 Reflects the target number of PSUs granted. Each PSU represents the right to receive one share of common\nstock on the vesting date. The ultimate number of PSUs that will vest will be determined by the Firm’s\nperformance over the three-year performance period and will include any accumulated reinvested dividend\nequivalent shares.\n                                                     3                                                      \n                                                                                                            \n  Item 9.01 Financial Statements and Exhibits                                                               \n                                                                                                            \n(d) Exhibit\n                                                                                                            \n  Exhibit No.    Description of Exhibit                                                                     \n  101            Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in Inline XBRL         \n                 (Inline eXtensible Business Reporting Language).                                           \n  104            Cover Page Interactive Data File (embedded within the Inline XBRL document and included    \n                 in Exhibit 101).                                                                           \n                                                                                                            \n                                                     4                                                      \n                                                                                                            \n                                                 SIGNATURE                                                  \nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this\nreport to be signed on its behalf by the undersigned hereunto duly authorized.\n                        \n  JPMorgan Chase & Co.  \n  (Registrant)          \n                        \n                                \n  By:    /s/ John H. Tribolati  \n         John H. Tribolati      \n         Corporate Secretary    \n                                \n                              \n  Dated:    January 23, 2025  \n ──────────────────────────── \n                              \n                                                     5                                                      \n"
}