{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2021-01-21",
  "period": "",
  "accession_number": "0000019617-21-000123",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0000019617-21-000123-index.html",
  "text": "                                                                                  \n                                  UNITED STATES                                   \n                                                                                  \n                                                                                  \n                        SECURITIES AND EXCHANGE COMMISSION                        \n                                                                                  \n                                                                                  \n                              Washington, D.C. 20549                              \n                                                                                  \n                                                                                  \n                                     FORM 8-K                                     \n                                                                                  \n                                                                                  \n                                  CURRENT REPORT                                  \n                                                                                  \n      Pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934      \n                                                                                  \n        Date of Report (date of earliest event reported): January 21, 2021        \n                                                                                  \n                               JPMorgan Chase & Co.                               \n                                                                                  \n              (Exact name of registrant as specified in its charter)              \n                                                                                  \n  Delaware                                  1-5805                    13-2624428  \n  (State or other                                                                 \n  jurisdiction of                           -Commission File    -I.R.S. employer  \n  incorporation                             Number                identification  \n  or                                                                         no.  \n  organization)                                                                   \n  383 Madison                                                                     \n  Avenue,                                                                         \n                   New York,    New York                                   10179  \n  (Address of                                                                     \n  principal                                                            -Zip Code  \n  executive                                                                       \n  offices)                                                                        \n                                                                                  \n       Registrant’s telephone number, including area code: ( 212) 270-6000        \nCheck the appropriate box below if the Form 8-K filing is intended to\nsimultaneously satisfy the filing obligation of the registrant under any of the\nfollowing provisions:\n                                                                                  \n  ☐    Written communications pursuant to Rule 425 under the Securities Act (17   \n       CFR 230.425)                                                               \n                                                                                  \n                                                                                  \n  ☐    Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17     \n       CFR 240.14a-12)                                                            \n                                                                                  \n                                                                                  \n  ☐    Pre-commencement communications pursuant to Rule 14d-2(b) under the        \n       Exchange Act (17 CFR 240.14d-2(b))                                         \n                                                                                  \n                                                                                  \n  ☐    Pre-commencement communications pursuant to Rule 13e-4(c) under the        \n       Exchange Act (17 CFR 240.13e-4(c))                                         \n                                                                                  \n           Securities registered pursuant to Section 12(b) of the Act:            \n                                                                                  \n  Title of each class           Trading Symbol(s)    Name of each exchange on     \n                                                     which registered             \n  Common stock                  JPM                  The New York Stock Exchange  \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR G             The New York Stock Exchange  \n  of 6.10% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series AA                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR H             The New York Stock Exchange  \n  of 6.15% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series BB                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR D             The New York Stock Exchange  \n  of 5.75% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series DD                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR C             The New York Stock Exchange  \n  of 6.00% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series EE                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR J             The New York Stock Exchange  \n  of 4.75% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series GG                                                                       \n  Alerian MLP Index ETNs due    AMJ                  NYSE Arca, Inc.              \n  May 24, 2024                                                                    \n  Guarantee of Callable                                                           \n  Step-Up Fixed Rate                                                              \n  Notes due April 26, 2028      JPM/28               The New York Stock Exchange  \n  of JPMorgan                                                                     \n  Chase Financial Company                                                         \n  LLC                                                                             \n                                                                                  \nIndicate by check mark whether the registrant is an emerging growth company as\ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or\nRule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).\n\nEmerging growth company ☐\n\nIf an emerging growth company, indicate by check mark if the registrant has\nelected not to use the extended transition period for complying with any new or\nrevised financial accounting standards provided pursuant to Section 13(a) of the\nExchange Act. ☐\n\nItem 5.02(e) Departure of Directors or Certain Officers; Election of Directors;\nAppointment of Certain Officers; Compensation Arrangements of Certain Officers.\n\nJPMorgan Chase & Co. (the “Firm”) announced that the independent members of the\nBoard of Directors (the “Board”) approved the total compensation for 2020 for Mr.\nJames Dimon, CEO, in the amount of $31,500,000, which is unchanged from last year.\nMr. Dimon’s total compensation includes an annual base salary of $1,500,000 and\nperformance-based variable incentive compensation of $30,000,000. $5,000,000 of\nthe variable incentive compensation will be delivered in cash and the remaining\n$25,000,000 will be delivered in the form of Performance Share Units (\"PSUs\"). The\namounts of base salary, cash incentive, and PSUs remain unchanged from last year.\nThe key features of the PSU program are also consistent with last year, including\nthe financial metric (return on tangible common equity 1 - \"ROTCE\") with absolute\nand relative performance goals, payout levels, vesting and hold requirements, as\nwell as clawback and recovery provisions 2 .\n\nIn determining Mr. Dimon's compensation, the independent members of the Board took\ninto account the Firm's strong performance in 2020 and over the long term, across\nfour broad dimensions: Business Results; Risk, Controls & Conduct;\nClient/Customer/Stakeholder; and Teamwork & Leadership.\n\nAmid the unprecedented health and economic consequences of COVID-19, under Mr.\nDimon's stewardship, the Firm continued to provide uninterrupted service to its\nclients and customers, while supporting and providing a safe work environment for\nits employees and helping those communities hit hard by the COVID-19 pandemic. In\n2020 the Firm reported record revenue of $122.9 billion 1 and net income of $29.1\nbillion, or $8.88 per share, with ROTCE of 14%, while adding $12.2 billion of\ncredit reserves during the year to absorb potential future losses and returning\n$16.3 billion of capital to shareholders. The Firm maintained its $0.90 per share\nquarterly dividend and suspended net share repurchases from March 15, 2020 through\nthe end of the year to retain capital and reinforce its fortress balance sheet.\n\nThe Firm ended the year with a common equity Tier 1 ratio of 13.1% (vs. 12.4% at\nthe beginning of the year), capital above $200 billion and $1.4 trillion of cash\nand marketable securities, providing it with meaningful capacity to support\nclients and further invest in its business and communities. During 2020 the Firm\nraised over $2 trillion 3 of credit and capital for its consumer and institutional\nclients around the world, which includes nonprofits and U.S. government entities,\nincluding states, municipalities, hospitals and universities. The Firm also\nimproved its digital capabilities, made acquisitions that will enhance its product\nofferings and deepen its engagement with its customers, opened branches in new\nmarkets and received approval to open branches in 10 additional states which would\nallow it to be the first bank to operate branches in all of the lower 48 U.S.\nstates. The Firm continued to invest in its communities – for example, through its\ninitial commitments to support those most impacted by the pandemic and its longer-\nterm commitment to advance racial equality and promote economic growth.\n\n1 Revenue reported is on a managed basis. Managed revenue and ROTCE are non-GAAP\nfinancial measures. For further discussion, see notes (a) and (b) on page 6 of\nExhibit 99.1 to the Firm’s Current Report on Form 8-K dated January 15, 2021,\nwhich has been filed with the U.S. Securities and Exchange Commission, containing\nthe Firm's earnings press release for the quarter ended December 31, 2020.\n\n2 Equity incentives are subject to the JPMorgan Chase Bonus Recoupment Policy\nwhich applies in the event of a material restatement of the Firm's financial\nresults. In addition, all equity awards granted in 2021 contain recapture\nprovisions that enable the Firm to cancel outstanding awards and/or recover the\nvalue of certain stock distributed under the award in specified circumstances. In\naddition to recapture provisions, portions of equity awards awarded to the CEO are\nalso subject to additional Protection-based Vesting provisions under which awards\nmay be cancelled as determined by the Compensation & Management Development\nCommittee of the Board of Directors and ratified by the Board of Directors.\n\n3 Credit provided to clients represents new and renewed credit, including loans\nand commitments.\n                                                                                  \n   Item 9.01 Financial Statements and Exhibits                                    \n                                                                                  \n(d) Exhibit\n                                                                                  \n  Exhibit No.    Description of Exhibit                                           \n                 Pursuant to Rule 406 of Regulation S-T, the cover page is        \n  101            formatted in Inline XBRL (Inline eXtensible Business Reporting   \n                 Language).                                                       \n  104            Cover Page Interactive Data File (embedded within the Inline     \n                 XBRL document and included in Exhibit 101).                      \n                                                                                  \n                                        2                                         \n                                                                                  \n                                    SIGNATURE                                     \nPursuant to the requirements of the Securities Exchange Act of 1934, the\nRegistrant has duly caused this report to be signed on its behalf by the\nundersigned hereunto duly authorized.\n                        \n  JPMorgan Chase & Co.  \n  (Registrant)          \n                        \n                              \n  By:    /s/ Molly Carpenter  \n         Molly Carpenter      \n         Corporate Secretary  \n                              \n                              \n  Dated:    January 21, 2021  \n ──────────────────────────── \n                              \n                                        3                                         \n"
}