{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2021-07-29",
  "period": "",
  "accession_number": "0001193125-21-229188",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0001193125-21-229188-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 8-K  \nCURRENT REPORT Pursuant to Section 13 or 15(d) of the Securities Exchange Act of  \n1934 Date of Report (date of earliest event reported): July 28, 2021 JPMorgan     \nChase & Co. (Exact name of registrant as specified in its charter)                \n                                                                                  \n  Delaware                   1-5805                                   13-2624428  \n  (State or other                                                                 \n  jurisdiction of            -Commission File Number            -I.R.S. employer  \n  incorporation or                                            identification no.  \n  organization)                                                                   \n  383 Madison Avenue, New                                                  10179  \n  York, New York                                                                  \n  (Address of principal                                                -Zip Code  \n  executive offices)                                                              \n                                                                                  \nRegistrant’s telephone number, including area code: (212) 270-6000 Check the      \nappropriate box below if the Form 8-Kfiling is intended to simultaneously satisfy \nthe filing obligation of the registrant under any of the following provisions:    \n                                                                                  \n  ☐  Written communications pursuant to Rule 425 under the Securities Act (17     \n     CFR 230.425)                                                                 \n                                                                                  \n                                                                                  \n  ☐  Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR   \n     240.14a-12)                                                                  \n                                                                                  \n                                                                                  \n  ☐  Pre-commencement communications pursuant to Rule 14d-2(b) under the          \n     Exchange Act (17 CFR 240.14d-2(b))                                           \n                                                                                  \n                                                                                  \n  ☐  Pre-commencement communications pursuant to Rule 13e-4(c) under the          \n     Exchange Act (17 CFR 240.13e-4(c))                                           \n                                                                                  \nSecurities registered pursuant to Section 12(b) of the Act:                       \n                                                                                  \n  Title of each class           Trading Symbol(s)    Name of each exchange on     \n                                                     which registered             \n  Common stock                  JPM                  The New York Stock Exchange  \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR D             The New York Stock Exchange  \n  of 5.75% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series DD                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR C             The New York Stock Exchange  \n  of 6.00% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series EE                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR J             The New York Stock Exchange  \n  of 4.75% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series GG                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR K             The New York Stock Exchange  \n  of 4.55% Non-Cumulative                                                         \n  Preferred Stock,                                                                \n  Series JJ                                                                       \n  Depositary Shares, each                                                         \n  representing a                                                                  \n  one-four hundredth                                                              \n  interest in a share           JPM PR L             The New York Stock Exchange  \n  of 4.625% Non-Cumulative                                                        \n  Preferred                                                                       \n  Stock, Series LL                                                                \n  Alerian MLP Index ETNs due    AMJ                  NYSE Arca, Inc.              \n  May 24, 2024                                                                    \n  Guarantee of Callable                                                           \n  Step-Up Fixed Rate Notes                                                        \n  due April 26, 2028 of         JPM/28               The New York Stock Exchange  \n  JPMorgan                                                                        \n  Chase Financial Company                                                         \n  LLC                                                                             \n  Guarantee of Callable                                                           \n  Fixed Rate Notes due June                                                       \n  10, 2032 of JPMorgan          JPM/32               The New York Stock Exchange  \n  Chase Financial Company                                                         \n  LLC                                                                             \n                                                                                  \nIndicate by check mark whether the registrant is an emerging growth company as    \ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or   \nRule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).   \nEmerging growth company ☐ If an emerging growth company, indicate by check mark if\nthe registrant has elected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided pursuant to       \nSection 13(a) of the Exchange Act. ☐                                              \n                                                                    \n  Item 3.03.  Material Modification to Rights of Security Holders.  \n                                                                    \nOn July 29, 2021, JPMorgan Chase & Co. (the “Company”) issued 200,000 shares (the \n“Shares”) of the Company’s 4.20% Non-Cumulative PreferredStock, Series MM, par    \nvalue of $1.00 per share and with a liquidation preference of $10,000 per share   \n(the “Series MM Preferred Stock”), which Shares were deposited against delivery of\ndepositary receipts (the “Depositary Receipts”) evidencing 80,000,000 depositary  \nshares (the “Depositary Shares”), each representing a 1/400th interest in a Share,\nissued by Computershare Inc., as depositary. Under the terms of the Series MM     \nPreferred Stock, the ability of the Company to pay dividends on, make             \ndistributions with respect to, or to redeem, purchase or acquire, or make a       \nliquidation payment on its common stock or any preferred stock ranking on a parity\nwith or junior to the Series MM Preferred Stock, will be subject to restrictions  \nin the event that the Company does not declare dividends on the Series MM         \nPreferred Stock for the most recently completed dividend period or, in the case of\nany such liquidation payment, does not pay to holders of the Series MM Preferred  \nStock liquidation distributions of $10,000 per Share, plus any declared and unpaid\ndividends. The terms of the Series MM Preferred Stock are more fully described in \nthe Certificate of Designations (as defined below), which establishes the rights, \npreferences, privileges, qualifications, restrictions and limitations relating to \nthe Series MM Preferred Stock. Copies of the Certificate of Designations and the  \nform of certificate representing the Series MM Preferred Stock are included as    \nExhibit 3.1 and Exhibit 4.1, respectively, to this Current Report on Form 8-K     \nandare incorporated by reference herein. The terms of the Depositary Shares are   \nset forth in the Deposit Agreement, dated July 29, 2021, among the Company,       \nComputershare Inc., as depositary, and the holders from time to time of the       \nDepositary Receipts issued thereunder (the “Deposit Agreement”) and the form of   \nDepositary Receipt. Copies of the Deposit Agreement and the form of Depositary    \nReceipt are included as Exhibit 4.2 and Exhibit 4.3, respectively, to this Current\nReport on Form 8-K andare incorporated by reference herein.                       \n                                                                                  \n  Item 5.03.  Amendments to Articles of Incorporation or Bylaws; Change in        \n              Fiscal Year.                                                        \n                                                                                  \nOn July 28, 2021, the Company filed a Certificate of Designations, Powers,        \nPreferences and Rights with the Secretary of State of the State of Delaware,      \nestablishing the rights, preferences, privileges, qualifications, restrictions and\nlimitations relating to the Series MM Preferred Stock (the “Certificate of        \nDesignations”). The Certificate of Designations became effective with the         \nSecretary of State of the State of Delaware upon filing. A copy of the Certificate\nof Designations is included as Exhibit 3.1 to this Current Report on Form 8-K     \nandis incorporated by reference herein.                                           \n                             \n  Item 8.01.  Other Events.  \n                             \nOn July 29, 2021, the Company completed the issuance and sale of 200,000 Shares,  \nwhich Shares were deposited against delivery of Depositary Receipts evidencing    \n80,000,000 Depositary Shares, pursuant to an Underwriting Agreement, dated July   \n22, 2021, among the Company, J.P. Morgan Securities LLC and the other several     \nunderwriters named therein. The sale of the Depositary Shares was made pursuant to\nthe Company’s Registration Statement on Form S-3 (File No. 333-230098),as amended.\nIn connection with this offering, the legal opinion as to the legality of the     \nDepositary Shares and the Series MM Preferred Stock is being filed as Exhibit 5.1 \nto this Current Report on Form 8-K.                                               \n                                                                                  \n  Item 9.01.Financial Statements and Exhibits.(d) Exhibits3.1Certificate of       \n  Designations, Powers, Preferences and Rights of JPMorgan Chase & Co.,           \n  establishing the rights, preferences, privileges, qualifications, restrictions  \n  and limitations relating to the 4.20%Non-CumulativePreferred Stock, Series MM,  \n  filed July 28, 2021.4.1Form of certificate representing the Series MM           \n  Preferred Stock.4.2Deposit Agreement, dated July 29, 2021, among JPMorgan       \n  Chase & Co., Computershare Inc., as depositary, and the holders from time to    \n  time of Depositary Receipts.4.3Form of Depositary Receipt (included as part of  \n  Exhibit 4.2).5.1Opinion of Simpson Thacher & Bartlett LLP as to the legality    \n  of the 4.20%Non-CumulativePreferred Stock, Series MM and the Depositary         \n  Shares.23.1Consent of Simpson Thacher & Bartlett LLP (included as part of       \n  Exhibit 5.1).101Pursuant to Rule 406 of RegulationS-T,the cover page is         \n  formatted in Inline XBRL (Inline eXtensible Business Reporting                  \n  Language).104Cover Page Interactive Data File (embedded within the Inline XBRL  \n  document and included in Exhibit 101).                                          \n                                                                                  \nSIGNATURE Pursuant to the requirements of the Securities Exchange Act of 1934, the\nRegistrant has duly caused this report to be signed on its behalf by the          \nundersigned hereunto duly authorized.                                             \n                                                     \n          JPMORGAN CHASE & CO.                       \n          -Registrant                                \n  By:                           /s/ Jordan A. Costa  \n  Name:                         Jordan A. Costa      \n  Title:                        Managing Director    \n                                                     \nDated: July 29, 2021                                                              \n"
}