{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "8-K",
  "filing_date": "2021-05-12",
  "period": "",
  "accession_number": "0001193125-21-159144",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0001193125-21-159144-index.html",
  "text": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 8-K  \nCURRENT REPORT Pursuant to Section 13 or 15(d) of the Securities Exchange Act of  \n1934 Date of Report (date of earliest event reported): May 11, 2021 JPMorgan Chase\n& Co. (Exact name of registrant as specified in its charter)                      \n                                                                                  \n  Delaware                   1-5805                                   13-2624428  \n  (State or other                                                                 \n  jurisdiction of            -Commission File Number            -I.R.S. employer  \n  incorporation or                                            identification no.  \n  organization)                                                                   \n  383 Madison Avenue, New                                                  10179  \n  York, New York                                                                  \n  (Address of principal                                                -Zip Code  \n  executive offices)                                                              \n                                                                                  \nRegistrant’s telephone number, including area code: (212) 270-6000 Check the      \nappropriate box below if the Form 8-Kfiling is intended to simultaneously satisfy \nthe filing obligation of the registrant under any of the following provisions:    \n                                                                                  \n  ☐  Written communications pursuant to Rule 425 under the Securities Act (17     \n     CFR 230.425)                                                                 \n                                                                                  \n                                                                                  \n  ☐  Soliciting material pursuant to Rule 14a-12 under the Exchange Act (17 CFR   \n     240.14a-12)                                                                  \n                                                                                  \n                                                                                  \n  ☐  Pre-commencement communications pursuant to Rule 14d-2(b) under the          \n     Exchange Act (17 CFR 240.14d-2(b))                                           \n                                                                                  \n                                                                                  \n  ☐  Pre-commencement communications pursuant to Rule 13e-4(c) under the          \n     Exchange Act (17 CFR 240.13e-4(c))                                           \n                                                                                  \nSecurities registered pursuant to Section 12(b) of the Act:                       \n                                                                                  \n  Title of each class           Trading Symbol(s)    Name of each exchange on     \n                                                     which registered             \n  Common stock                  JPM                  The New York Stock Exchange  \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR G             The New York Stock Exchange  \n  share of                                                                        \n  6.10% Non-Cumulative                                                            \n  Preferred Stock, Series AA                                                      \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR H             The New York Stock Exchange  \n  share of                                                                        \n  6.15% Non-Cumulative                                                            \n  Preferred Stock, Series BB                                                      \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR D             The New York Stock Exchange  \n  share of                                                                        \n  5.75% Non-Cumulative                                                            \n  Preferred Stock, Series DD                                                      \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR C             The New York Stock Exchange  \n  share of                                                                        \n  6.00% Non-Cumulative                                                            \n  Preferred Stock, Series EE                                                      \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR J             The New York Stock Exchange  \n  share of                                                                        \n  4.75% Non-Cumulative                                                            \n  Preferred Stock, Series GG                                                      \n  Depositary Shares, each                                                         \n  representing a one-four                                                         \n  hundredth interest in a       JPM PR K             The New York Stock Exchange  \n  share of                                                                        \n  4.55% Non-Cumulative                                                            \n  Preferred Stock, Series JJ                                                      \n  Alerian MLP Index ETNs due    AMJ                  NYSE Arca, Inc.              \n  May 24, 2024                                                                    \n  Guarantee of Callable                                                           \n  Step-Up Fixed Rate Notes                                                        \n  due April 26, 2028 of         JPM/28               The New York Stock Exchange  \n  JPMorgan                                                                        \n  Chase Financial Company                                                         \n  LLC                                                                             \n                                                                                  \nIndicate by check mark whether the registrant is an emerging growth company as    \ndefined in Rule 405 of the Securities Act of 1933 (§230.405 of this chapter) or   \nRule 12b-2 of the Securities Exchange Act of 1934 (§240.12b-2 of this chapter).   \nEmerging growth company ☐ If an emerging growth company, indicate by check mark if\nthe registrant has elected not to use the extended transition period for complying\nwith any new or revised financial accounting standards provided pursuant to       \nSection 13(a) of the Exchange Act. ☐                                              \n                                                                                  \nItem 3.03. Material Modification to Rights of Security Holders On May 12, 2021,   \nJPMorgan Chase & Co. (the “Company”) issued 200,000 shares (the “Shares”) of the  \nCompany’s 3.65% Fixed-Rate Reset Non-CumulativePreferred Stock, Series KK, par    \nvalue of $1.00 per share and with a liquidation preference of $10,000 per share   \n(the “Series KK Preferred Stock”), which Shares were deposited against delivery of\ndepositary receipts (the “Depositary Receipts”) evidencing 2,000,000 depositary   \nshares (the “Depositary Shares”), each representing a one-tenthinterest in a      \nShare, issued by Computershare Inc., as depositary. Under the terms of the Series \nKK Preferred Stock, the ability of the Company to pay dividends on, make          \ndistributions with respect to, or to redeem, purchase or acquire, or make a       \nliquidation payment on its common stock or any preferred stock ranking on a parity\nwith or junior to the Series KK Preferred Stock, will be subject to restrictions  \nin the event that the Company does not declare dividends on the Series KK         \nPreferred Stock for the most recently completed dividend period or, in the case of\nany such liquidation payment, does not pay to holders of the Series KK Preferred  \nStock liquidation distributions of $10,000 per Share, plus any declared and unpaid\ndividends. The terms of the Series KK Preferred Stock are more fully described in \nthe Certificate of Designations (as defined below), which establishes the rights, \npreferences, privileges, qualifications, restrictions and limitations relating to \nthe Series KK Preferred Stock. Copies of the Certificate of Designations and the  \nform of certificate representing the Series KK Preferred Stock are included as    \nExhibit 3.1 and Exhibit 4.1, respectively, to this Current Report on Form 8-Kand  \nare incorporated by reference herein. The terms of the Depositary Shares are set  \nforth in the Deposit Agreement, dated May 12, 2021, among the Company,            \nComputershare Inc., as depositary, and the holders from time to time of the       \nDepositary Receipts issued thereunder (the “Deposit Agreement”) and the form of   \nDepositary Receipt. Copies of the Deposit Agreement and the form of Depositary    \nReceipt are included as Exhibit 4.2 and Exhibit 4.3, respectively, to this Current\nReport on Form 8-Kand are incorporated by reference herein. Item 5.03. Amendments \nto Articles of Incorporation or Bylaws; Change in Fiscal Year. On May 11, 2021,   \nthe Company filed a Certificate of Designations, Powers, Preferences and Rights   \nwith the Secretary of State of the State of Delaware, establishing the rights,    \npreferences, privileges, qualifications, restrictions and limitations relating to \nthe Series KK Preferred Stock (the “Certificate of Designations”). The Certificate\nof Designations became effective with the Secretary of State of the State of      \nDelaware upon filing. A copy of the Certificate of Designations is included as    \nExhibit 3.1 to this Current Report on Form 8-Kand is incorporated by reference    \nherein. Item 8.01. Other Events. On May 12, 2021, the Company completed the       \nissuance and sale of 200,000 Shares, which Shares were deposited against delivery \nof Depositary Receipts evidencing 2,000,000 Depositary Shares, pursuant to an     \nUnderwriting Agreement, dated May 5, 2021, among the Company, J.P. Morgan         \nSecurities LLC and the other several underwriters named therein. The sale of the  \nDepositary Shares was made pursuant to the Company’s Registration Statement on    \nForm S-3(File No. 333-230098).In connection with this offering, the legal opinion \nas to the legality of the Depositary Shares and the Series KK Preferred Stock is  \nbeing filed as Exhibit 5.1 to this Current Report on Form 8-K. Item 9.01.         \nFinancial Statements and Exhibits (d) Exhibits                                    \n                                                                                  \n          Certificate of Designations, Powers, Preferences and Rights of          \n          JPMorgan Chase & Co., establishing the rights, preferences,             \n          privileges, qualifications, restrictions and limitations                \n          relating to the 3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock,  \n  3.1     Series KK, filed May 11, 2021.                                          \n ──────────────────────────────────────────────────────────────────────────────── \n  4.1     Form of certificate representing the Series KK Preferred Stock.         \n          Deposit Agreement, dated May 12, 2021, among JPMorgan Chase & Co.,      \n  4.2     Computershare Inc., as depositary, and the holders from time to time    \n          of Depositary Receipts.                                                 \n  4.3     Form of Depositary Receipt (included as part of Exhibit 4.2).           \n          Opinion of Simpson Thacher & Bartlett LLP as to the legality of the     \n  5.1     3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK and    \n          the Depositary Shares.                                                  \n  23.1    Consent of Simpson Thacher & Bartlett LLP (included as part of Exhibit  \n          5.1).                                                                   \n  101     Pursuant to Rule 406 of Regulation S-T, the cover page is formatted in  \n          Inline XBRL (Inline eXtensible Business Reporting Language).            \n  104     Cover Page Interactive Data File (embedded within the Inline XBRL       \n          document and included in Exhibit 101).                                  \n                                                                                  \nSIGNATURE Pursuant to the requirements of the Securities Exchange Act of 1934, the\nRegistrant has duly caused this report to be signed on its behalf by the          \nundersigned hereunto duly authorized.                                             \n                                                     \n          JPMORGAN CHASE & CO.                       \n          -Registrant                                \n  By:                           /s/ Jordan A. Costa  \n  Name:                         Jordan A. Costa      \n  Title:                        Managing Director    \n                                                     \nDated: May 12, 2021                                                               \n"
}