{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "S-3",
  "filing_date": "2025-03-04",
  "period": "",
  "accession_number": "0001193125-25-045590",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0001193125-25-045590-index.html",
  "text": "As filed with the Securities and Exchange Commission on March 4, 2025\n\nReg. No. 333-\n                                                                                                            \n   UNITED STATES                                                                                            \n                                                                                                            \n                                                                                                            \n   SECURITIES                                                                                               \n   AND EXCHANGE COMMISSION                                                                                  \n                                                                                                            \nWashington, D.C. 20549\n\nFORM S-3\n                                                                                                            \n   REGISTRATION STATEMENT                                                                                   \n                                                                                                            \nUNDER\n\nTHE SECURITIES ACT OF 1933\n\nJPMORGAN CHASE & CO.\n\n(Exact name of registrant, as specified in charter)\n                                                         \n  Delaware                           13-2624428          \n  (State or other jurisdiction of    -IRS Employer       \n  incorporation or organization)     Identification No.  \n                                                         \nJPMorgan Chase & Co.\n\n383 Madison Avenue\n\nNew York, New York 10179\n\n(212) 270-6000\n\n(Address, including zip code, and telephone number, including area code, of registrant\u0092s principal executive\noffices)\n\nJohn H. Tribolati\n\nCorporate Secretary\n\nJPMorgan Chase & Co.\n\n383 Madison Avenue\n\nNew York, New York 10179\n\n(212) 270-6000\n\n(Name, address, including zip code, and telephone number, including area code, of agent for service)\n\nCopies of All Communications to:\n                                                                                                            \n                                   Lee Meyerson, Esq.                   William V. Fogg, Esq.               \n  Stephen B. Grant, Esq.           Hui Lin, Esq. Simpson                Michael E. Mariani, Esq. C.         \n  JPMorgan Chase & Co.             Thacher & Bartlett LLP 425           Daniel Haaren, Esq. Cravath,        \n  277 Park Avenue New York,        Lexington Avenue                     Swaine & Moore LLP                  \n  New York 10172 (212) 270-6000    New York, New York 10017             375 Ninth Avenue New York,          \n                                   (212) 455-2000                       New York 10001 (212) 474-1000       \n                                                                                                            \nApproximate date of commencement of proposed sale to the public: From time to time after the\neffective date of this registration statement as determined by market conditions and other factors.\n\nIf the only securities being registered\non this Form are being offered pursuant to dividend or interest reinvestment plans, please check the\nfollowing box. ☐\n\nIf any of\nthe securities being registered on this Form are to be offered on a delayed or continuous basis pursuant to\nRule 415 under the Securities Act of 1933, other than securities offered only in connection with dividend or\ninterest reinvestment plans,\ncheck the following box. ☒\n\nIf this Form is filed to register additional securities for an offering pursuant to Rule 462(b)\nunder the Securities Act, please check the following box and list the Securities Act registration statement\nnumber of the earlier effective registration statement for the same offering. ☐\n\nIf this Form is a post-effective amendment filed pursuant to Rule 462(c) under the Securities Act, check the\nfollowing box and list the\nSecurities Act registration statement number of the earlier effective registration statement for the same\noffering. ☐\n\nIf this\nForm is a registration statement pursuant to General Instruction I.D. or a post-effective amendment thereto\nthat shall become effective upon filing with the Commission pursuant to Rule 462(e) under the Securities\nAct, check the following\nbox. ☐\n\nIf this Form is a post-effective amendment to a registration statement filed pursuant to General Instruction\nI.D. filed\nto register additional securities or additional classes of securities pursuant to Rule 413(b) under the\nSecurities Act, check the following box. ☐\n\nIndicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-\naccelerated filer, a smaller reporting\ncompany, or an emerging growth company. See the definitions of \u0093large accelerated filer,\u0094 \u0093accelerated\nfiler,\u0094 \u0093smaller reporting company\u0094 and \u0093emerging growth company\u0094 in Rule 12b-2 of the Exchange Act.\n                                                               \n  Large Accelerated filer    ☒    Accelerated filer ☐          \n  Non-accelerated filer      ☐    Smaller reporting company ☐  \n                                  Emerging growth company ☐    \n                                                               \nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended\ntransition period for complying with any new or revised financial accounting standards provided pursuant to\nSection 7(a)(2)(B) of the Securities Act. ☐\n\nThe Registrant hereby amends this registration statement on the date or dates as may be necessary to delay\nits effective date until the Registrant shall file a further amendment which specifically states that this\nregistration statement shall thereafter become effective in accordance with Section 8(a) of the Securities\nAct or until this registration statement shall become effective on the date that the Securities and Exchange\nCommission, acting pursuant to said Section 8(a), may determine.\n\nExplanatory Note\n\nThis Registration Statement contains:\n                                                                                                            \n      a prospectus to be used by JPMorgan Chase & Co. in connection with offerings of up to                 \n      $150,000,000,000, or                                                                                  \n      the equivalent thereof in any other currency, of its debt securities, preferred stock, depositary     \n      shares representing its preferred stock, common stock, warrants and units at unspecified aggregate    \n      initial public offering prices and by affiliates of                                                   \n      JPMorgan Chase & Co. in connection with market-making transactions from time to time in the           \n      securities described therein after they are initially offered and sold; and                           \n                                                                                                            \n                                                                                                            \n      a prospectus addendum to be used by affiliates of JPMorgan Chase & Co. in connection with             \n      market-making                                                                                         \n      transactions from time to time in securities of one or more of the same classes that were initially   \n      registered under registration statements previously filed by JPMorgan Chase & Co. or its affiliates   \n      and that were initially offered and sold                                                              \n      prior to the date of the abovementioned prospectus addendum.                                          \n                                                                                                            \nThe information in this prospectus is not complete and may be changed. We may not sell these securities\nuntil the registration statement filed with the Securities and Exchange Commission is effective. This\nprospectus is not an offer to sell these securities, and we are not soliciting offers to buy these\nsecurities, in any state where the offer or sale is not permitted.\n\nSUBJECT TO COMPLETION, DATED MARCH 4, 2025\n\nProspectus\n\n$150,000,000,000\n\nDebt Securities\n\nPreferred Stock\n\nDepositary Shares\n\nCommon Stock\n\nWarrants\n\nUnits\n\nJPMorgan Chase\n& Co., which we refer to as \u0093JPMorganChase,\u0094 \u0093we\u0094 or \u0093us,\u0094 may offer up to $150,000,000,000, or the\nequivalent thereof in any other currency, of these securities from time to time, in amounts, on terms and at\nprices\nthat will be determined at the time they are offered for sale. These terms and prices will be described in\nmore detail in one or more supplements to this prospectus, which will be distributed at the time the\nsecurities are offered. Our common stock\nis listed on the New York Stock Exchange under the symbol \u0093JPM.\u0094 The other securities that we may offer from\ntime to time under this prospectus may be listed on the New York Stock Exchange or another national\nsecurities exchange, as\nspecified in the applicable prospectus supplement.\n\nYou should read this prospectus and any supplement carefully before you invest. See the section entitled\n\u0093Risk Factors\u0094 in our most recent Annual Report on Form 10-K and any subsequent Quarterly Report on Form\n10-Q, andany risk factors described in anapplicable prospectus supplement,for a discussion of risks you\nshould consider in connection with an investment in any of the securities offered under this prospectus.\n\nThis prospectus may not be used to sell any of the securities unless it is accompanied by a prospectus\nsupplement.\n\nThe securities\nmay be sold to or through underwriters, through dealers or agents, directly to purchasers or through a\ncombination of these methods. If an offering of securities involves any underwriters, dealers or agents,\nthen the applicable prospectus supplement\nwill name the underwriters, dealers or agents and will provide information regarding any fee, commission or\ndiscount arrangements made with those underwriters, dealers or agents.\n\nThese securities are not deposits or other obligations of a bank and are not insured by the Federal Deposit\nInsurance Corporation or any other governmental agency.\n\nThese securities have not been approved by the Securities and Exchange Commission or any state securities\ncommission, nor have these organizations determined that this prospectus is accurate or complete. Any\nrepresentation to the contrary is a criminal offense.\n\nThis prospectus is dated , 2025\n\nTABLE OF CONTENTS\n                                                          \n  Summary                                              3  \n  Where You Can Find More Information About            7  \n  JPMorganChase                                           \n  Important Factors that may Affect Future Results     8  \n  Use of Proceeds                                     10  \n  Description of Debt Securities                      11  \n  Description of Preferred Stock                      21  \n                                                          \n                                                       \n  Description of Depositary Shares                 32  \n  Description of Common Stock                      33  \n  Description of Warrants                          34  \n  Description of Units                             35  \n  Book-Entry Issuance                              36  \n  Plan of Distribution                             40  \n  Independent Registered Public Accounting Firm    41  \n  Legal Opinions                                   41  \n                                                       \n2\n\nSUMMARY\n\nThis summary highlights selected information from this document and may not contain all of the information\nthat is important to you. To\nunderstand the terms of our securities, you should carefully read:\n                                                                                         \n      this prospectus, which explains the general terms of the securities we may offer;  \n                                                                                         \n                                                                                                            \n      the attached prospectus supplement, which gives the specific terms of the particular securities we    \n      are offering                                                                                          \n      and may change or update information in this prospectus; and                                          \n                                                                                                            \n                                                                                                           \n      the documents we have referred you to in \u0093Where You Can Find More Information About JPMorganChase\u0094 on  \n      page 7 for information about our company and our financial statements.                               \n                                                                                                           \nCertain capitalized terms used in this summary\nare defined elsewhere in this prospectus.\n\nJPMorgan Chase & Co.\n\nJPMorganChase is a leading financial services firm based in the United States, with operations worldwide.\nJPMorganChase is a leader in\ninvestment banking, financial services for consumers and small businesses, commercial banking, financial\ntransaction processing and asset management. Under the J.P. Morgan and Chase brands, JPMorganChase serves\nmillions of customers, predominantly\nin the United States, and many of the world\u0092s most prominent corporate, institutional and government clients\nglobally.\n\nJPMorganChase\nis a financial holding company and was incorporated under Delaware law on October 28, 1968. JPMorganChase\u0092s\nprincipal bank subsidiary is JPMorgan Chase Bank, N.A., a national banking association with U.S. branches in\n48 states and Washington,\nD.C. JPMorganChase\u0092s principal non-bank subsidiary is J.P. Morgan Securities LLC, a U.S. broker-dealer.\nJPMorganChase\u0092s principal operating subsidiaries outside the United States are J.P. Morgan Securities plc\nand J.P. Morgan SE, which are\nsubsidiaries of JPMorgan Chase Bank, N.A. and are based in the United Kingdom and Germany, respectively.\n\nTo find out how to obtain more\ninformation about us, see \u0093Where You Can Find More Information About JPMorganChase.\u0094\n\nOur principal executive offices are\nlocated at 383 Madison Avenue, New York, New York 10179 and our telephone number is (212) 270-6000.\n\nThe Securities We May Offer\n\nThis prospectus is part of a registration statement (the \u0093registration statement\u0094) that we filed with the\nSecurities and\nExchange Commission (\u0093SEC\u0094) utilizing a \u0093shelf\u0094 registration process. Under this shelf process, we may offer\nfrom time to time up to $150,000,000,000, or the equivalent thereof in any other currency, of any of the\nfollowing\nsecurities:\n             \n      debt;  \n             \n                        \n      preferred stock;  \n                        \n                          \n      depositary shares;  \n                          \n                     \n      common stock;  \n                     \n                     \n      warrants; and  \n                     \n              \n      units.  \n              \nThis prospectus provides you with a general description of the securities we may offer. Each time we offer\nsecurities, we will provide a\nprospectus supplement that will describe the specific amounts, prices and terms of the securities being\noffered. The prospectus supplement may also add to, update or change information contained in this\nprospectus. References to this prospectus or\nthe prospectus supplement also means the information contained in other documents we have filed with the SEC\nand have referred you to in this prospectus. If this prospectus is inconsistent with the prospectus\nsupplement, you should rely on the\nprospectus supplement. You should read this prospectus, the applicable prospectus supplement and the\nadditional information that we refer you to, as discussed under \u0093Where You Can Find More Information About\nJPMorganChase.\u0094\n\n3\n\nDebt Securities\n\nWe may use this prospectus and an applicable prospectus supplement to offer our unsecured general debt\nobligations, which may be senior or\nsubordinated. The senior debt securities will have the same rank as all of our other unsecured,\nunsubordinated debt. The subordinated debt securities will be entitled to payment only after payment on our\n\u0093Senior Indebtedness,\u0094 which\nincludes the senior debt securities. For the definition of Senior Indebtedness, see \u0093Description of Debt\nSecurities\u0097Subordinated Debt Securities\u0097Subordination\u0094 beginning on page 16 below.\n\nThe senior debt securities will be issued under the indenture, dated as of October 21, 2010, as amended by\nthe first\nsupplemental indenture, dated as of January 13, 2017, between us and Deutsche Bank Trust Company Americas,\nas trustee. We refer to that indenture, as so amended, as the \u0093senior indenture.\u0094 The subordinated debt\nsecurities will be issued\nunder the subordinated indenture, dated as of March 14, 2014, as amended by the first supplemental\nindenture, dated as of January 13, 2017, between us and U.S. Bank Trust National Association, as trustee. We\nrefer to that indenture, as so amended,\nas the \u0093subordinated indenture\u0094 and, together with the senior indenture, the \u0093indentures\u0094 and each an\n\u0093indenture.\u0094 We have summarized below certain general features of the debt securities from the indentures.\nWe\nencourage you to read the indentures, which are exhibits to the registration statement.\n\nGeneral Indenture Provisions that Apply to the Senior Debt Securities and the Subordinated Debt Securities\n                                                                                                           \n      Each indenture allows us to issue different types of debt securities, including indexed securities.  \n                                                                                                           \n                                                                                                            \n      Neither of the indentures limits the amount of debt securities that we may issue or provides you      \n      with any                                                                                              \n      protection should there be a highly leveraged transaction, recapitalization or restructuring          \n      involving JPMorganChase.                                                                              \n                                                                                                            \n                                                                                                            \n      The indentures allow us to consolidate or merge with another entity, or to convey, transfer or lease  \n      all or                                                                                                \n      substantially all of our assets to another entity. If one of these events occurs and we are not the   \n      successor in the transaction, the successor will be required to assume our responsibilities relating  \n      to the debt securities and the indentures.                                                            \n                                                                                                            \n                                                                                                            \n      The indentures provide that holders of a majority of the total principal amount of outstanding debt   \n      securities of                                                                                         \n      any series may vote to change certain of our obligations or certain of your rights concerning the     \n      debt securities of that series. However, to change the amount or timing of principal, interest or     \n      other payments under the debt securities of a series,                                                 \n      every holder in the series affected by the change must consent.                                       \n                                                                                                            \n                                                                                                            \n      If an event of default (as described below) occurs with respect to any series of debt securities,     \n      the trustee or                                                                                        \n      holders of 25% of the outstanding principal amount of that series may declare the principal amount    \n      of the series immediately payable. However, holders of a majority of the principal amount may         \n      rescind this action.                                                                                  \n                                                                                                            \nGeneral Indenture Provisions that Apply Only to Senior Debt Securities\n\nWe have agreed in the senior indenture that we and our subsidiaries will not sell, assign, transfer, grant a\nsecurity interest in or otherwise\ndispose of the voting stock of JPMorgan Chase Bank, N.A., which we refer to as the \u0093Bank\u0094, and that the Bank\nwill not issue its voting stock, unless the sale or issuance is for fair market value and we and our\nsubsidiaries would own at\nleast 80% of the voting stock of the Bank following the sale or issuance. This covenant would not prevent us\nfrom completing a merger, consolidation or sale of substantially all of our assets. In addition, this\ncovenant would not prevent the merger\nor consolidation of the Bank into another domestic bank if JPMorganChase and its subsidiaries would own at\nleast 80% of the voting stock of the successor entity after the merger or consolidation.\n\n4\n\nIf we satisfy certain conditions in the senior indenture, we may discharge that indenture at any\ntime by depositing with the trustee sufficient funds or government obligations to pay the senior debt\nsecurities when due.\n\nEvents of Default. The senior indenture provides that the following are events of default with respect to\nany series of senior debt securities:\n                                                                                                            \n      default in the payment of principal of (or premium, if any, on) any senior debt securities of that    \n      series and                                                                                            \n      continuance of that default for 30 days;                                                              \n                                                                                                            \n                                                                                                            \n      default in the payment of interest on any senior debt securities of that series and continuance of    \n      that default                                                                                          \n      for 30 days;                                                                                          \n                                                                                                            \n                                                                                          \n      specified events of bankruptcy, insolvency or reorganization of JPMorganChase; and  \n                                                                                          \n                                                                                                   \n      any other event of default specified with respect to senior debt securities of that series.  \n                                                                                                   \nGeneral Indenture Provisions that Apply Only to Subordinated Debt Securities\n\nThe subordinated debt securities will be subordinated to all \u0093Senior Indebtedness,\u0094 which includes all of\nour indebtedness for money\nborrowed, except indebtedness that is stated not to be senior to, or that is stated to have the same rank\nas, the subordinated debt securities or other securities having the same rank as or that are subordinated to\nthe subordinated debt securities.\n\nEvents of Default. The subordinated indenture provides that the following are events of default with respect\nto any series of\nsubordinated debt securities:\n                                                                                          \n      specified events of bankruptcy, reorganization or insolvency of JPMorganChase; and  \n                                                                                          \n                                                                                              \n      any other event specified with respect to subordinated debt securities of that series.  \n                                                                                              \nPreferred Stock and Depositary Shares\n\nWe\nmay use this prospectus and an applicable prospectus supplement to offer our preferred stock, par value $1\nper share, in one or more series. We will determine the dividend, voting, conversion and other rights of the\nseries being offered, and the\nterms and conditions relating to the offering and sale of the series, at the time of the offer and sale. We\nmay also issue preferred stock that will be represented by depositary shares.\n\nCommon Stock\n\nWe may use this prospectus\nand an applicable prospectus supplement to offer our common stock, par value $1 per share. Subject to the\nrights of holders of our preferred stock, holders of our common stock are entitled to receive dividends when\ndeclared by our board of directors\n(which may also refer to a board committee). Each holder of common stock is entitled to one vote per share.\nThe holders of common stock have no preemptive rights or cumulative voting rights.\n\nWarrants\n\nWe may use this prospectus and\nan applicable prospectus supplement to offer warrants for the purchase of debt securities, preferred stock\nor common stock, which we refer to as \u0093warrants.\u0094 We may issue warrants independently or together with other\nsecurities.\n\nUnits\n\nWe may use this prospectus and an\napplicable prospectus supplement to offer any combination of debt securities, preferred stock, depositary\nshares, common stock and warrants issued by us, debt obligations or other\n\n5\n\nsecurities of an entity affiliated or not affiliated with us or other property together as units. In the\napplicable prospectus supplement, we will describe the particular combination of debt\nsecurities, preferred stock, depositary shares, common stock and warrants issued by us, or debt obligations\nor other securities of an entity affiliated or not affiliated with us or other property constituting any\nunits, and any other specific terms\nof the units.\n\nJPMorganChase is a Holding Company\n\nWe are a holding company that holds the stock of the Bank and an intermediate holding company, JPMorgan\nChase Holdings LLC, which we refer to\nas the \u0093IHC\u0094. We conduct substantially all of our operations through subsidiaries, including the Bank and\nthe IHC. As a result, claims of the holders of our securities will generally have a junior position to\nclaims of creditors of our\nsubsidiaries. Claims of our subsidiaries\u0092 creditors other than JPMorganChase include substantial amounts of\ndeposit liabilities, long-term debt and other liabilities. In addition, we are obligated to contribute to\nthe IHC substantially all the\nnet proceeds that we receive from the issuance of securities (including any securities offered by use of\nthis prospectus), and the ability of the Bank and the IHC to make payments to us is limited. As a result of\nthese arrangements, our ability to\nmake various payments is dependent on our receiving dividends from the Bank and dividends and extensions of\ncredit from the IHC. These limitations could affect our ability to pay interest on our debt securities, pay\ndividends on our preferred stock\nand common stock, redeem or repurchase outstanding securities, and fulfill our other payment obligations.\n\nConflicts of Interest\n\nWe own directly or indirectly all the outstanding equity securities of J.P. Morgan Securities LLC. The\nunderwriting arrangements for\nany offering pursuant to this prospectus will comply with the requirements of Rule 5121 of the regulations\nof the Financial Industry Regulatory Authority, Inc. (\u0093FINRA\u0094) regarding a FINRA member firm\u0092s underwriting\nof securities of an\naffiliate. In accordance with Rule 5121, J.P. Morgan Securities LLC may not make sales pursuant to this\nprospectus to any discretionary account without the prior approval of the customer.\n\n6\n\nWHERE YOU CAN FIND MORE INFORMATION\n\nABOUT JPMORGANCHASE\n\nWe\nfile annual, quarterly and current reports, proxy statements and other information with the SEC. Our SEC\nfilings are available to the public on the website maintained by the SEC at http://www.sec.gov. Such\ndocuments, reports and information are also\navailable on our website: https://jpmorganchaseco.gcs-web.com/ir/sec-other-filings/overview. Websites that\nare cited or referred to in this prospectus do not constitute part of this prospectus or any accompanying\nprospectus supplement.\n\nThe SEC allows us to \u0093incorporate by reference\u0094 into this prospectus the information in documents we file\nwith it, which means that\nwe can disclose important information to you by referring you to those documents. The information\nincorporated by reference is considered to be a part of this prospectus, and later information that we file\nwith the SEC will automatically update and\nsupersede this information.\n\nWe incorporate by reference (i) the documents listed below and (ii) any future filings we make with the SEC\nunder Section 13(a), 13(c), 14, or 15(d) of the Securities Exchange Act of 1934 during the period after the\ndate of filing the initial registration statement of which this prospectus forms a part and prior to the\neffectiveness of such\nregistration statement and after the date of this prospectus until the termination of each offering under\nthis prospectus is completed, other than, in each case, those documents or the portions of those documents\nwhich are furnished and not filed:\n\n(a) Our Annual Report on Form 10-K for the year ended December 31, 2024;\n\n(b) Our Current Reports on Form 8-K filed on January 14, 2025, January 15, 2025, January 23, 2025, January\n24, 2025, January 27, 2025 and February 4, 2025;\n\n(c) The descriptions of our common stock contained in our Registration Statement filed under Section 12 of\nthe Securities\nExchange Act of 1934 and any amendment or report filed for the purpose of updating that description, and any\nother Registration Statement on Form 8-A relating to any securities offered by this prospectus.\n\nYou may request a copy of these filings, at no cost, by writing to or telephoning us at the following\naddress:\n\nOffice of the Secretary\n\nJPMorgan\nChase & Co.\n\n383 Madison Avenue\n\nNew York, New York 10179\n\n212-270-6000\n\nYou should rely only on the information provided or incorporated by reference in this prospectus, any\napplicable prospectus supplement or in any related free writing prospectus that we prepare or authorize. We\nhave not authorized anyone to provide you with any other information. We are not making an offer of\nsecurities in any state where the offer is not permitted. You should not assume that the information in this\nprospectus or any prospectus supplement or any document incorporated by reference is accurate as of any date\nother than the date on the front of the applicable document.\n\n7\n\nIMPORTANT FACTORS THAT MAY AFFECT FUTURE RESULTS\n\nFrom time to time, we have made and will make forward-looking statements. These statements can be identified\nby the fact that they do not\nrelate strictly to historical or current facts. Forward-looking statements often use words such as\n\u0093anticipate,\u0094 \u0093target,\u0094 \u0093expect,\u0094 \u0093estimate,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093goal,\u0094\n\u0093believe,\u0094 or other words of similar meaning. Forward-looking statements provide our current expectations or\nforecasts of future events, circumstances, results or aspirations. Our disclosures in this prospectus, any\nprospectus supplement\nand any documents incorporated by reference into this prospectus may contain forward-looking statements\nwithin the meaning of the Private Securities Litigation Reform Act of 1995. We also may make forward-looking\nstatements in our other documents\nfiled or furnished with the SEC. In addition, our senior management may make forward-looking statements\norally to investors, analysts, representatives of the media and others.\n\nAll forward-looking statements are, by their nature, subject to risks and uncertainties, many of which are\nbeyond our control.\nJPMorganChase\u0092s actual future results may differ materially from those set forth in our forward-looking\nstatements. While there is no assurance that any list of risks and uncertainties or risk factors is\ncomplete, below are certain factors\nwhich could cause actual results to differ from those in the forward-looking statements:\n                                                                                                            \n      local, regional and global business, economic and political conditions and geopolitical events,       \n      including                                                                                             \n      geopolitical tensions and hostilities;                                                                \n                                                                                                            \n                                                                                                            \n      changes in laws, rules and regulatory requirements, including capital and liquidity requirements      \n      affecting our                                                                                         \n      businesses, and our ability to address those requirements;                                            \n                                                                                                            \n                                                                                                            \n      heightened regulatory and governmental oversight and scrutiny of our business practices, including    \n      dealings with                                                                                         \n      retail customers;                                                                                     \n                                                                                                            \n                                                                \n      changes in trade, monetary and fiscal policies and laws;  \n                                                                \n                                          \n      changes in the level of inflation;  \n                                          \n                                                           \n      changes in income tax laws, rules, and regulations;  \n                                                           \n                                    \n      changes in FDIC assessments;  \n                                    \n                                                                                                      \n      securities and capital markets behavior, including changes in market liquidity and volatility;  \n                                                                                                      \n                                                                               \n      changes in investor sentiment or consumer spending or savings behavior;  \n                                                                               \n                                                                    \n      our ability to manage effectively our capital and liquidity;  \n                                                                    \n                                                                     \n      changes in credit ratings assigned to us or our subsidiaries;  \n                                                                     \n                                 \n      damage to our reputation;  \n                                 \n                                                                                                            \n      our ability to appropriately address social, environmental and sustainability concerns that may       \n      arise, including                                                                                      \n      from our business activities;                                                                         \n                                                                                                            \n                                                                                                            \n      our ability to deal effectively with an economic slowdown or other economic or market disruption,     \n      including, but                                                                                        \n      not limited to, in the interest rate environment;                                                     \n                                                                                                            \n                                                                               \n      technology changes instituted by us, our counterparties or competitors;  \n                                                                               \n                                                \n      the effectiveness of our control agenda;  \n                                                \n                                                                                                            \n      our ability to develop or discontinue products and services, and the extent to which products or      \n      services                                                                                              \n      previously sold by us require us to incur liabilities or absorb losses not contemplated at their      \n      initiation or origination;                                                                            \n                                                                                                            \n                                                                                                            \n      acceptance of our new and existing products and services by the marketplace and our ability to        \n      innovate and to                                                                                       \n      increase market share;                                                                                \n                                                                                                            \n                                                              \n      our ability to attract and retain qualified employees;  \n                                                              \n                                        \n      our ability to control expenses;  \n                                        \n8\n                              \n      competitive pressures;  \n                              \n                                                                                   \n      changes in the credit quality of our clients, customers and counterparties;  \n                                                                                   \n                                                                                                            \n      adequacy of our risk management framework, disclosure controls and procedures and internal control    \n      over financial                                                                                        \n      reporting;                                                                                            \n                                                                                                            \n                                                   \n      adverse judicial or regulatory proceedings;  \n                                                   \n                                                                                   \n      our ability to determine accurate values of certain assets and liabilities;  \n                                                                                   \n                                                                                                            \n      occurrence of natural or man-made disasters or calamities, including health emergencies, the spread   \n      of infectious                                                                                         \n      diseases, epidemics or pandemics, an outbreak or escalation of hostilities or other geopolitical      \n      instabilities, the effects of climate change or extraordinary events beyond our control, and our      \n      ability to deal effectively with disruptions caused by                                                \n      the foregoing;                                                                                        \n                                                                                                            \n                                                                                                            \n      our ability to maintain the security of our financial, accounting, technology, data processing and    \n      other                                                                                                 \n      operational systems and facilities;                                                                   \n                                                                                                            \n                                                                                                            \n      our ability to withstand disruptions that may be caused by any failure of our operational systems or  \n      those of                                                                                              \n      third parties; and                                                                                    \n                                                                                                            \n                                                                                                            \n      our ability to effectively defend ourselves against cyber attacks and other attempts by unauthorized  \n      parties to                                                                                            \n      access our or our customers\u0092 information or to disrupt our systems.                                    \n                                                                                                            \nAdditional factors that may cause future\nresults to differ materially from forward-looking statements can be found in portions of our periodic and\ncurrent reports filed with the SEC and incorporated by reference in this prospectus. These factors include,\nfor example, those discussed under\nthe caption \u0093Risk Factors\u0094 in our most recent annual and quarterly reports, to which reference is hereby\nmade.\n\nAny\nforward-looking statements made by or on behalf of us in this prospectus, any applicable prospectus\nsupplement or in a document incorporated by reference into this prospectus speak only as of the date of this\nprospectus, the prospectus supplement or\nthe document incorporated by reference, as the case may be. We do not undertake to update any forward-\nlooking statements. You should, however, consult any further disclosures of a forward-looking nature we may\nmake in any subsequent Annual Reports\non Form 10-K, Quarterly Reports on Form 10-Q or Current Reports on Form 8-K.\n\n9\n\nUSE OF PROCEEDS\n\nUnless otherwise described in the applicable prospectus supplement, we will contribute the net proceeds that\nwe receive from the sale of the\nsecurities offered by use of this prospectus and the applicable prospectus supplement to the IHC, which will\nuse those net proceeds for general corporate purposes. General corporate purposes may include investments in\nour subsidiaries, payments of\ndividends to us, extensions of credit to us or our subsidiaries or the financing of possible acquisitions or\nbusiness expansion. Net proceeds may be temporarily invested pending application for their stated purpose.\nInterest on our debt securities\n(including interest on the debt securities offered by use of this prospectus) and dividends on our equity\nsecurities (including dividends on the preferred stock or common stock offered by use of this prospectus),\nas well as redemptions or\nrepurchases of our outstanding securities, will be made using amounts we receive as dividends or extensions\nof credit from the IHC or as dividends from the Bank.\n\n10\n\nDESCRIPTION OF DEBT SECURITIES\n\nGeneral\n\nWe have described below some\ngeneral terms that may apply to the debt securities we may offer by use of this prospectus and an applicable\nprospectus supplement. We will describe the particular terms of any debt securities we offer to you in the\nprospectus supplement relating to\nthose debt securities.\n\nThe debt securities will be either senior debt securities or subordinated debt securities. The senior debt\nsecurities will be issued under the senior indenture, and the subordinated debt securities will be issued\nunder the subordinated indenture. The debt securities and the indentures are governed by the laws of the\nState of New York.\n\nThe following summary is not complete. You should refer to the indentures, copies of which are exhibits to\nthe registration statement.\n\nThe indentures do not limit the amount of debt securities that we may issue. Each of the indentures provides\nthat we may issue debt securities\nup to the principal amount we authorize from time to time. The senior debt securities will be unsecured and\nwill have the same rank as all of our other unsecured and unsubordinated debt. The subordinated debt\nsecurities will be unsecured and will be\nsubordinated and junior to all Senior Indebtedness as defined below under \u0093\u0097 Subordinated Debt Securities \u0097\nSubordination.\u0094\n\nWe are a holding company that holds the stock of the Bank and the IHC. We conduct substantially all of our\noperations through subsidiaries,\nincluding the Bank and the IHC. As a result, claims of the holders of our securities will generally have a\njunior position to claims of creditors of our subsidiaries. Claims of our subsidiaries\u0092 creditors other than\nJPMorganChase include\nsubstantial amounts of deposit liabilities, long-term debt and other liabilities. In addition, we are\nobligated to contribute to the IHC substantially all the net proceeds that we receive from the issuance of\nsecurities (including any securities\noffered by use of this prospectus), and the ability of the Bank and the IHC to make payments to us is\nlimited. As a result of these arrangements, our ability to make various payments is dependent on our\nreceiving dividends from the Bank and\ndividends and extensions of credit from the IHC. These limitations could affect our ability to pay interest\non our debt securities, pay dividends on our preferred stock and common stock, redeem or repurchase\noutstanding securities, and fulfill our\nother payment obligations.\n\nWe may issue the debt securities in one or more separate series of senior debt securities and/or\nsubordinated\ndebt securities. We will specify in the prospectus supplement relating to the particular series of debt\nsecurities being offered the particular amounts, prices and terms of those debt securities. These terms may\ninclude:\n                                                  \n      the title and type of the debt securities;  \n                                                  \n                                                                                                            \n      any limit on the aggregate principal amount or aggregate initial offering price of the debt           \n      securities;                                                                                           \n                                                                                                            \n                                                  \n      the purchase price of the debt securities;  \n                                                  \n                                                                                                            \n      the dates on which the principal of the debt securities will be payable and the amount payable upon   \n      acceleration;                                                                                         \n                                                                                                            \n                                                                                                            \n      the interest rates of the debt securities, including the interest rates, if any, applicable to        \n      overdue payments,                                                                                     \n      or the method for determining those rates;                                                            \n                                                                                                            \n                                                           \n      the interest payment dates for the debt securities;  \n                                                           \n                                                                     \n      the places where payments may be made on the debt securities;  \n                                                                     \n                                                                                          \n      any mandatory or optional redemption provisions applicable to the debt securities;  \n                                                                                          \n                                                                                 \n      any sinking fund or similar provisions applicable to the debt securities;  \n                                                                                 \n                                                                                                            \n      the authorized denominations of the debt securities, if other than $1,000 and integral multiples of   \n      $1,000;                                                                                               \n                                                                                                            \n11\n                                                                                                            \n      if denominated in a currency other than U.S. dollars, the currency or currencies, including           \n      composite currencies,                                                                                 \n      in which payments on the debt securities will be payable (which currencies may be different for       \n      principal, premium and interest payments);                                                            \n                                                                                                            \n                                                                                \n      any conversion or exchange provisions applicable to the debt securities;  \n                                                                                \n                                                                                                            \n      any addition to, deletion from or change in the events of default applicable to the debt securities;  \n                                                                                                            \n                                                                                                        \n      any addition to, deletion from or change in the covenants applicable to the debt securities; and  \n                                                                                                        \n                                                        \n      any other specific terms of the debt securities.  \n                                                        \nWe may issue some of the debt securities as original issue discount debt securities. Original issue discount\ndebt securities will bear no\ninterest or will bear interest at a below-market rate and will be sold at a discount below their stated\nprincipal amount. The prospectus supplement will contain any special tax, accounting or other information\nrelating to original issue discount\ndebt securities. If we offer other kinds of debt securities, including debt securities linked to an index or\npayable in currencies other than U.S. dollars, the prospectus supplement relating to those debt securities\nwill also contain any special\ntax, accounting or other information relating to those debt securities.\n\nWe will issue the debt securities only in registered form without\ncoupons. The indentures permit us to issue debt securities of a series in certificated form or in permanent\nglobal form. You will not be required to pay a service charge for any transfer or exchange of debt\nsecurities, but we may require payment of\nany taxes or other governmental charges.\n\nWe will pay principal of, and premium, if any, and interest, if any, on the debt securities at\nthe corporate trust office in New York City of our paying agent, The Bank of New York Mellon, or any\nsuccessor paying agent that we may designate. You may also make transfers or exchanges of debt securities at\nthat location. We also have the right\nto pay interest on any debt securities by check mailed to the registered holders of the debt securities at\ntheir registered addresses. In connection with any payment on a debt security, we may require the holder to\ncertify information to us. In the\nabsence of that certification, we may rely on any legal presumption to enable us to determine our\nresponsibilities, if any, to deduct or withhold taxes, assessments or governmental charges from the payment.\n\nThe indentures do not limit our ability to enter into a highly leveraged transaction or provide you with any\nspecial protection in the event\nof such a transaction. In addition, neither of the indentures provides special protection in the event of a\nsudden or dramatic decline in our credit quality resulting from a takeover, recapitalization or similar\nrestructuring of JPMorganChase.\n\nWe may issue debt securities upon the exercise of warrants or upon exchange or conversion of exchangeable or\nconvertible debt securities. The\nprospectus supplement will describe the specific terms of any of those warrants or exchangeable or\nconvertible securities. It will also describe the specific terms of the debt securities or other securities\nissuable upon the exercise, exchange or\nconversion of those securities. See \u0093Description of Warrants\u0094 below.\n\nEach of the indentures contains a provision that, if made\napplicable to any series of senior or subordinated debt securities, respectively, permits us to elect:\n                                                                                                            \n      defeasance, which would discharge us from all of our obligations (subject to limited exceptions)      \n      with respect to                                                                                       \n      any debt securities of that series then outstanding, and/or                                           \n                                                                                                            \n                                                                                                            \n      covenant defeasance, which would release us from our obligations under specified covenants,           \n      including, with                                                                                       \n      respect to any series of senior securities, the covenant described under \u0093Senior Debt                  \n      Securities\u0097Limitation on Disposition of Stock of the Bank\u0094.                                             \n                                                                                                            \n12\n\nTo make either of the above elections, we must deposit in trust with the respective trustee money\nand/or U.S. government obligations (as defined below) which, through the payment of principal and interest\nin accordance with their terms, will provide sufficient money, without reinvestment, to repay in full those\nsenior or subordinated debt\nsecurities, as the case may be. As used in the indentures, \u0093U.S. government obligations\u0094 are: (1) direct\nobligations of the United States or of an agency or instrumentality of the United States, in either case\nthat are, or are guaranteed\nas, full faith and credit obligations of the United States and that are not redeemable by the issuer; and\n(2) certain depositary receipts with respect to an obligation referred to in clause (1).\n\nAs a condition to defeasance or covenant defeasance, we must deliver to the trustee an opinion of counsel\nthat the holders of the senior or\nsubordinated debt securities, as the case may be, will not recognize income, gain, or loss for federal\nincome tax purposes as a result of the defeasance or covenant defeasance and will be subject to federal\nincome tax on the same amounts, in the\nsame manner and at the same times as would have been the case if defeasance or covenant defeasance had not\noccurred. That opinion, in the case of defeasance but not covenant defeasance, must refer to and be based\nupon a ruling received by us from,\nor published by, the Internal Revenue Service or be based upon a change in applicable federal income tax\nlaw.\n\nIf we exercise our covenant\ndefeasance option with respect to a particular series of debt securities, then even if there were a default\nunder the defeased covenant, payment of those debt securities could not be accelerated. We may exercise our\ndefeasance option with respect to\na particular series of debt securities even if we previously had exercised our covenant defeasance option.\nIf we exercise our defeasance option, payment of those debt securities may not be accelerated because of any\nevent of default. If we exercise\nour covenant defeasance option and an acceleration were to occur, the realizable value at the acceleration\ndate of the money and U.S. government obligations in the defeasance trust could be less than the principal\nand interest then due on those debt\nsecurities. This is because the required deposit of money and/or U.S. government obligations in the\ndefeasance trust is based upon scheduled cash flows rather than market value, which will vary depending upon\ninterest rates and other factors.\n\nWe and the trustee under each indenture may modify that indenture with the consent of the holders of not\nless than a majority in principal\namount of outstanding debt securities of any series issued under that indenture affected by the\nmodification. However, without the consent of each affected holder, no such modification may:\n                                                        \n      change the stated maturity of any debt security;  \n                                                        \n                                                                                  \n      reduce the principal amount of, or premium, if any, on, any debt security;  \n                                                                                  \n                                                                                      \n      change the rate or method of computation of the interest on any debt security;  \n                                                                                      \n                                                                                                            \n      reduce the amount of the principal of an original issue discount debt security that would be due and  \n      payable upon                                                                                          \n      a declaration of acceleration of the maturity thereof;                                                \n                                                                                                            \n                                                                                                            \n      reduce the amount of, or postpone the date fixed for, the payment of any sinking fund or analogous    \n      obligation;                                                                                           \n                                                                                                            \n                                                                                \n      change the currency or currencies in which any debt security is payable;  \n                                                                                \n                                                                                                            \n      impair the right to institute suit for the enforcement of any payment on a debt security on or after  \n      the stated                                                                                            \n      maturity thereof (or, in the case of redemption, on or after the redemption date);                    \n                                                                                                            \n                                                                                                            \n      reduce the percentage of holders of outstanding debt securities of any series required to consent to  \n      any                                                                                                   \n      modification, amendment or any waiver under the applicable indenture; or                              \n                                                                                                            \n                                                                                                       \n      change the provisions in the applicable indenture that relate to its modification or amendment.  \n                                                                                                       \nIn addition, we and the trustee under each indenture may modify that indenture without the consent of the\nholders of\ndebt securities of any series for any of the following purposes:\n                                                            \n      to evidence the succession of another company to us;  \n                                                            \n13\n                                                                                     \n      to add to our covenants or to surrender any right or power conferred upon us;  \n                                                                                     \n                                                \n      to add any additional events of default;  \n                                                \n                                                                                                            \n      to permit or facilitate the issuance of debt securities in bearer form, certificated form or global   \n      form;                                                                                                 \n                                                                                                            \n                                                                                                            \n      to add to, change or eliminate any of the provisions of the applicable indenture in respect of all    \n      or any series                                                                                         \n      of debt securities, provided that any such addition, change or elimination will neither (i) apply to  \n      any debt security issued prior to the execution of such amendment and entitled to the benefit of      \n      such provision nor (ii) modify the rights of the                                                      \n      holders of any such debt securities with respect to such provision;                                   \n                                                                                                            \n                                                                                                            \n      to conform the text of the applicable indenture or any debt securities to any provision of the        \n      \u0093Description                                                                                           \n      of Debt Securities\u0094 in this prospectus or a similarly captioned section in any applicable prospectus   \n      supplement relating to the offering of debt securities;                                               \n                                                                                                            \n                                                                                \n      to provide security for or a guarantee of any series of debt securities;  \n                                                                                \n                                                                        \n      to establish the form or terms of any series of debt securities;  \n                                                                        \n                                                                                          \n      to provide for a successor trustee or the appointment of more than one trustee; or  \n                                                                                          \n                                                                                                            \n      to cure any ambiguity, to correct or supplement any provision of the applicable indenture which may   \n      be                                                                                                    \n      inconsistent with any other provision thereof, or to make any other provisions as we may deem         \n      necessary or desirable, provided such amendment does not adversely affect the interests of the        \n      holders of any series of debt securities in any material                                              \n      respect.                                                                                              \n                                                                                                            \nEach indenture allows us, without the consent of the holders of the debt securities of any series issued\nunder\nthat indenture, to consolidate or merge with any other entity, to convey, transfer or lease all or\nsubstantially all of our assets to another entity, or to permit another entity to merge into JPMorganChase,\nprovided that:\n\n(1) the successor is a corporation, association, company or business trust organized under U.S. laws;\n\n(2) the successor, if not us, assumes our obligations on the debt securities and under the indentures;\n\n(3) after giving effect to the transaction, no event of default (or, in the case of the senior debt\nsecurities, a covenant breach under the\nsenior indenture), and no event which, after notice or lapse of time or both, would become an event of\ndefault (or, in the case of the senior debt securities, a covenant breach under the senior indenture), shall\nhave occurred and be continuing; and\n\n(4) other specified conditions are met.\n\nIn addition, each indenture allows us, without the consent of the holders of the debt securities of any\nseries issued under that indenture, to\nconvey, transfer or lease all or substantially all of our assets to one or more of our subsidiaries.\n\nSenior Debt Securities\n\nThe senior debt securities will be direct, unsecured general obligations of JPMorganChase and will\nconstitute Senior Indebtedness of\nJPMorganChase. For a definition of \u0093Senior Indebtedness,\u0094 see \u0093\u0097 Subordinated Debt Securities \u0097\nSubordination\u0094 below.\n\nLimitation on Disposition of Stock of the Bank. Unless otherwise specified in the prospectus supplement\nrelating to a particular series\nof debt securities, the senior indenture contains a covenant by us that, so long as any of the senior debt\nsecurities are outstanding, neither we nor any Intermediate Subsidiary (as defined below) will sell, assign,\ngrant a security interest in or\notherwise dispose of any shares of voting stock of the Bank, or any securities convertible into, or options,\nwarrants or rights to purchase shares of voting stock of the Bank, except to JPMorganChase or an\nIntermediate Subsidiary. In addition, the\ncovenant provides that neither we nor any\n\n14\n\nIntermediate Subsidiary will permit the Bank to issue any shares of its voting stock, or securities\nconvertible into, or options, warrants or rights to purchase shares of its voting stock, nor\nwill we permit any Intermediate Subsidiary that owns any shares of voting stock of the Bank, or securities\nconvertible into, or options, warrants or rights to purchase shares of the Bank\u0092s voting stock, to cease to\nbe an Intermediate\nSubsidiary.\n\nThe above covenant is subject to our rights in connection with a consolidation or merger of JPMorganChase\nwith another entity\nor a conveyance, transfer or lease of all or substantially all of our assets to another entity. The covenant\nalso will not apply if both:\n\n(1) the disposition in question is made for fair market value, as determined by the board of directors of\nJPMorganChase or the\nIntermediate Subsidiary; and\n\n(2) after giving effect to the disposition, we and any one or more of our Intermediate\nSubsidiaries will collectively own at least 80% of the issued and outstanding voting stock of the Bank or\nany successor to the Bank, free and clear of any security interest.\n\nThe above covenant also does not restrict the Bank from being consolidated with or merged into another\ndomestic banking institution if, after\nthe merger or consolidation, (A) JPMorganChase, or its successor, and any one or more Intermediate\nSubsidiaries own at least 80% of the voting stock of the resulting bank and (B) treating for purposes of the\nsenior indenture the resulting bank as\nthe Bank, no covenant breach, event of default or event which, after notice or lapse of time or both, would\nbecome a covenant breach or event of default, shall have happened and be continuing.\n\nThe senior indenture defines an \u0093Intermediate Subsidiary\u0094 as a subsidiary (1) that is organized under the\nlaws of any domestic\njurisdiction and (2) of which all the shares of capital stock, and all securities convertible into, and\noptions, warrants and rights to purchase shares of capital stock, are owned directly by JPMorganChase, free\nand clear of any security interest.\nAs used above, \u0093voting stock\u0094 means a class of stock having general voting power under ordinary\ncircumstances to elect at least a majority of the board of directors, managers or trustees irrespective of\nthe happening of a contingency.\n\nDefaults andWaivers. Unless otherwise specified in the applicable prospectus supplement, under the senior\nindenture, any one of\nthe following events will be an event of default with respect to the senior debt securities of any series:\n\n(1) default in\nthe payment of principal of (or premium, if any, on) any senior debt securities of that series and\ncontinuance of that default for 30 days;\n\n(2) default in the payment of interest on any senior debt securities of that series and continuance of that\ndefault for 30\ndays;\n\n(3) specified events of bankruptcy, insolvency or reorganization of JPMorganChase; and\n\n(4) any other event of default specified with respect to senior debt securities of that series.\n\nSenior debt securities issued by us prior to December 31, 2016 (the \u0093Pre-2017 Senior Debt\u0094) contain events\nof default that are\ndifferent from those set forth above. In particular:\n                                                                                                            \n      The events of default applicable to the Pre-2017 Senior Debt do not provide for a 30-day cure period  \n      with respect                                                                                          \n      to any failure by us to pay the principal of those senior debt securities;                            \n                                                                                                            \n                                                                                                            \n      Most series of Pre-2017 Senior Debt contain an additional event of default that is applicable if we   \n      fail to                                                                                               \n      perform any of the covenants contained in the terms and conditions of, or the governing instrument    \n      for, those senior debt securities and that failure continues for 90 days; and                         \n                                                                                                            \n                                                                                                            \n      The events of default applicable to certain series of Pre-2017 Senior Debt provide that specified     \n      events of                                                                                             \n      bankruptcy, insolvency or reorganization of JPMorgan Chase Bank, N.A. would constitute an event of    \n      default with respect to those senior debt securities.                                                 \n                                                                                                            \n15\n\nAccordingly, if we fail to pay the principal of any series of Pre-2017 Senior Debt when due, the\nholders of such senior debt securities would be entitled to declare their securities due and payable\nimmediately, whereas holders of the senior debt securities of any series would not be entitled to accelerate\nthose senior debt securities until 30\ndays after our failure to pay the principal of those senior debt securities. In addition, holders of the\nsenior debt securities will not have the benefit of the additional events of default described above that\nare applicable to the Pre-2017 Senior\nDebt.\n\nUnder the senior indenture, if any event of default with respect to the senior debt securities of any series\noccurs and is\ncontinuing, either the trustee or the holders of not less than 25% in principal amount of the outstanding\nsenior debt securities of that series may declare the principal amount (or, if the senior debt securities of\nthat series are original issue\ndiscount senior debt securities, a specified portion of the principal amount) of all senior debt securities\nof that series to be due and payable immediately. No such declaration is required upon certain specified\nevents of bankruptcy, insolvency or\nreorganization. Subject to the conditions set forth in the senior indenture, the holders of a majority in\nprincipal amount of the outstanding senior debt securities of that series may annul the declaration and\nwaive past defaults, except uncured\npayment defaults and other specified defaults.\n\nWe will describe in the prospectus supplement any particular provisions relating to the\nacceleration of the maturity of a portion of the principal amount of original issue discount senior debt\nsecurities upon an event of default.\n\nSubordinated Debt Securities\n\nThe\nsubordinated debt securities will be direct, unsecured general obligations of JPMorganChase. The\nsubordinated debt securities will be subordinate and junior in right of payment to all Senior Indebtedness.\n\nUnless otherwise provided in the prospectus supplement relating to a particular series of subordinated debt\nsecurities, holders of the\nsubordinated debt securities may not accelerate the maturity of the subordinated debt securities, except in\nthe event of our bankruptcy, reorganization or insolvency, and may not accelerate the subordinated debt\nsecurities if we fail to pay\nprincipal or interest or fail to perform any other agreement in the subordinated debt securities or the\nsubordinated indenture. See \u0093\u0097 Defaults and Waivers\u0094 below.\n\nSubordination. The subordinated debt securities will be subordinate and junior in right of payment to all\nSenior Indebtedness whether\noutstanding on the date the subordinated indenture became effective or created, assumed or incurred after\nthat date.\n\nThe subordinated\nindenture defines \u0093Senior Indebtedness\u0094 to mean the principal of, and premium, if any, and interest on all\nof our indebtedness for money borrowed, including all indebtedness for money borrowed by another person that\nwe guarantee; similar\nobligations arising from off-balance sheet guarantees and direct credit substitutes; all obligations for\nclaims in respect of derivative products such as interest rate and foreign exchange contracts, commodity\ncontracts and similar arrangements; and\nany deferrals, renewals or extensions of any of the foregoing. However, Senior Indebtedness does not include\nindebtedness that is stated not to be senior to or to have the same rank as the subordinated debt securities\nor other securities having the\nsame rank as or that are subordinated to the subordinated debt securities. In particular, Senior\nIndebtedness does not include (A) the subordinated debt securities issued under the subordinated indenture,\n(B) the subordinated indebtedness issued\nunder the indenture, dated as of October 21, 2010, between us and U.S. Bank Trust National Association, as\ntrustee, and (C) other debt of JPMorganChase that is expressly stated to have the same rank as or not to\nrank senior to the subordinated debt\nsecurities or other securities having the same rank as or that are subordinated to the subordinated debt\nsecurities.\n\n16\n\nUnder the subordinated indenture, we may not make any payment on the subordinated debt securities\nin the event:\n                                                                                                            \n      we have failed to make full payment of all amounts of principal, and premium, if any, and interest,   \n      if any, due                                                                                           \n      on all Senior Indebtedness; or                                                                        \n                                                                                                            \n                                                                                                            \n      there shall exist any event of default on any Senior Indebtedness permitting the holders thereof to   \n      accelerate                                                                                            \n      the maturity thereof or any event which, with notice or lapse of time or both, would become such an   \n      event of default.                                                                                     \n                                                                                                            \nIn addition, upon our dissolution, winding-up, liquidation or reorganization (whether in bankruptcy,\ninsolvency or receivership proceedings or\notherwise) we must pay to the holders of Senior Indebtedness the full amounts of principal of, and premium,\nif any, and interest, if any, on the Senior Indebtedness before any payment or distribution is made on the\nsubordinated debt securities.\n\nNo series of our subordinated debt securities (other than our outstanding junior subordinated indebtedness)\nis subordinated to any other\nseries of subordinated debt securities or to any other subordinated indebtedness of JPMorganChase referred\nto above. However, due to the subordination provisions of the various series of subordinated indebtedness\nissued by us and our predecessor\ninstitutions, in the event of our dissolution, winding-up, liquidation, reorganization or insolvency,\nholders of the subordinated debt securities that may be offered by use of this prospectus and an applicable\nprospectus supplement may recover less,\nratably, than holders of some of our other series of outstanding subordinated indebtedness and more,\nratably, than holders of other series of our outstanding subordinated indebtedness. In addition, holders of\nthe subordinated debt securities\nmay be fully subordinated to interests held by the U.S. government in the event that we enter into a\nreceivership, insolvency, liquidation or similar proceeding.\n\nNo Limitation on Disposition of Voting Stock of the Bank. The subordinated indenture does not contain a\ncovenant prohibiting us from\nselling or otherwise disposing of any shares of voting stock of the Bank, or securities convertible into, or\noptions, warrants or rights to purchase shares of voting stock of the Bank. The subordinated indenture also\ndoes not prohibit the Bank from\nissuing any shares of its voting stock or securities convertible into, or options, warrants or rights to\npurchase shares of its voting stock.\n\nDefaults and Waivers. Unless otherwise specified in the prospectus supplement relating to a particular\nseries of subordinated debt\nsecurities, the subordinated indenture defines an event of default with respect to any series of\nsubordinated debt securities as follows:\n                                                                                          \n      specified events of bankruptcy, reorganization or insolvency of JPMorganChase; and  \n                                                                                          \n                                                                                              \n      any other event specified with respect to subordinated debt securities of that series.  \n                                                                                              \nIf any event of default with respect to subordinated debt securities of any series occurs and is continuing,\neither the trustee or the holders\nof not less than 25% in principal amount of the outstanding subordinated debt securities of that series may\ndeclare the principal amount (or, if the subordinated debt securities of that series are original issue\ndiscount subordinated debt\nsecurities, a specified portion of the principal amount) of all subordinated debt securities of that series\nto be due and payable immediately. No such declaration is required upon certain specified events of\nbankruptcy, reorganization or insolvency.\nSubject to the conditions set forth in the subordinated indenture, the holders of a majority in principal\namount of the outstanding subordinated debt securities of that series may annul the declaration and waive\npast defaults, except uncured payment\ndefaults.\n\nWe will describe in the prospectus supplement any particular provisions relating to the acceleration of the\nmaturity of a\nportion of the principal amount of original issue discount subordinated debt securities upon an event of\ndefault. In the event of the bankruptcy, liquidation, reorganization or insolvency of JPMorganChase, any\nright to enforce that payment in cash\nwould be subject to the broad equity powers of a federal bankruptcy court and to its determination of the\nnature and status of the payment claims of the holders of the subordinated debt securities.\n\n17\n\nUnless otherwise provided in the prospectus supplement relating to a particular series of\nsubordinated debt securities, there will be no right of acceleration of the payment of principal of the\nsubordinated debt securities of that series upon a default in the payment of principal or interest or a\ndefault in the performance of any\ncovenant or agreement in the subordinated debt securities or the subordinated indenture. In the event of a\ndefault in the payment of principal or interest or a default in the performance of any covenant or agreement\nin the subordinated debt\nsecurities or the subordinated indenture, the trustee may, subject to specified limitations and conditions,\nseek to enforce that payment or the performance of that covenant or agreement.\n\nCovenant Breach\n\nUnder each indenture, a\n\u0093covenant breach\u0094 would occur with respect to the debt securities of any series issued under that indenture\nif we fail to perform or breach any of the covenants contained in that indenture (in the case of the senior\nindenture, other than a\nfailure to pay principal of or interest on the senior debt securities) and that failure or breach continues\nfor 90 days after the trustee under that indenture or the holders of not less than 25% in principal amount\nof the outstanding debt securities\nof that series give written notice of that failure or breach. Under each indenture, neither the trustee nor\nthe holders of the debt securities will be entitled to accelerate the maturity of the debt securities as a\nresult of any covenant breach.\n\nIf a covenant breach or event of default with respect to the debt securities of any series occurs and is\ncontinuing, the relevant trustee\nmay in its discretion proceed to protect and enforce its rights and the rights of the holders of those debt\nsecurities by such appropriate judicial proceedings as the trustee deems most effectual to protect and\nenforce any such rights, whether for\nthe specific enforcement of any covenant or agreement in the relevant indenture, in aid of the exercise of\nany power granted in that indenture, or to enforce any other proper remedy.\n\nLimitation of Suits\n\nUnder each\nindenture, a holder of the debt securities of any series issued under that indenture will not have the right\nto institute any proceeding with respect to that indenture or those debt securities unless:\n                                                                                                            \n      the holder has given the trustee written notice of a continuing covenant breach or event of default   \n      with respect                                                                                          \n      to those debt securities;                                                                             \n                                                                                                            \n                                                                                                            \n      the holders of not less than 25% in principal amount of those debt securities at the time             \n      outstanding have made a                                                                               \n      written request to the trustee to institute proceedings in respect of the covenant breach or event    \n      of default, and offered the trustee indemnity reasonably satisfactory to it; and                      \n                                                                                                            \n                                                                                                            \n      the trustee has not received from the holders of a majority in principal amount of those debt         \n      securities at the                                                                                     \n      time outstanding a direction inconsistent with such request, and has failed to institute any such     \n      proceeding, for 60 days after receipt of such notice, request and offer of indemnity.                 \n                                                                                                            \nThe foregoing limitations will not apply to any suit instituted by holders of the debt securities for the\nenforcement of any payment of\nprincipal or interest on or after the date when due.\n\nOther Provisions of the Indentures\n\nEach of the indentures requires the relevant trustee, within 90 days after the occurrence of a default known\nto it with respect to the debt\nsecurities of any series issued under that indenture, to give the holders of those debt securities notice of\nthe default if uncured or not waived. The trustee may withhold the notice if it determines in good faith\nthat the withholding of the notice\nis in the interest of those holders. However, the trustee may not withhold the notice in the case of a\ndefault in the payment of principal or interest. The trustee may not give the above notice until at least 60\ndays after the occurrence of a\ndefault in the performance of a covenant in the indenture, other than, in the case of the senior indenture,\na covenant to pay principal of or interest on the senior debt securities. The term \u0093default\u0094 for the purpose\nof this provision\nmeans any event that is, or after notice or lapse of time or both would become, a covenant breach or event\nof default with respect to the debt securities.\n\n18\n\nOther than the duty to act with the required standard of care during a default, the trustee under\neach of the indentures is not obligated to exercise any of its rights or powers under that indenture at the\nrequest or direction of any of the holders of the debt securities issued under that indenture, unless the\nholders have offered to the trustee\nreasonable security or indemnity. Each of the indentures provides that the holders of a majority in\nprincipal amount of the debt securities issued under that indenture may direct the time, method and place of\nconducting any proceeding for any remedy\navailable to the trustee, or exercising any trust or other power conferred on the trustee. However, the\ntrustee may decline to act if the direction is contrary to law or the indenture, and the trustee may take\nany other action deemed proper by the\ntrustee which is not inconsistent with such direction.\n\nEach of the indentures includes a covenant requiring us to file annually with the\nrelevant trustee a certificate stating that there exists no covenant breach, event of default or event that\nis, or after notice or lapse of time or both would become, a covenant breach or event of default under the\nrelevant indenture, or if any such\ndefault exists, specifying such default.\n\nInformation Concerning The Trustees\n\nWe and our subsidiaries may maintain deposits or conduct other banking transactions with the trustees under\nthe senior indenture and the\nsubordinated indenture in the ordinary course of business. Deutsche Bank Trust Company Americas is a trustee\nunder certain of our existing indentures pursuant to which we have issued and outstanding series of senior\ndebt securities. U.S. Bank\nTrust National Association is a trustee under certain of our existing indentures pursuant to which we have\nissued and outstanding series of subordinated debt securities.\n\nInsolvency and Resolution Considerations\n\nThe debt securities offered by use of this prospectus constitute \u0093loss-absorbing capacity\u0094 within the\nmeaning of the rules issued by\nthe Board of Governors of the Federal Reserve System (the \u0093Federal Reserve\u0094). Federal Reserve rules require\nthat JPMorgan Chase & Co. (the \u0093Parent Company\u0094) maintain minimum levels of unsecured external long-term\ndebt and\nother loss-absorbing capacity with specific terms for purposes of recapitalizing JPMorganChase\u0092s operating\nsubsidiaries if the Parent Company were to enter into a resolution either:\n                                                                                   \n      in a bankruptcy proceeding under Chapter 11 of the U.S. Bankruptcy Code, or  \n                                                                                   \n                                                                                                            \n      in a receivership administered by the Federal Deposit Insurance Corporation (\u0093FDIC\u0094) under Title II of  \n      the Dodd-Frank Act (\u0093Title II\u0094).                                                                        \n                                                                                                            \nIf the Parent Company were to enter into a resolution, holders of the debt\nsecurities offered by use of this prospectus and other debt and equity securities of the Parent Company will\nabsorb the losses of the Parent Company and its subsidiaries.\n\nThe preferred \u0093single point of entry\u0094 strategy under JPMorganChase\u0092s resolution plan contemplates that only\nthe Parent Company\nwould enter bankruptcy proceedings. JPMorganChase\u0092s subsidiaries would be recapitalized, as needed, so that\nthey could continue normal operations or subsequently be divested or wound down in an orderly manner. As a\nresult, the Parent\nCompany\u0092s losses and any losses incurred by its subsidiaries would be imposed first on holders of the Parent\nCompany\u0092s equity securities and thereafter on its unsecured creditors, including holders of the debt\nsecurities offered by use of\nthis prospectus and other debt securities. Claims of holders of those securities would have a junior\nposition to the claims of creditors of JPMorganChase\u0092s subsidiaries and to the claims of priority (as\ndetermined by statute) and secured\ncreditors of the Parent Company.\n\nAccordingly, in a resolution of the Parent Company in bankruptcy, holders of the debt securities offered\nby use of this prospectus and other debt securities of the Parent Company would realize value only to the\nextent available to the Parent Company as a shareholder of JPMorgan Chase Bank, N.A. and its other\nsubsidiaries, and only after any claims of\npriority and secured creditors of the Parent Company have been fully repaid.\n\n19\n\nThe FDIC has similarly indicated that a single-point-of-entry recapitalization model would be its\nexpected strategy to resolve a systemically important financial institution, such as the Parent Company,\nunder Title II. However, the FDIC has not formally adopted or committed to any specific resolution strategy.\n\nIf the Parent Company were to approach, or enter into, a resolution, none of the Parent Company, the Federal\nReserve or the FDIC is obligated\nto follow JPMorganChase\u0092s preferred resolution strategy, and losses to holders of the debt securities\noffered by use of this prospectus and other debt and equity securities of the Parent Company, under whatever\nstrategy is ultimately followed,\ncould be greater than they might have been under JPMorganChase\u0092s preferred strategy.\n\n20\n\nDESCRIPTION OF PREFERRED STOCK\n\nGeneral\n\nUnder our certificate of\nincorporation, our board of directors is authorized, without further stockholder action, to issue up to\n200,000,000 shares of preferred stock, $1 par value per share, in one or more series, and to determine the\nvoting powers and the designations,\npreferences and relative, participating, optional or other special rights, and qualifications, limitations\nor restrictions of each series. We may amend our certificate of incorporation to increase or decrease the\nnumber of authorized shares of\npreferred stock in a manner permitted by our certificate of incorporation and the Delaware General\nCorporation Law (\u0093DGCL\u0094). As of the date of this prospectus, we have the following issued and outstanding\nseries of preferred stock, the\nterms of each of which we summarize below:\n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series CC;  \n                                                                         \n                                                        \n      5.75% Non-Cumulative Preferred Stock, Series DD;  \n                                                        \n                                                        \n      6.00% Non-Cumulative Preferred Stock, Series EE;  \n                                                        \n                                                        \n      4.75% Non-Cumulative Preferred Stock, Series GG;  \n                                                        \n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series II;  \n                                                                         \n                                                        \n      4.55% Non-Cumulative Preferred Stock, Series JJ;  \n                                                        \n                                                                         \n      3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK;  \n                                                                         \n                                                         \n      4.625% Non-Cumulative Preferred Stock, Series LL;  \n                                                         \n                                                        \n      4.20% Non-Cumulative Preferred Stock, Series MM;  \n                                                        \n                                                                              \n      6.875% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series NN; and  \n                                                                              \n                                                                         \n      6.500% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series OO  \n                                                                         \nWe will describe the particular terms of any series of preferred stock being offered in the prospectus\nsupplement relating to that series of\npreferred stock. Those terms may include:\n                                           \n      the number of shares being offered;  \n                                           \n                                                       \n      the title and liquidation preference per share;  \n                                                       \n                           \n      the purchase price;  \n                           \n                                                              \n      the dividend rate or method for determining that rate;  \n                                                              \n                                                  \n      the dates on which dividends will be paid;  \n                                                  \n                                                                                                            \n      whether dividends will be cumulative or noncumulative and, if cumulative, the dates from which        \n      dividends will                                                                                        \n      begin to accumulate;                                                                                  \n                                                                                                            \n                                                             \n      any applicable redemption or sinking fund provisions;  \n                                                             \n                                             \n      any applicable conversion provisions;  \n                                             \n                                                                                                           \n      whether we have elected to offer depositary shares representing that series of preferred stock; and  \n                                                                                                           \n                                                                                                            \n      any additional dividend, liquidation, redemption, sinking fund and other rights and restrictions      \n      applicable to                                                                                         \n      that series of preferred stock.                                                                       \n                                                                                                            \n21\n\nIf the terms of any series of preferred stock being offered differ from the terms set forth\nbelow, we will also disclose those different terms in the prospectus supplement relating to that series of\npreferred stock. The following summary is not complete. You should also refer to our certificate of\nincorporation and to the certificate of\ndesignations relating to the series of the preferred stock being offered for the complete terms of that\nseries of preferred stock. A form of certificate of designations is filed as an exhibit to the registration\nstatement. We will file the\ncertificate of designations with respect to the particular series of preferred stock being offered with the\nSEC promptly after the offering of that series of preferred stock.\n\nThe preferred stock will, when issued against full payment of the purchase price relating to a series of\npreferred stock, be fully paid and\nnonassessable. Unless otherwise specified in the prospectus supplement, in the event we liquidate, dissolve\nor wind-up our business, each series of preferred stock being offered will have the same rank as to\ndividends and distributions as our\ncurrently outstanding preferred stock and each other series of preferred stock we may offer in the future by\nuse of this prospectus and an applicable prospectus supplement. The preferred stock will have no preemptive\nrights.\n\nDividend Rights\n\nHolders of the preferred\nstock offered by use of this prospectus and an applicable prospectus supplement will be entitled to receive,\nwhen, as and if declared by our board of directors or any duly authorized committee of our board, cash\ndividends at the rates and on the\ndates set forth in the prospectus supplement. Dividend rates may be fixed or variable or both. Different\nseries of preferred stock may be entitled to dividends at different dividend rates or based upon different\nmethods of determination. We will pay\neach dividend to the holders of record as they appear on our stock register (or, if applicable, the records\nof the depositary referred to under \u0093Description of Depositary Shares\u0094) on record dates determined by our\nboard of directors or a\nduly authorized committee of our board. Dividends on any series of preferred stock may be cumulative or\nnoncumulative, as specified in the prospectus supplement. If a dividend is not declared on any series of\npreferred stock for which dividends are\nnoncumulative, then the right of holders of that preferred stock to receive that dividend will be lost, and\nwe will have no obligation to pay the dividend for that dividend period, whether or not dividends are\ndeclared for any future dividend\nperiod.\n\nUnless otherwise specified in the applicable prospectus supplement, each series of preferred stock that we\noffer by use of this\nprospectus and an applicable prospectus supplement will provide that we may not declare or pay or set aside\nfor payment full dividends on any series of preferred stock ranking, as to dividends, equally with or junior\nto the series of preferred stock\nwe are offering unless we have previously declared and paid or set aside for payment, or we\ncontemporaneously declare and pay or set aside for payment, full dividends (including cumulative dividends\nstill owing, if any) on the series of preferred\nstock we are offering for, in the case of a series of noncumulative preferred stock, the most recently\ncompleted dividend period, or, in the case of a series of cumulative preferred stock, all past dividend\nperiods. If we fail to pay dividends in\nfull as stated above, we may only declare dividends on equally ranking series of preferred stock pro rata so\nthat the amount of dividends declared per share on the series of preferred stock we are offering and the\nequally ranking series bear to each\nother the same ratio that accumulated and unpaid dividends per share on the series being offered and the\nother series bear to each other. We will not pay interest or any sum of money instead of interest in respect\nof any dividend that is not\ndeclared, or if declared is not paid, on any series of preferred stock we are offering.\n\nUnless otherwise specified in the applicable\nprospectus supplement, the preferred stock we offer by use of this prospectus and an applicable prospectus\nsupplement will also provide that, unless we have paid or declared and set aside a sum sufficient for the\npayment thereof, in the case\nof a series of noncumulative preferred stock, full dividends on all outstanding shares of that preferred\nstock in respect of the most recently completed dividend period, or, in the case of a series of cumulative\npreferred stock, full dividends,\nincluding cumulative dividends, if any, owing on that preferred stock for all past dividend periods:\n                                                                                                            \n      no dividend (other than a dividend in common stock or in any junior or equally ranking stock as to    \n      dividends and                                                                                         \n      upon liquidation, dissolution or winding-up) will be declared or paid or a sum sufficient for the     \n      payment thereof set aside for such payment or other distribution declared or made upon our            \n                                                                                                            \n22\n                                                      \n  common stock or upon any junior or equally ranking  \n  stock as to dividends or upon liquidation,          \n  dissolution or winding-up, and                      \n                                                      \n                                                                                                            \n      no common stock or other capital stock ranking junior or equally as to dividends or upon              \n      liquidation, dissolution                                                                              \n      or winding-up will be redeemed, purchased or otherwise acquired for any consideration (or any moneys  \n      be paid to or made available for a sinking fund for the redemption of any shares of any such capital  \n      stock) by us, except:                                                                                 \n                                                                                                            \n                                                                                                            \n  (1)  by conversion into or exchange for capital stock ranking junior to the preferred stock being         \n       offered;                                                                                             \n                                                                                                            \n                                                                                                            \n  (2)  as a result of reclassification into capital stock ranking junior to the preferred stock being       \n       offered;                                                                                             \n                                                                                                            \n                                                                                                            \n       through the use of the proceeds of a substantially contemporaneous sale of shares of capital stock   \n       ranking                                                                                              \n  (3)  junior to the preferred stock being offered or, in the case of capital stock ranking on a parity     \n       with the preferred stock being offered, through the use of the proceeds of a substantially           \n       contemporaneous sale of other shares of capital stock ranking                                        \n       on a parity with the preferred stock being offered;                                                  \n                                                                                                            \n                                                                                                            \n       in the case of capital stock ranking on a parity with the preferred stock being offered, pursuant    \n  (4)  to pro rata                                                                                          \n       offers to purchase all or a pro rata portion of the shares of preferred stock being offered and      \n       such capital stock ranking on a parity with the preferred stock being offered;                       \n                                                                                                            \n                                                                                                            \n       in connection with the satisfaction of our obligations pursuant to any contract entered into in the  \n  (5)  ordinary                                                                                             \n       course prior to the beginning of the most recently completed dividend period; or                     \n                                                                                                            \n                                                                                                            \n       any purchase, redemption or other acquisition of capital stock ranking junior to the preferred       \n       stock being                                                                                          \n  (6)  offered pursuant to any of our or our subsidiaries\u0092 employee, consultant or director incentive or     \n       benefit plans or arrangements (including any employment, severance or consulting arrangements)       \n       adopted before or after the issuance of the                                                          \n       preferred stock being offered).                                                                      \n                                                                                                            \nHowever, the foregoing will not restrict our ability or the ability of any of our\naffiliates to engage in underwriting, stabilization, market-making or similar transactions in our capital\nstock in the ordinary course of business. Subject to the conditions described above, and not otherwise,\ndividends (payable in cash, capital\nstock, or otherwise), as may be determined by our board of directors or a duly authorized committee of our\nboard, may be declared and paid on our common stock and any other capital stock ranking junior to or on a\nparity with the preferred stock\nbeing offered from time to time out of any assets legally available for such payment, and the holders of the\npreferred stock being offered will not be entitled to participate in those dividends.\n\nAs used in this prospectus, \u0093junior to the preferred stock being offered\u0094 and like terms refer to our common\nstock and any other\nclass or series of our capital stock over which the preferred stock being offered has preference or\npriority, either as to dividends or upon liquidation, dissolution or winding-up, or both, as the context may\nrequire; \u0093parity preferred\nstock\u0094 and \u0093on a parity with the preferred stock being offered\u0094 and like terms refer to any class or series\nof our capital stock that ranks on a parity with the shares of the preferred stock being offered, either as\nto dividends or\nupon liquidation, dissolution or winding-up, or both, as the context may require; and \u0093senior to the\npreferred stock being offered\u0094 and like terms refer to any class or series of our capital stock that ranks\nsenior to the preferred stock\nbeing offered, either as to dividends or upon liquidation, dissolution or winding-up, or both, as the\ncontext may require.\n\nUnless\notherwise specified in the applicable prospectus supplement, we will compute the amount of dividends payable\nby annualizing the applicable dividend rate and dividing by the number of dividend periods in a year, except\nthat the amount of dividends\npayable for any period greater or less than a full dividend period, other than the initial dividend period,\nwill be computed on the basis of a 360-day year consisting of twelve 30-day months and, for any\nperiod less than a full month, the actual number of days elapsed in the period. Dollar amounts resulting\nfrom that calculation will be rounded to the nearest cent, with one-half cent being rounded upward.\n\n23\n\nRights Upon Liquidation\n\nIn the event of our voluntary or involuntary liquidation, dissolution or winding-up, holders of each series\nof preferred stock that we offer by\nuse of this prospectus and an applicable prospectus supplement will be entitled to receive and to be paid\nout of our assets legally available for distribution to our stockholders the amount set forth in the\nprospectus supplement plus, in the case of\na series of noncumulative preferred stock, an amount equal to any declared and unpaid dividends, without\naccumulation of undeclared dividends, if any, from the day following the immediately preceding dividend\npayment date, to, but not including, the\ndate of the liquidating distribution, but without accumulation of any unpaid dividends for prior dividend\nperiods, or, in the case of a series of cumulative preferred stock, an amount equal to any accumulated and\nunpaid dividends, whether or not\ndeclared, before we make any payment or distribution on our common stock or on any other capital stock\nranking junior to the preferred stock offered by use of this prospectus and an applicable prospectus\nsupplement, and any stock having the same\nrank as that series of preferred stock upon our liquidation, dissolution or winding-up. After the payment to\nsuch holders of the full preferential amounts to which they are entitled, such holders will have no right or\nclaim to any of our remaining\nassets.\n\nIf, upon our voluntary or involuntary liquidation, dissolution or winding-up, we fail to pay in full the\namounts payable with\nrespect to preferred stock offered by use of this prospectus and an applicable prospectus supplement, and\nany stock having the same rank as that series of preferred stock, the holders of the preferred stock and of\nthat other stock will share ratably\nin any such distribution of our assets in proportion to the full respective distributions to which they are\nentitled. For any series of preferred stock offered by use of this prospectus and an applicable prospectus\nsupplement, neither the sale of\nall or substantially all of our property or business, nor our merger or consolidation into or with any other\nentity will be considered a liquidation, dissolution or winding-up.\n\nRedemption\n\nThe applicable prospectus\nsupplement will indicate whether the series of preferred stock offered by use of this prospectus and the\napplicable prospectus supplement is subject to redemption, in whole or in part, whether at our option or\nmandatorily and whether or not pursuant\nto a sinking fund. The redemption provisions that may apply to a series of preferred stock offered,\nincluding the redemption dates, the redemption prices for that series and whether those redemption prices\nwill be paid in cash, stock or a\ncombination of cash and stock, will be set forth in the prospectus supplement. If the redemption price is to\nbe paid only from the proceeds of the sale of our capital stock, the terms of the series of preferred stock\nmay also provide that, if our\ncapital stock is not sold or if the amount of cash received is insufficient to pay in full the redemption\nprice then due, the series of preferred stock will automatically be converted into shares of the applicable\ncapital stock pursuant to\nconversion provisions specified in the prospectus supplement.\n\nIf we are redeeming fewer than all the outstanding shares of preferred\nstock of any series, whether by mandatory or optional redemption, our board of directors or any duly\nauthorized committee of our board will determine the method for selecting the shares to be redeemed, which\n(unless otherwise specified in the\napplicable prospectus supplement) may be by lot or pro rata or in such other manner as the board of\ndirectors or any duly authorized committee of our board determines to be equitable. From and after the\nredemption date, dividends will cease to\naccumulate on the shares of preferred stock called for redemption up to the redemption date and all rights\nof the holders of those shares, except the right to receive the redemption price, will cease.\n\nIn the event that we fail to pay full dividends, including accumulated but unpaid dividends, if any, on any\nseries of preferred stock offered,\nwe may not redeem that series in part and we may not purchase or acquire any shares of that series of\npreferred stock, except by a purchase or exchange offer made on the same terms to all holders of that series\nof preferred stock.\n\n24\n\nConversion Rights\n\nThe prospectus supplement will state the terms, if any, on which shares of the series of preferred stock\noffered by use of this prospectus and\nan applicable prospectus supplement are convertible into shares of our common stock or other securities. As\ndescribed under \u0093\u0097 Redemption\u0094 above, under certain circumstances, preferred stock may be mandatorily\nconvertible into our\ncommon stock or another series of our preferred stock.\n\nVoting Rights\n\nExcept as indicated below or in the applicable prospectus supplement, or except as expressly required by\napplicable law, the holders of the\npreferred stock offered by use of this prospectus and an applicable prospectus supplement will not be\nentitled to vote. Unless otherwise indicated in the prospectus supplement, each share of preferred stock of\neach series will be entitled to one\nvote on matters on which holders of that series of preferred stock are entitled to vote. However, as more\nfully described under \u0093Description of Depositary Shares,\u0094 if we use this prospectus and an applicable\nprospectus supplement to offer\ndepositary shares representing a fractional interest in a share of a series of preferred stock, each\ndepositary share, in effect, will be entitled to that fraction of a vote, rather than a full vote. If\n(unless otherwise indicated in the prospectus\nsupplement) each full share of any series of preferred stock offered is entitled to one vote, the voting\npower of that series will depend on the number of shares in that series, and not on the aggregate\nliquidation preference or initial offering\nprice of the shares of that series of preferred stock.\n\nUnless otherwise specified in a prospectus supplement, if, at any time or times,\nthe equivalent of an aggregate of six quarterly dividends, whether or not consecutive, for any series of\npreferred stock being offered has not been paid, the number of directors constituting our board of directors\nwill be automatically increased by\ntwo and the holders of each outstanding series of preferred stock with such voting rights, together with\nholders of such other shares of any other class or series of parity preferred stock outstanding at the time\nupon which like voting rights have\nbeen conferred and are exercisable, which we refer to as \u0093voting parity stock,\u0094 voting together as a class,\nwill be entitled to elect those additional two directors, which we refer to as \u0093preferred directors,\u0094 at\nthat annual\nmeeting and at each subsequent annual meeting of stockholders until full dividends have been paid for at\nleast four quarterly consecutive dividend periods. At that time such right will terminate, except as\nexpressly provided in the applicable\ncertificate of designations or by law, subject to revesting. Upon any termination of the right of the\nholders of shares of preferred stock being offered and voting parity stock as a class to vote for directors\nas provided above, the preferred\ndirectors will cease to be qualified as directors, the term of office of all preferred directors then in\noffice will terminate immediately and the authorized number of directors will be reduced by the number of\npreferred directors elected. Any\npreferred director may be removed and replaced at any time, with cause as provided by law or without cause\nby the affirmative vote of the holders of shares of preferred stock voting together as a class with the\nholders of shares of voting parity\nstock, to the extent the voting rights of such holders described above are then exercisable. Any vacancy\ncreated by removal with or without cause may be filled only as described in the preceding sentence. If the\noffice of any preferred director\nbecomes vacant for any reason other than removal, the remaining preferred director may choose a successor\nwho will hold office for the unexpired term in respect of which such vacancy occurred.\n\nSo long as any shares of the preferred stock being offered remain outstanding, we will not, without the\naffirmative vote of the holders of at\nleast 66 2/3% in voting power of the preferred stock being offered and any voting parity stock, voting\ntogether as a class, authorize, create or issue any capital stock ranking senior to the preferred stock\nbeing offered as to dividends or upon\nliquidation, dissolution or winding-up, or reclassify any authorized capital stock into any such shares of\nsuch capital stock or issue any obligation or security convertible into or evidencing the right to purchase\nany such shares of capital stock.\nSo long as any shares of the preferred stock being offered remain outstanding, we will not, without the\naffirmative vote of the holders of at least 66 2/3% in voting power of the preferred stock being offered,\namend, alter or repeal any provision of\nthe applicable certificate of designations or our certificate of incorporation, including by merger,\nconsolidation or otherwise, so as to adversely affect the powers, preferences or special rights of the\npreferred stock being offered.\n\n25\n\nNotwithstanding the foregoing, none of the following will be deemed to adversely affect the\npowers, preferences or special rights of the preferred stock being offered:\n                                                                                                            \n      any increase in the amount of authorized common stock or authorized preferred stock, or any increase  \n      or decrease                                                                                           \n      in the number of shares of any series of preferred stock, or the authorization, creation and          \n      issuance of other classes or series of capital stock, in each case ranking on a parity with or        \n      junior to the preferred stock being offered as to dividends                                           \n      or upon liquidation, dissolution or winding-up;                                                       \n                                                                                                            \n                                                                                                            \n      a merger or consolidation of JPMorganChase with or into another entity in which the shares of the     \n      preferred stock                                                                                       \n      being offered remain outstanding; and                                                                 \n                                                                                                            \n                                                                                                            \n      a merger or consolidation of JPMorganChase with or into another entity in which the shares of the     \n      preferred stock                                                                                       \n      being offered are converted into or exchanged for preference securities of the surviving entity or    \n      any entity, directly or indirectly, controlling such surviving entity and such new preference         \n      securities have powers, preferences and special rights                                                \n      that are not materially less favorable than the preferred stock being offered;                        \n                                                                                                            \nprovided that if the amendment would adversely affect\nsuch series but not any other series of outstanding preferred stock, then the amendment will only need to be\napproved by holders of at least two-thirds of the shares of the series of preferred stock adversely\naffected.\n\nUnder regulations adopted by the Federal Reserve Board, if the holders of any series of our preferred stock\nbecome entitled to vote for the\nelection of directors because dividends on that series are in arrears, that series may then be deemed a\n\u0093class of voting securities.\u0094 In such a case, a holder of 25% or more of the series, or a holder of 5% or\nmore if that holder would\nalso be considered to exercise a \u0093controlling influence\u0094 over JPMorganChase, may then be subject to\nregulation as a bank holding company in accordance with the Bank Holding Company Act. In addition, (1) any\nother bank holding company may\nbe required to obtain the prior approval of the Federal Reserve Board to acquire or retain 5% or more of\nthat series, and (2) any person other than a bank holding company may be required to provide notice to the\nFederal Reserve Board prior to\nacquiring or retaining 10% or more of that series.\n\nOutstanding Series of Preferred Stock\n\nRanking. Each of our Series CC Preferred Stock, Series DD Preferred Stock, Series EE Preferred Stock, Series\nGG Preferred Stock, Series\nII Preferred Stock, Series JJ Preferred Stock, Series KK Preferred Stock, Series LL Preferred Stock, Series\nMM Preferred Stock, Series NN Preferred Stock and Series OO Preferred Stock (each as defined below, and\ncollectively, the \u0093Outstanding\nPreferred Stock\u0094) ranks senior to our common stock as well as any of our other stock that states it is\nexpressly made junior to such series of Outstanding Preferred Stock as to payment of dividends and\ndistribution of assets upon our\nliquidation, dissolution, or winding up.\n\nDividends. We may not declare or pay or set apart for payment full dividends on any\nseries of preferred stock ranking, as to dividends, equally with or junior to the Outstanding Preferred\nStock unless we have previously declared and paid or set apart for payment full dividends on the Outstanding\nPreferred Stock for the most\nrecently completed dividend period. When dividends are not paid in full on the Outstanding Preferred Stock\nand any series of preferred stock ranking equally as to dividends, all dividends upon the Outstanding\nPreferred Stock and such equally ranking\nseries will be declared and paid pro rata.\n\nWith certain exceptions, unless we have paid or declared and set aside for payment full\ndividends on the Outstanding Preferred Stock for the most recently completed dividend period, we will not:\n                                                                                                            \n      declare or make any dividend payment or distribution on any junior ranking stock, other than a        \n      dividend paid in                                                                                      \n      junior ranking stock, or                                                                              \n                                                                                                            \n26\n                                                                                                            \n      redeem, purchase, otherwise acquire or set apart money for a sinking fund for the redemption of any   \n      junior or                                                                                             \n      equally ranking stock, except by conversion into or exchange for junior ranking stock.                \n                                                                                                            \nRights Upon Liquidation.\nIn the event we liquidate, dissolve or wind-up our business and affairs, either voluntarily or\ninvoluntarily, holders of the Outstanding Preferred Stock of each series will be entitled to receive\nliquidating distributions equal to the liquidation\npreference per share for such series, plus any declared and unpaid dividends, without accumulation of\nundeclared dividends, before we make any distribution of assets to the holders of our common stock or any\nother class or series of shares ranking\njunior to the Outstanding Preferred Stock of such series.\n\nRedemption. We may redeem each series of Outstanding Preferred Stock on\nthe dates and at the redemption prices set forth below. In addition, we may redeem each series of\nOutstanding Preferred Stock in whole, but not in part, at a redemption price equal to the liquidation\npreference per share for each such series of\nOutstanding Preferred Stock, plus any declared and unpaid dividends, following the occurrence of a capital\ntreatment event. For these purposes, \u0093capital treatment event\u0094 means the good faith determination by\nJPMorganChase that, as a result\nof any:\n                                                                                                            \n      amendment to, or change or any announced prospective change in, the laws or regulations of the        \n      United States or                                                                                      \n      any political subdivision of or in the United States that is enacted or becomes effective after the   \n      initial issuance of any shares of such series of Outstanding Preferred Stock;                         \n                                                                                                            \n                                                                                                            \n      proposed change in those laws or regulations that is announced or becomes effective after the         \n      initial issuance of                                                                                   \n      any shares of such series of Outstanding Preferred Stock; or                                          \n                                                                                                            \n                                                                                                            \n      official administrative decision or judicial decision or administrative action or other official      \n      pronouncement                                                                                         \n      interpreting or applying those laws or regulations that is announced or becomes effective after the   \n      initial issuance of any shares of such series of Outstanding Preferred Stock,                         \n                                                                                                            \nthere is more than an insubstantial risk that JPMorganChase will not be entitled to treat an amount equal to\nthe full liquidation amount of all shares of such\nseries of Outstanding Preferred Stock then outstanding as \u0093additional Tier 1 capital\u0094 (or its equivalent)\nfor purposes of the capital adequacy guidelines or regulations of the appropriate federal banking agency, as\nthen in effect and\napplicable, for as long as any share of such series of Outstanding Preferred Stock is outstanding.\nRedemption of any Outstanding Preferred Stock may be subject to our receipt of any required approvals from\nthe Federal Reserve Board or any other\nregulatory authority.\n\nVoting Rights. The Outstanding Preferred Stock has limited voting rights. Each share of Outstanding\nPreferred Stock has one vote whenever it is entitled to voting rights.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series CC\n\nOn October 20, 2017, we issued an aggregate of 125,750 shares of Fixed-to-Floating Rate Non-Cumulative\nPreferred Stock,\nSeries CC, $1 par value, with a liquidation preference of $10,000 per share (the \u0093Series CC Preferred\nStock\u0094). Shares of the Series CC Preferred Stock are represented by depositary shares, each representing a\none-tenth interest in a share\nof preferred stock of the series.\n\nDividends. Dividends on the Series CC Preferred Stock are payable when, as, and if declared by\nour board of directors or a duly authorized committee of our board, from the date of issuance to, but\nexcluding, November 1, 2022 at a rate of 4.625% per annum, payable semi-annually in arrears, on May 1 and\nNovember 1 of each year, beginning on May\n1, 2018. From and including November 1, 2022, dividends will be paid when, as, and if declared by our board\nor such committee at a floating rate equal to three-month LIBOR plus a spread of 2.58% per annum, payable\nquarterly in arrears, on February\n1, May 1, August 1 and November 1 of each year, beginning on February 1, 2023. Dividends on the Series CC\nPreferred Stock are neither mandatory nor cumulative.\n\n27\n\nRedemption. The Series CC Preferred Stock may be redeemed on any dividend payment date on\nor after November 1, 2022, in whole or from time to time in part, at a redemption price equal to $10,000 per\nshare (equivalent to $1,000 per depositary share), plus any declared and unpaid dividends. We may also\nredeem the Series CC Preferred Stock\nfollowing the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n5.75% Non-Cumulative Preferred Stock, Series DD\n\nOn September 21, 2018, we issued an aggregate of 169,625 shares of 5.75% Non-Cumulative Preferred Stock,\nSeries DD, $1 par\nvalue, with a liquidation preference of $10,000 per share (the \u0093Series DD Preferred Stock\u0094). Shares of the\nSeries DD Preferred Stock are represented by depositary shares, each representing a 1/400th interest in a\nshare of preferred stock\nof the series.\n\nDividends.Dividends on the Series DD Preferred Stock are payable when, as, and if declared by\nour board of directors or a duly authorized committee of our board, at a rate of 5.75% per annum, payable\nquarterly in arrears, on March 1, June 1, September 1 and December 1 of each year, beginning on December 1,\n2018. Dividends on the Series DD\nPreferred Stock are neither mandatory nor cumulative.\n\nRedemption.The Series DD Preferred Stock may be redeemed\non any dividend payment date on or after December 1, 2023, in whole or from time to time in part, at a\nredemption price equal to $10,000 per share (equivalent to $25 per depositary share), plus any declared and\nunpaid dividends. We may also redeem\nthe Series DD Preferred Stock following the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n6.00% Non-Cumulative Preferred Stock, Series EE\n\nOn January 24, 2019, we issued an aggregate of 185,000 shares of 6.00% Non-Cumulative\nPreferred Stock, Series EE, $1 par value, with a liquidation preference of $10,000 per share (the \u0093Series EE\nPreferred Stock\u0094). Shares of the Series EE Preferred Stock are represented by depositary shares, each\nrepresenting a 1/400th\ninterest in a share of preferred stock of the series.\n\nDividends.Dividends on the Series EE Preferred Stock are\npayable when, as, and if declared by our board of directors or a duly authorized committee of our board, at\na rate of 6.00% per annum, payable quarterly in arrears, on March 1, June 1, September 1 and December 1 of\neach year, beginning on June 1,\n2019. Dividends on the Series EE Preferred Stock are neither mandatory nor cumulative.\n\nRedemption.The Series\nEE Preferred Stock may be redeemed on any dividend payment date on or after March 1, 2024, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent to $25 per depositary\nshare), plus any declared and unpaid\ndividends. We may also redeem the Series EE Preferred Stock following the occurrence of a \u0093capital treatment\nevent,\u0094 as described above.\n\n4.75% Non-Cumulative Preferred Stock, Series GG\n\nOn November 7, 2019, we issued an aggregate of 90,000 shares of 4.75% Non-Cumulative Preferred Stock, Series\nGG, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series GG Preferred Stock\u0094). Shares of the Series GG\nPreferred Stock are represented by depositary shares, each representing a 1/400th interest in a share of\npreferred stock of the series.\n\nDividends. Dividends on the Series GG Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a duly\nauthorized committee of our board, at a rate of 4.75% per annum, payable quarterly in arrears, on March 1,\nJune 1, September 1 and December 1 of each year, beginning on March 1, 2020. Dividends on the Series GG\nPreferred Stock are neither mandatory\nnor cumulative.\n\nRedemption. The Series GG Preferred Stock may be redeemed on any dividend payment date on or after December\n1,\n2024, in whole or from time to time in part, at a redemption price equal to $10,000 per share\n\n28\n\n(equivalent to $25 per depositary share), plus any declared and unpaid dividends. We may also redeem the\nSeries GG Preferred Stock following the occurrence of a \u0093capital treatment\nevent,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series II\n\nOn February 24, 2020, we issued an aggregate of 150,000 shares of Fixed-to-Floating Rate Non-Cumulative\nPreferred Stock, Series II, $1 par\nvalue, with a liquidation preference of $10,000 per share (the \u0093Series II Preferred Stock\u0094). Shares of the\nSeries II Preferred Stock are represented by depositary shares, each representing a one-tenth interest in a\nshare of preferred stock\nof the series.\n\nDividends. Dividends on the Series II Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a duly authorized committee of our board, from the date of issuance to, but excluding, April 1,\n2025 at a rate of 4.00% per annum, payable semi-annually in arrears on April 1 and October 1 of each year,\nbeginning on October 1, 2020.\nFrom and including April 1, 2025, dividends will be paid when, as, and if declared by our board or such\ncommittee at a floating rate equal to a benchmark rate (which is expected to be Three-Month Term SOFR) plus\na spread of 2.745% per annum, payable\nquarterly in arrears, on January 1, April 1, July 1 and October 1of each year, beginning on July 1, 2025.\nDividends on the Series II Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series II Preferred Stock may be redeemed on any dividend payment date on or after April 1,\n2025, in whole or from time\nto time in part, at a redemption price equal to $10,000 per share (equivalent to $1,000 per depositary\nshare), plus any declared and unpaid dividends. We may also redeem the Series II Preferred Stock following\nthe occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n4.55% Non-Cumulative Preferred Stock, Series JJ\n\nOn March 17, 2021, we issued an aggregate of 150,000 shares of 4.55% Non-Cumulative Preferred Stock, Series\nJJ, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series JJ Preferred Stock\u0094). Shares of the Series JJ\nPreferred Stock are represented by depositary shares, each representing a 1/400th interest in a share of\npreferred stock of the series.\n\nDividends. Dividends on the Series JJ Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a duly\nauthorized committee of our board, at a rate of 4.55% per annum, payable quarterly in arrears, on March 1,\nJune 1, September 1 and December 1 of each year, beginning on June 1, 2021. Dividends on the Series JJ\nPreferred Stock are neither mandatory\nnor cumulative.\n\nRedemption. The Series JJ Preferred Stock may be redeemed on any dividend payment date on or after June 1,\n2026,\nin whole at any time or from time to time in part, at a redemption price equal to $10,000 per share\n(equivalent to $25 per depositary share), plus any declared and unpaid dividends. We may also redeem the\nSeries JJ Preferred Stock following the\noccurrence of a \u0093capital treatment event,\u0094 as described above.\n\n3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK\n\nOn May 12, 2021, we issued an aggregate of 200,000 shares of 3.65% Fixed-Rate Reset Non-Cumulative Preferred\nStock,\nSeries KK, $1 par value, with a liquidation preference of $10,000 per share (the \u0093Series KK Preferred\nStock\u0094). Shares of the Series KK Preferred Stock are represented by depositary shares, each representing a\none-tenth interest in a share\nof preferred stock of the series.\n\nDividends. Dividends on the Series KK Preferred Stock are payable when, as, and if declared by\nour board of directors or a duly authorized committee of our board, quarterly in arrears, on March 1, June\n1, September 1 and December 1 of each year, beginning on September 1, 2021. From the date of issuance to,\nbut excluding, June 1, 2026,\ndividends will accrue at a rate equal to 3.65% per annum, and thereafter, for each reset period, at a\n\n29\n\nrate equal to a five-year treasury rate as of the most recent reset dividend determination date plus a\nspread of 2.85% per annum. Dividends on the Series KK Preferred Stock are neither mandatory\nnor cumulative.\n\nRedemption. The Series KK Preferred Stock may be redeemed on any dividend payment date on or after June 1,\n2026,\nin whole at any time or from time to time in part, at a redemption price equal to $10,000 per share\n(equivalent to $1,000 per depositary share), plus any declared and unpaid dividends. We may also redeem the\nSeries KK Preferred Stock following the\noccurrence of a \u0093capital treatment event,\u0094 as described above.\n\n4.625% Non-Cumulative Preferred Stock, Series LL\n\nOn May 20, 2021, we issued an aggregate of 185,000 shares of 4.625% Non-Cumulative Preferred Stock, Series\nLL, $1 par value, with\na liquidation preference of $10,000 per share (the \u0093Series LL Preferred Stock\u0094). Shares of the Series LL\nPreferred Stock are represented by depositary shares, each representing a 1/400th interest in a share of\npreferred stock of the\nseries.\n\nDividends. Dividends on the Series LL Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a\nduly authorized committee of our board, at a rate of 4.625% per annum, payable quarterly in arrears, on\nMarch 1, June 1, September 1 and December 1 of each year, beginning on September 1, 2021. Dividends on the\nSeries LL Preferred Stock are neither\nmandatory nor cumulative.\n\nRedemption. The Series LL Preferred Stock may be redeemed on any dividend payment date on or after June\n1, 2026, in whole at any time or from time to time in part, at a redemption price equal to $10,000 per share\n(equivalent to $25 per depositary share), plus any declared and unpaid dividends. We may also redeem the\nSeries LL Preferred Stock following\nthe occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n4.20% Non-Cumulative Preferred Stock, Series MM\n\nOn July 29, 2021, we issued an aggregate of 200,000 shares of 4.20% Non-Cumulative Preferred Stock, Series\nMM, $1 par value, with\na liquidation preference of $10,000 per share (the \u0093Series MM Preferred Stock\u0094). Shares of the Series MM\nPreferred Stock are represented by depositary shares, each representing a 1/400th interest in a share of\npreferred stock of the\nseries.\n\nDividends. Dividends on the Series MM Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a\nduly authorized committee of our board, at a rate of 4.20% per annum, payable quarterly in arrears, on March\n1, June 1, September 1 and December 1 of each year, beginning on December 1, 2021. Dividends on the Series\nMM Preferred Stock are neither\nmandatory nor cumulative.\n\nRedemption. The Series MM Preferred Stock may be redeemed on any dividend payment date on or after\nSeptember 1, 2026, in whole at any time or from time to time in part, at a redemption price equal to $10,000\nper share (equivalent to $25 per depositary share), plus any declared and unpaid dividends. We may also\nredeem the Series MM Preferred Stock\nfollowing the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n6.875% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series NN\n\nOn March 12, 2024, we issued an aggregate of 250,000 shares of 6.875% Fixed-Rate Reset Non-Cumulative\nPreferred Stock, Series NN, $1 par value, with a liquidation preference of $10,000 per share (the \u0093Series NN\nPreferred Stock\u0094). Shares of the Series NN Preferred Stock are represented by depositary shares, each\nrepresenting a one-tenth\ninterest in a share of preferred stock of the series.\n\nDividends.Dividends on the Series NN Preferred Stock are payable when, as,\nand if declared by our board of directors or a duly authorized committee of our board, quarterly in arrears,\non March 1, June 1, September 1 and December 1 of each year, beginning on June 1, 2024. From the date of\nissuance to, but excluding, June 1,\n2029,\n\n30\n\ndividends will accrue at a rate equal to 6.875% per annum, and thereafter, for each reset period, at a rate\nequal to a five-year treasury rate as of the most recent reset dividend determination\ndate plus a spread of 2.737% per annum. Dividends on the Series NN Preferred Stock are neither mandatory nor\ncumulative.\n\nRedemption.The Series NN Preferred Stock may be redeemed on any dividend payment date on or after June 1,\n2029, in whole at any time or from time to time in part, at a redemption price equal to $10,000 per share\n(equivalent to $1,000 per depositary share),\nplus any declared and unpaid dividends. We may also redeem the Series NN Preferred Stock following the\noccurrence of a \u0093capital treatment event,\u0094 as described above.\n\n6.500% Fixed-Rate Reset Non-CumulativePreferred Stock, Series OO\n\nOn February 4, 2025, we issued an aggregate of 300,000 shares of 6.500% Fixed-Rate Reset\nNon-Cumulative Preferred Stock, Series OO, $1 par value, with a liquidation preference of $10,000 per share\n(the \u0093Series OO Preferred Stock\u0094). Shares of the Series OO Preferred Stock are represented\nby depositary shares, each representing a one-tenth interest in a share of preferred stock of the series.\n\nDividends.Dividends on the Series OO Preferred Stock are payable when, as, and if declared by our board of\ndirectors or a duly\nauthorized committee of our board, quarterly in arrears, on January 1, April 1, July 1 and October 1 of each\nyear, beginning on April 1, 2025. From the date of issuance to, but excluding, April 1, 2030, dividends will\naccrue at a rate equal to 6.500% per annum, and thereafter, for each reset period, at a rate equal to a\nfive-year treasury rate as of the most recent reset dividend determination date plus a spread of 2.152% per\nannum. Dividends on the Series OO\nPreferred Stock are neither mandatory nor cumulative.\n\nRedemption.The Series OO Preferred Stock may be redeemed on any dividend\npayment date on or after April 1, 2030, in whole at any time or from time to time in part, at a redemption\nprice equal to $10,000 per share (equivalent to $1,000 per depositary share), plus any declared and unpaid\ndividends. We may also redeem\nthe Series OO Preferred Stock following the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n31\n\nDESCRIPTION OF DEPOSITARY SHARES\n\nGeneral.We may, at our option, elect to offer depositary shares representing fractional interests in shares\nof preferred stock. If we\ndo, we will arrange the issuance by a depositary of receipts for depositary shares, and each of those\ndepositary shares will represent a fractional interest in a share of a particular series of preferred stock.\nWe will specify that fractional\ninterest in the applicable prospectus supplement.\n\nThe shares of any series of preferred stock underlying the depositary shares offered by\nuse of this prospectus and an applicable prospectus supplement will be deposited under a deposit agreement\nbetween us and a depositary selected by us. Subject to the terms of the deposit agreement, each owner of a\ndepositary share will be entitled,\nin proportion to the applicable fractional interest in the share of preferred stock underlying that\ndepositary share, to all the powers, preferences and rights of the preferred stock underlying that\ndepositary share, in proportion to the applicable\nfractional interest in a share of the preferred stock which those depositary shares represent. Those rights\ninclude dividend, voting, redemption, conversion and liquidation rights.\n\nThe depositary shares offered by use of this prospectus and an applicable prospectus supplement will be\nevidenced by depositary receipts\nissued under the deposit agreement. The depositary will issue depositary receipts to those persons who\npurchase the fractional interests in the preferred stock underlying the depositary shares, in accordance\nwith the terms of the offering. The\nfollowing summary of the deposit agreement, the depositary shares and the depositary receipts is not\ncomplete. You should refer to the forms of the deposit agreement and depositary receipts that are filed as\nexhibits to the registration statement.\n\nDividends and Other Distributions. The depositary will distribute all cash dividends or other cash\ndistributions received in\nrespect of the preferred stock to the record holders of related depositary receipts in proportion to the\nnumber of depositary shares owned by those holders.\n\nIf we make a distribution other than in cash, the depositary will distribute property received by it to the\nrecord holders of depositary\nreceipts that are entitled to receive the distribution as nearly as practicable in proportion to the number\nof depositary shares held by each holder, unless the depositary determines that it is not feasible to make\nthe distribution. If this occurs,\nthe depositary may, with our approval, adopt a method of distribution that it deems practicable, including\nthe sale of the property and distribution of the net proceeds from the sale to the applicable holders of the\ndepositary receipts.\n\nRedemption of Depositary Shares. Upon redemption, in whole or in part, of shares of any series of preferred\nstock that are held by the\ndepositary, the depositary will redeem, as of the same redemption date, the number of depositary shares\nrepresenting the shares of preferred stock so redeemed. The redemption price per depositary share will be\nequal to the applicable fraction of the\nredemption price per share payable with respect to that series of the preferred stock.\n\nDepositary shares called for redemption will no\nlonger be outstanding after the applicable redemption date, and all rights of the holders of those\ndepositary shares will cease, except the right to receive any money, securities, or other property upon\nsurrender to the depositary of the depositary\nreceipts evidencing those depositary shares.\n\nVoting the Preferred Stock. Upon receipt of notice of any meeting at which the\nholders of preferred stock are entitled to vote, the depositary will mail the information contained in the\nnotice of meeting to the record holders of the depositary shares representing that preferred stock. Each\nrecord holder of those depositary\nshares on the record date, which will be the same date as the record date for the preferred stock, will be\nentitled to instruct the depositary as to the exercise of the voting rights pertaining to the amount of the\npreferred stock underlying that\nholder\u0092s depositary shares. The depositary will try, to the extent practicable, to vote the number of shares\nof preferred stock underlying those depositary shares in accordance with those instructions, and we will\nagree to take all action that\nthe depositary deems necessary in order to enable the depositary to do so. The depositary will not vote the\nshares of preferred stock to the extent it does not receive specific instructions from the holders of\ndepositary shares representing the\npreferred stock.\n\n32\n\nAmendment and Termination of the Deposit Agreement. We and the depositary may amend the\nform of depositary receipt evidencing the depositary shares and any provision of the deposit agreement at\nany time regarding any depositary shares offered by use of this prospectus and an applicable prospectus\nsupplement. However, any amendment that\nmaterially and adversely alters the rights of the holders of depositary shares or would be materially and\nadversely inconsistent with the rights granted to holders of the underlying preferred stock pursuant to our\ncertificate of incorporation will\nnot be effective unless the amendment has been approved by the holders of at least a majority of the\ndepositary shares then outstanding. The deposit agreement may be terminated by us or by the depositary only\nif:\n                                                                \n      all outstanding depositary shares have been redeemed; or  \n                                                                \n                                                                                                            \n      there has been a final distribution of the underlying preferred stock in connection with our          \n      liquidation,                                                                                          \n      dissolution or winding up and the preferred stock has been distributed to the holders of depositary   \n      receipts.                                                                                             \n                                                                                                            \nCharges of Depositary. We will pay all transfer and other taxes and governmental charges arising solely from\nthe existence of the\ndepositary arrangements regarding any depositary shares offered by use of this prospectus and an applicable\nprospectus supplement. We will also pay charges of the depositary in connection with the initial deposit of\nthe preferred stock and any\nredemption of the preferred stock. Holders of depositary receipts will pay transfer and other taxes and\ngovernmental charges and other charges with respect to their depositary receipts as expressly provided in\nthe deposit agreement.\n\nResignation and Removal of Depositary. The depositary for the depositary shares offered by use of this\nprospectus and an applicable\nprospectus supplement may resign at any time by delivering a notice to us of its election to do so. We may\nremove the depositary at any time. Any such resignation or removal will take effect upon the appointment of\na successor depositary and its\nacceptance of its appointment. We must appoint a successor depositary within 60 days after delivery of the\nnotice of resignation or removal.\n\nMiscellaneous. The depositary will forward to holders of depositary receipts all reports and communications\nfrom us that we deliver to\nthe depositary and that we are required to furnish to the holders of the preferred stock.\n\nNeither we nor the depositary will be liable if\neither of us is prevented or delayed by law or any circumstance beyond our control in performing our\nrespective obligations under the deposit agreement. Our obligations and those of the depositary will be\nlimited to performing in good faith our\nrespective duties under the deposit agreement. Neither we nor the depositary will be obligated to prosecute\nor defend any legal proceeding relating to any depositary shares or preferred stock unless satisfactory\nindemnity is furnished. We and the\ndepositary may rely upon written advice of counsel or accountants, or upon information provided by persons\npresenting preferred stock for deposit, holders of depositary receipts or other persons we believe to be\ncompetent, and on documents we\nbelieve to be genuine.\n\nDESCRIPTION OF COMMON STOCK\n\nAs of the date of this prospectus, we are authorized to issue up to 9,000,000,000 shares of common stock. As\nof December 31, 2024, we had\n2,797,620,401 shares of common stock issued and outstanding (which excludes 1,307,313,494 shares held in\ntreasury).\n\nThe following summary\nis not complete. You should refer to the applicable provisions of our certificate of incorporation and to\nthe DGCL for a complete statement of the terms and rights of our common stock.\n\nDividends. Holders of common stock are entitled to receive dividends if, as and when declared by our board\nof directors out of funds\nlegally available for payment, subject to the rights of holders of our preferred stock.\n\n33\n\nVoting Rights. Each holder of common stock is entitled to one vote per share. Subject to\nthe rights, if any, of the holders of any series of preferred stock under its applicable certificate of\ndesignations and applicable law, all voting rights are vested in the holders of shares of our common stock.\nHolders of shares of our common stock\nhave noncumulative voting rights, which means that the holders of more than 50% of the shares voting for the\nelection of directors can elect 100% of the directors and the holders of the remaining shares will not be\nable to elect any directors.\n\nRights Upon Liquidation. In the event of our voluntary or involuntary liquidation, dissolution or winding-\nup, the holders of our common\nstock will be entitled to share equally in any of our assets available for distribution after we have paid\nin full all of our debts and after the holders of all series of our outstanding preferred stock have\nreceived their liquidation preferences in\nfull.\n\nMiscellaneous. The issued and outstanding shares of common stock are fully paid and nonassessable. Holders\nof shares of our\ncommon stock are not entitled to preemptive rights or to the benefit of any sinking funds. Our common stock\nis not convertible into shares of any other class of our capital stock. Computershare Inc is the transfer\nagent, registrar and dividend\ndisbursement agent for our common stock.\n\nDESCRIPTION OF WARRANTS\n\nWe may issue warrants for the purchase of debt securities, preferred stock or common stock. We may issue\nwarrants independently or together\nwith debt securities, preferred stock, common stock or other securities, other property or any combination\nof those securities in the form of units. Each series of warrants will be issued under a separate warrant\nagreement to be entered into between\nus and a bank or trust company (which may be the Bank), as warrant agent. The warrant agent will act solely\nas our agent under the applicable warrant agreement and will not assume any obligation to, or relationship\nof agency or trust for or with,\nany registered holders or beneficial owners of warrants. This summary of certain provisions of the warrants\nand the warrant agreement is not complete. You should refer to the warrant agreement relating to the\nspecific warrants being offered,\nincluding the forms of warrant certificates representing those warrants, for the complete terms of the\nwarrant agreement and the warrants. Forms of those documents are filed as exhibits to the registration\nstatement.\n\nEach warrant will entitle the holder to purchase the principal amount of debt securities or the number of\nshares of preferred stock or common\nstock at the exercise price set forth in, or calculable as set forth in, the applicable prospectus\nsupplement. The exercise price may be subject to adjustment upon the occurrence of certain events, as set\nforth in the prospectus supplement. We will\nalso specify in the prospectus supplement the place or places where, and the manner in which, warrants may\nbe exercised. After the close of business on the expiration date of the warrants, unexercised warrants will\nbecome void.\n\nPrior to the exercise of any warrants, holders of the warrants will not have any of the rights of holders of\nthe debt securities, preferred\nstock or common stock, as the case may be, that may be purchased upon exercise of those warrants, including,\n(1) in the case of warrants for the purchase of debt securities, the right to receive payments of principal\nof, and premium, if any, or\ninterest, if any, on those debt securities or to enforce covenants in the senior indenture or subordinated\nindenture, as the case may be, or (2) in the case of warrants for the purchase of preferred stock or common\nstock, the right to receive\npayments of dividends, if any, on that preferred stock or common stock or to exercise any applicable right\nto vote.\n\n34\n\nDESCRIPTION OF UNITS\n\nWemay issue units that will consist of any combination of debt securities, preferred stock, common stock and\nwarrants issued by us,\ndepositary shares representing preferred stock issued by us, debt obligations or other securities of an\nentity affiliated or not affiliated with us or other property. We may issue units in one or more series,\nwhich will be described in the\napplicable prospectus supplement. Each series of units will be issued under a separate unit agreement to be\nentered into between us and a bank or trust company (which may be the Bank), as unit agent. The below\nsummary of certain provisions of the\nunits and unit agreements is not complete. You should refer to the unit agreement for the complete terms of\nthe unit agreement and the units. Forms of those documents will be filed as exhibits to or incorporated by\nreference in the registration\nstatement.\n\nUnless otherwise specified in the applicable prospectus supplement, each unit will be issued so that the\nholder of the unit is\nalso the holder of each security included in the unit. Thus, the holder of a unit will have the rights and\nobligations of a holder of each included security. The unit agreement under which a unit is issued may\nprovide that the securities included in\nthe unit may not be held or transferred separately, at any time or at any time before a specified date. We\nwill describe the particular terms of any series of units being offered in the prospectus supplement\nrelating to that series of units. Those\nterms may include:\n                                                                                                            \n      the designation and the terms of the units and any combination of debt securities, preferred stock,   \n      common stock                                                                                          \n      and warrants issued by us, depositary shares representing preferred stock issued by us, debt          \n      obligations or other securities of an entity affiliated or not affiliated with us or other property   \n      constituting the units, including and whether and under                                               \n      what circumstances the debt securities, preferred stock, common stock and warrants issued by us,      \n      depositary shares representing preferred stock issued by us, debt obligations or other securities of  \n      an entity affiliated or not affiliated with us or                                                     \n      other securities may be traded separately;                                                            \n                                                                                                            \n                                                             \n      any additional terms of the governing unit agreement;  \n                                                             \n                                                                                                            \n      any additional provisions for the issuance, payment, settlement, transfer or exchange of the units    \n      or of the debt                                                                                        \n      securities, preferred stock, common stock and warrants issued by us, depositary shares representing   \n      preferred stock issued by us, debt obligations or other securities of an entity affiliated or not     \n      affiliated with us or other property constituting                                                     \n      the units; and                                                                                        \n                                                                                                            \n                                                            \n      any applicable U.S. federal income tax consequences.  \n                                                            \nThe terms and conditions described under \u0093Description of Debt Securities,\u0094 \u0093Description of Preferred Stock,\u0094\n\u0093Description of Common Stock\u0094 and \u0093Description of Warrants\u0094 will apply to each unit and to any debt\nsecurities, preferred stock, common stock or warrants issued by us, depositary shares representing preferred\nstock issued by us,\ndebt obligations or other securities of an entity affiliated or not affiliated with us or other property\nincluded in each unit, unless otherwise specified in the applicable prospectus supplement.\n\nAn investment in units may involve special risks, including risks associated with indexed securities and\ncurrency-related risks if the\nsecurities comprising the units are linked to an index or are payable in or otherwise linked to a non-U.S.\ndollar currency.\n\n35\n\nBOOK-ENTRY ISSUANCE\n\nWe may issue series of any securities as global securities and deposit them with a depositary with respect\nto that series for settlement and\nclearance through a book-entry settlement system, as indicated in the applicable prospectus supplement. The\nfollowing is a summary of the depositary arrangements applicable to securities issued in permanent global\nform and for which The Depository\nTrust Company (\u0093DTC\u0094) will act as depositary (the \u0093global securities\u0094).\n\nEach global security will be deposited with,\nor on behalf of, DTC, as depositary, or its nominee and registered in the name of a nominee of DTC. Except\nunder the limited circumstances described below, global securities will not be exchangeable for certificated\nsecurities.\n\nOnly institutions that have accounts with DTC or its nominee (\u0093DTC participants\u0094) or persons that may hold\ninterests through DTC\nparticipants may own beneficial interests in a global security. DTC will maintain records evidencing\nownership of beneficial interests by DTC participants in the global securities and transfers of those\nownership interests. DTC participants will\nmaintain records evidencing ownership of beneficial interests in the global securities by persons that hold\nthrough those DTC participants and transfers of those ownership interests within those DTC participants. DTC\nhas no knowledge of the actual\nbeneficial owners of the securities. You will not receive written confirmation from DTC of your purchase,\nbut we do expect that you will receive written confirmations providing details of the transaction, as well\nas periodic statements of your\nholdings, from the DTC participant through which you entered the transaction. The laws of some jurisdictions\nrequire that certain purchasers of securities take physical delivery of those securities in certificated\nform. Those laws may impair your\nability to transfer beneficial interests in a global security.\n\nDTC has advised us that upon the issuance of a global security and the\ndeposit of that global security with DTC, DTC will immediately credit, on its book-entry registration and\ntransfer system, the respective principal amounts or number of shares represented by that global security to\nthe accounts of DTC participants.\n\nWe will make payments on securities represented by a global security to DTC or its nominee, as the case may\nbe, as the registered owner\nand holder of the global security representing those securities. DTC has advised us that upon receipt of any\npayment on a global security, DTC will immediately credit accounts of DTC participants with payments in\namounts proportionate to their\nrespective beneficial interests in that security, as shown in the records of DTC. Standing instructions and\ncustomary practices will govern payments by DTC participants to owners of beneficial interests in a global\nsecurity held through those DTC\nparticipants, as is now the case with securities held for the accounts of customers in bearer form or\nregistered in \u0093street name.\u0094 Those payments will be the sole responsibility of those DTC participants,\nsubject to any statutory or\nregulatory requirements in effect from time to time.\n\nNone of JPMorganChase, the trustees, the depositary or any of our respective agents\nwill have any responsibility or liability for any aspect of the records of DTC, any nominee or any DTC\nparticipant relating to, or payments made on account of, beneficial interests in a global security or for\nmaintaining, supervising or reviewing\nany of the records of DTC, any nominee or any DTC participant relating to those beneficial interests.\n\nA global security is exchangeable\nfor certificated securities registered in the name of a person other than DTC or its nominee only if:\n                                                                                                            \n      DTC notifies us that it is unwilling or unable to continue as depositary for that global security or  \n      DTC ceases                                                                                            \n      to be registered under the Securities Exchange Act of 1934;                                           \n                                                                                                            \n                                                                                                            \n      we determine in our discretion that the global security will be exchangeable for certificated         \n      securities in                                                                                         \n      registered form; or                                                                                   \n                                                                                                            \n                                                                                                            \n      if applicable to the particular type of security, there shall have occurred and be continuing an      \n      event of default                                                                                      \n      or an event which, with notice or the lapse of time or both, would constitute an event of default     \n      under the securities.                                                                                 \n                                                                                                            \n36\n\nAny global security that is exchangeable as described in the preceding sentence will be\nexchangeable in whole for certificated securities in registered form, and, in the case of global debt\nsecurities, of like tenor and of an equal aggregate principal amount as the global security, in\ndenominations of $1,000 and integral multiples of\n$1,000 (or in denominations and integral multiples as otherwise specified in the applicable prospectus\nsupplement). The registrar for the securities will register the certificated securities in the name or names\ninstructed by DTC. We expect that\nthose instructions may be based upon directions received by DTC from DTC participants with respect to\nownership of beneficial interests in the global security. In the case of global debt securities, we will\nmake payment of any principal and interest\non the certificated securities and will register transfers and exchanges of those certificated securities at\nthe corporate trust office of The Bank of New York Mellon or any successor paying agent that we may\ndesignate. However, we may elect to pay\ninterest by check mailed to the address of the person entitled to that interest payment as of the record\ndate, as shown on the register for the securities.\n\nExcept as provided above, as an owner of a beneficial interest in a global security, you will not be\nentitled to receive physical delivery of\nsecurities in certificated form and will not be considered a holder of securities for any purpose under\neither of the indentures. No global security will be exchangeable except for another global security of like\ndenomination and tenor to be\nregistered in the name of DTC or its nominee. Accordingly, you must rely on the procedures of DTC and the\nDTC participant through which you own your interest to exercise any rights of a holder under the global\nsecurity or the applicable indenture.\n\nWe understand that, under existing industry practices, in the event that we request any action of holders,\nor an owner of a beneficial\ninterest in a global security desires to take any action that a holder is entitled to take under the\nsecurities or the indentures, DTC would authorize the DTC participants holding the relevant beneficial\ninterests to take that action, and those DTC\nparticipants would authorize beneficial owners owning through those DTC participants to take that action or\nwould otherwise act upon the instructions of beneficial owners owning through them.\n\nDTC has advised us that DTC is a limited purpose trust company organized under the New York Banking Law, a\n\u0093banking organization\u0094\nwithin the meaning of the New York Banking Law, a member of the Federal Reserve System, a \u0093clearing\ncorporation\u0094 within the meaning of the New York Uniform Commercial Code and a \u0093clearing agency\u0094 registered\nunder the Securities\nExchange Act of 1934.\n\nIf specified in the applicable prospectus supplement, investors may elect to hold interests in the global\nsecurities deposited with DTC outside the United States through Clearstream Banking, S.A. (\u0093Clearstream\u0094) or\nEuroclear Bank SA/NV, as operator of the Euroclear System (\u0093Euroclear\u0094), if they are participants in those\nsystems, or\nindirectly through organizations that are participants in those systems. Clearstream and Euroclear will hold\ninterests on behalf of their participants through customers\u0092 securities accounts in Clearstream\u0092s and\nEuroclear\u0092s names on\nthe books of their respective depositaries. Those depositaries in turn hold those interests in customers\u0092\nsecurities accounts in the depositaries\u0092 names on the books of DTC. Unless otherwise specified in the\nprospectus supplement, The Bank\nof New York Mellon will act as depositary for each of Clearstream and Euroclear in the case of global debt\nsecurities.\n\nClearstream has\nadvised us that it is incorporated under the laws of Luxembourg as a professional depositary. Clearstream\nholds securities for its participants and facilitates the clearance and settlement of securities\ntransactions between its participants through\nelectronic book-entry transfers between their accounts. Clearstream provides its participants with, among\nother things, services for safekeeping, administration, clearance and settlement of internationally traded\nsecurities and securities lending\nand borrowing. Clearstream interfaces with domestic securities markets in several countries through\nestablished depository and custodial relationships. As a professional depositary, Clearstream is subject to\nregulation by the Luxembourg Commission\nfor the Supervision of the Financial Sector, also known as the Commission de Surveillance du Secteur\nFinancier. Clearstream participants are recognized financial institutions around the world, including\nunderwriters, securities brokers and\ndealers, banks, trust companies, clearing corporations and other organizations. Clearstream\u0092s participants\nin the United States are limited to securities brokers and dealers and banks. Indirect access to Clearstream\nis also available to other\ninstitutions such as banks, brokers, dealers and trust companies that clear through or maintain a custodial\nrelationship with Clearstream participants.\n\n37\n\nDistributions with respect to interests in global securities held through Clearstream will be\ncredited to cash accounts of its customers in accordance with its rules and procedures, to the extent\nreceived by the U.S. depositary for Clearstream.\n\nEuroclear has advised us that it was created in 1968 to hold securities for its participants and to clear\nand settle transactions between\nEuroclear participants through simultaneous electronic book-entry delivery against payment, thereby\neliminating the need for physical movement of certificates and any risk from lack of simultaneous transfers\nof securities and cash. Euroclear\nprovides various other services, including securities lending and borrowing, and interfaces with domestic\nmarkets in several countries. Euroclear is operated by Euroclear Bank SA/NV under contract with Euroclear\nplc, a U.K. corporation. Euroclear\nparticipants include banks, including central banks, securities brokers and dealers and other professional\nfinancial intermediaries. Indirect access to Euroclear is also available to other firms that clear through\nor maintain a custodial\nrelationship with a Euroclear participant, either directly or indirectly.\n\nDistributions with respect to interests in global securities\nheld beneficially through Euroclear will be credited to the cash accounts of Euroclear participants in\naccordance with Euroclear\u0092s terms and conditions and operating procedures and applicable Belgian law, to the\nextent received by the U.S.\ndepositary for Euroclear.\n\nGlobal Clearance and Settlement Procedures\n\nUnless otherwise specified in a prospectus supplement with respect to a particular series of global\nsecurities, initial settlement for global\nsecurities will be made in immediately available funds. DTC participants will conduct secondary market\ntrading with other DTC participants in the ordinary way in accordance with DTC rules. Thereafter, secondary\nmarket trades will settle in\nimmediately available funds using DTC\u0092s same day funds settlement system.\n\nIf the prospectus supplement specifies that interests in\nthe global securities may be held through Clearstream or Euroclear, Clearstream customers and/or Euroclear\nparticipants will conduct secondary market trading with other Clearstream customers and/or Euroclear\nparticipants in the ordinary way in\naccordance with the applicable rules and operating procedures of Clearstream and Euroclear. Thereafter,\nsecondary market trades will settle in immediately available funds.\n\nCross-market transfers between persons holding directly or indirectly through DTC on the one hand, and\ndirectly or indirectly through\nClearstream customers or Euroclear participants, on the other, will be effected in DTC in accordance with\nDTC\u0092s rules on behalf of the relevant European international clearing system by the U.S. depositary for that\nsystem; however, those\ncross-market transactions will require delivery by the counterparty in the relevant European international\nclearing system of instructions to that system in accordance with its rules and procedures and within its\nestablished deadlines (European\ntime). The relevant European international clearing system will, if the transaction meets its settlement\nrequirements, deliver instructions to the U.S. depositary for that system to take action to effect final\nsettlement on its behalf by delivering\nor receiving interests in global securities in DTC, and making or receiving payment in accordance with\nnormal procedures for same-day funds settlement applicable to DTC. Clearstream customers and Euroclear\nparticipants may not deliver instructions\ndirectly to DTC.\n\nBecause of time-zone differences, credits of interests in global securities received in Clearstream or\nEuroclear as a\nresult of a transaction with a DTC participant will be made during subsequent securities settlement\nprocessing and will be credited the business day following the DTC settlement date. Those credits or any\ntransactions in global securities settled\nduring that processing will be reported to the relevant Euroclear participants or Clearstream customers on\nthat business day. Cash received in Clearstream or Euroclear as a result of sales of interests in global\nsecurities by or through a\nClearstream customer or a Euroclear participant to a DTC participant will be received with value on the DTC\nsettlement date but will be available in the relevant Clearstream or Euroclear cash account only as of the\nbusiness day following settlement\nin DTC.\n\nAlthough DTC, Clearstream and Euroclear have agreed to the procedures described above in order to facilitate\ntransfers of\ninterests in global securities among DTC participants, Clearstream and Euroclear, they are under no\nobligation to perform those procedures and those procedures may be discontinued at any time.\n\n38\n\nSpecial Provisions Relating to Certain Foreign Currency Securities\n\nIf specified in the applicable prospectus supplement, book-entry securities denominated in currencies other\nthan U.S. dollars may be held\ndirectly through participants in the systems of Clearstream or Euroclear, or indirectly through\norganizations that are participants in such systems. Such securities will be issued in the form of one or\nmore global certificates (the\n\u0093international global securities\u0094), which will be registered in the name of a nominee for, and shall be\ndeposited with, a common depositary for Clearstream and/or Euroclear. If a particular tranche or series of\nsecurities is issued\nutilizing both a global security and an international global security, in order to allow transfers between\naccount holders utilizing the different book-entry systems the registrar will adjust the amounts of the\nglobal securities on the register for\nthe accounts of the nominees for the respective systems.\n\nUnless otherwise specified in the applicable prospectus supplement, with\nrespect to an international global security, distributions of principal and interest for a global debt\nsecurity and dividends for a global equity security will be credited, in the specified currency, to the\nextent received by Clearstream or\nEuroclear, to the cash accounts of Clearstream or Euroclear customers in accordance with the relevant\nsystem\u0092s rules and procedures. If the prospectus supplement provides for both a global security and an\ninternational global security or if a\nbeneficial interest in a global security is held by a participant in Clearstream or Euroclear, then a holder\nof a beneficial interest in a global security will receive all payments in U.S. dollars in accordance with\nDTC\u0092s rules and procedures,\nunless it has, or participants through which it holds its beneficial interest have, made other arrangements.\n\nRelationship of Accountholders with Clearing Systems\n\nUnless otherwise specified in the applicable prospectus supplement, each of the persons shown in the records\nof\nClearstream, Euroclear or any other clearing system as the holder of the securities represented by the\nglobal securities must look solely to Clearstream or Euroclear for such holder\u0092s share of each payment made\nby or on behalf of JPMorganChase\nto Clearstream or Euroclear, and in relation to all other rights arising under the global securities,\nsubject to and in accordance with the respective rules and procedures of Clearstream or Euroclear. Such\npersons shall have no claim directly\nagainst JPMorganChase in respect of payments due on the securities for so long as the securities are\nrepresented by global securities and such obligations of JPMorganChase will be discharged by payment to\nClearstream or Euroclear in respect of each\namount so paid.\n\n39\n\nPLAN OF DISTRIBUTION\n\nWe may sell the debt securities, preferred stock, depositary shares, common stock, warrants or units being\noffered by use of this prospectus\nand an applicable prospectus supplement:\n                             \n      through underwriters;  \n                             \n                        \n      through dealers;  \n                        \n                          \n      through agents; or  \n                          \n                               \n      directly to purchasers.  \n                               \nWe will set forth the terms of the offering of any securities being offered in the applicable prospectus\nsupplement.\n\nIf we utilize underwriters in an offering of securities using this prospectus, we will execute an\nunderwriting agreement with those\nunderwriters. The underwriting agreement will provide that the obligations of the underwriters with respect\nto a sale of the offered securities are subject to certain conditions precedent and that the underwriters\nwill be obligated to purchase all\nthe offered securities if any of them are purchased, other than securities subject to an underwriter\u0092s\noverallotment option. Underwriters may sell those securities to or through dealers. The underwriters may\nchange any initial public offering\nprice and any discounts or concessions allowed or reallowed or paid to dealers from time to time. If we\nutilize underwriters in an offering of securities using this prospectus, the applicable prospectus\nsupplement will contain a statement regarding\nthe intention, if any, of the underwriters to make a market in the offered securities.\n\nIf we utilize a dealer in an offering of\nsecurities using this prospectus, we will sell the offered securities to the dealer, as principal. The\ndealer may then resell those securities to the public at a fixed price or at varying prices to be determined\nby the dealer at the time of resale.\n\nWe may also use this prospectus to offer and sell securities through agents designated by us from time to\ntime. Unless otherwise\nindicated in the prospectus supplement, any agent will be acting on a reasonable efforts basis for the\nperiod of its appointment.\n\nUnderwriters, dealers or agents participating in a distribution of securities by use of this prospectus and\nan applicable prospectus\nsupplement may be deemed to be underwriters, and any discounts and commissions received by them and any\nprofit realized by them on resale of the offered securities, whether received from us or from purchasers of\noffered securities for whom they act\nas agent, may be deemed to be underwriting discounts and commissions under the Securities Act of 1933.\n\nUnder agreements that we may enter\ninto, underwriters, dealers or agents who participate in the distribution of securities by use of this\nprospectus and an applicable prospectus supplement may be entitled to indemnification by us against certain\nliabilities, including liabilities\nunder the Securities Act of 1933, or to contribution with respect to payments that those underwriters,\ndealers or agents may be required to make.\n\nWe may offer to sell securities either at a fixed price or at prices that may be changed, at market prices\nat the time of sale, at prices\nrelated to market prices or at negotiated prices.\n\nUnderwriters, dealers, agents or their affiliates may be customers of, engage in\ntransactions with, or perform services for, us and our subsidiaries in the ordinary course of business.\n\nOur affiliates, including J.P.\nMorgan Securities LLC, may use this prospectus and the applicable prospectus supplement in connection with\noffers and sales of securities in the secondary market. Those affiliates may act as principal or agent in\nthose transactions. Secondary market\nsales will be made at prices related to market prices at the time of sale.\n\n40\n\nWe may also use this prospectus to directly solicit offers to purchase securities. Except as set\nforth in the applicable prospectus supplement, none of our directors, officers, or employees nor those of\nour bank subsidiaries will solicit or receive a commission in connection with those direct sales. Those\npersons may respond to inquiries by\npotential purchasers and perform ministerial and clerical work in connection with direct sales.\n\nConflicts of Interest\n\nWe own directly or indirectly all the outstanding equity securities of J.P. Morgan Securities LLC. The\nunderwriting arrangements for any\noffering pursuant to this prospectus will comply with the requirements of Rule 5121 of the regulations of\nFINRA regarding a FINRA member firm\u0092s underwriting of securities of an affiliate. In accordance with Rule\n5121, J.P. Morgan Securities LLC\nmay not make sales pursuant to this prospectus to any discretionary account without the prior approval of\nthe customer.\n\nINDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n\nThe financial statements and management\u0092s assessment of the effectiveness of\ninternal control over financial reporting (which is included in Management\u0092s Report on Internal Control over\nFinancial Reporting) incorporated in this prospectus by reference to the Annual Report on Form 10-K of\nJPMorgan Chase & Co. for the\nyear ended December 31, 2024 have been so incorporated in reliance on the report of PricewaterhouseCoopers\nLLP, an independent registered public accounting firm, given on the authority of said firm as experts in\nauditing and accounting.\n\nLEGAL OPINIONS\n\nSimpson Thacher & Bartlett LLP, New York, New York, will provide an opinion for us regarding the validity of\nthe offered securities, and\nCravath, Swaine & Moore LLP, New York, New York, will provide such an opinion for the underwriters. Cravath,\nSwaine & Moore LLP acts as legal counsel to us and our subsidiaries in a substantial number of matters on a\nregular basis.\n\n41\n\nThe information in this prospectus addendum is not complete and may be changed. We may not sell these\nsecurities until the registration statement filed with the Securities and Exchange Commission is effective.\nThis prospectus addendum is not an offer to sell these securities, and we are not soliciting offers to buy\nthese securities, in any state where the offer or sale is not permitted.\n\nSUBJECT TO COMPLETION, DATED March 4, 2025\n\nProspectus addendum\n\n(To Prospectus dated , 2025)\n\nDebt Securities\n\nPreferred Stock\n\nDepositary Shares\n\nWarrants\n\nUnits\n\nAffiliates of JPMorgan Chase & Co. (\u0093JPMorganChase\u0094), including J.P. Morgan Securities LLC, may use this\nprospectus addendum in\nconnection with offers and sales in the secondary markets related to market-making transactions in the\noutstanding securities of JPMorganChase referenced herein. These affiliates of JPMorganChase may act as\nprincipal or agent in those transactions.\nSecondary market sales by any of these affiliates will be made at prices related to prevailing market prices\nat the time of sale. JPMorganChase will not receive any of the proceeds of those sales. These affiliates of\nJPMorganChase do not have any\nobligation to make a market in the securities referenced herein, and may discontinue their market-making\nactivities at any time with notice, in their sole discretion.\n\nThe outstanding securities being offered by use of this prospectus addendum consist of debt securities,\npreferred stock, depositary shares,\nwarrants and units previously registered under the following registration statements of JPMorganChase or\npredecessor companies of JPMorganChase: 333-263304, 333-230098, 333-209681, 333-191692, 333-169900,\n333-146731, 333-117775, 333-107207,\n333-71876, 333-94393, 333-14959, 333-14959-02, 333-14959-03, 333-37567, 333-37567-03, 333-117785,\n333-117785-05, 333-126750, 333-126750-02, 333-126750-04, 333-116775, 333-116775-02, 333-116773,\n333-116773-01, 333-70639, 33-49965, 33-64261, 33-64193, 33-60807, 33-64195, 333-22413, 333-15649 and\n333-136666. The descriptions of the securities being offered hereby are contained in the prospectuses and\nsupplements thereto pursuant to\nwhich those securities were initially offered that are contained in or deemed a part of the registration\nstatements referred to above. The instruments governing those securities and other exhibits in respect of\nthose securities were filed as\nexhibits or incorporated by reference in those registration statements. Those descriptions and exhibits are\nincorporated by reference into this prospectus addendum, except that information contained in those\nprospectuses and supplements thereto that\n(i) constitutes a description of JPMorganChase or any of its predecessors or (ii) incorporates by reference\nany information contained in JPMorganChase\u0092s current or periodic reports filed with the SEC, are superseded\nby the information contained\nin the prospectus to which this prospectus addendum is attached.\n\nThe following securities are listed on the New York Stock Exchange under\nthe trading symbols indicated:\n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 5.75%                \n      Non-Cumulative Preferred                                                                              \n      Stock, Series DD, listed under the trading symbol \u0093JPM PR D\u0094;                                           \n                                                                                                            \n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 6.00%                \n      Non-Cumulative Preferred                                                                              \n      Stock, Series EE, listed under the trading symbol \u0093JPM PR C\u0094;                                           \n                                                                                                            \n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 4.75%                \n      Non-Cumulative Preferred                                                                              \n      Stock, Series GG, listed under the trading symbol \u0093JPM PR J\u0094;                                           \n                                                                                                            \n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 4.55%                \n      Non-Cumulative Preferred                                                                              \n      Stock, Series JJ, listed under the trading symbol \u0093JPM PR K\u0094;                                           \n                                                                                                            \n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 4.625%               \n      Non-Cumulative Preferred                                                                              \n      Stock, Series LL, listed under the trading symbol \u0093JPM PR L\u0094; and                                       \n                                                                                                            \n                                                                                                            \n      Depositary Shares, each representing a one-four hundredth interest in a share of 4.20%                \n      Non-Cumulative Preferred                                                                              \n      Stock, Series MM, listed under the trading symbol \u0093JPM PR M\u0094.                                           \n                                                                                                            \nThese securities have not been approved by the Securities and Exchange Commission (the \u0093SEC\u0094) or any state\nsecurities commission, nor have these organizations determined that this prospectus addendum is accurate or\ncomplete. Any representation to the contrary is a criminal offense.\n\nSee the section entitled \u0093Risk Factors\u0094 in our most recent Annual Report on Form 10-K and any subsequent\nQuarterly Report on Form 10-Q, and any risk factors described in an applicable prospectus supplement, for a\ndiscussion of risks you should consider in connection with an investment in any of the securities offered\nunder this prospectus addendum.\n\nIn making your investment decision, you should rely only on the information contained or incorporated by\nreference in this prospectus addendum, any applicable supplement to this prospectus addendum or in any\nrelated free writing prospectus that we prepare or authorize. We have not authorized anyone to provide you\nwith any other information.\n\nNeither we nor any of our affiliates is making an offer of securities in any state or jurisdiction where the\noffer is not permitted.\n\nThis prospectus addendum is dated , 2025.\n\nPART II\n\nINFORMATION NOT REQUIRED IN PROSPECTUS\n                                                          \n  ITEM 14.  Other Expenses of Issuance and Distribution.  \n                                                          \nEstimated expenses in connection with the issuance and distribution of the securities being registered other\nthan underwriting compensation are\nas follows:\n                                                                \n  Registration fee \u0097 Securities and Exchange    $  \u0086              \n  Commission                                                    \n  Attorneys\u0092 fees and expenses                     (1,500,000)*  \n  Accountants\u0092 fees and expenses                   (3,500,000)*  \n  Printing and engraving expenses                 (1,000,000)*  \n  Rating agency fees                              (5,000,000)*  \n  Trustee fees                                    (100,000)*    \n  Miscellaneous expenses                          (150,000)*    \n  Total                                        $                \n                                                                \n                                                                                \n    To be provided in a pre-effective amendment to the Registration Statement.  \n                                                                                \n                \n  *  Estimated  \n                \n                                                        \n  ITEM 15.  Indemnification of Directors and Officers.  \n                                                        \nPursuant to the Delaware General Corporation Law (\u0093DGCL\u0094), a corporation may indemnify any person who was or\nis a party or is\nthreatened to be made a party to any threatened, pending or completed action, suit or proceeding, whether\ncivil, criminal, administrative or investigative (other than a derivative action by or in the right of such\ncorporation) who is or was a\ndirector, officer, employee or agent of such corporation, or serving at the request of such corporation in\nsuch capacity for another corporation, partnership, joint venture, trust or other enterprise, against\nexpenses (including attorneys\u0092\nfees), judgments, fines and amounts paid in settlement actually and reasonably incurred in connection with\nsuch action, suit or proceeding, if such person acted in good faith and in a manner he or she reasonably\nbelieved to be in or not opposed to\nthe best interests of such corporation, and, with respect to any criminal action or proceeding, had no\nreasonable cause to believe his or her conduct was unlawful.\n\nThe DGCL also permits indemnification by a corporation under similar circumstances for expenses (including\nattorneys\u0092 fees) actually and\nreasonably incurred by such persons in connection with the defense or settlement of a derivative action,\nexcept that no indemnification shall be made in respect of any claim, issue or matter as to which such\nperson shall have been adjudged to be\nliable to such corporation unless and only to the extent that the Delaware Court of Chancery or the court in\nwhich such action or suit was brought shall determine upon application that such person is fairly and\nreasonably entitled to indemnity for\nsuch expenses which such court shall deem proper.\n\nThe DGCL provides that the indemnification described above shall not be deemed\nexclusive of any other indemnification that may be granted by a corporation pursuant to its by-laws,\ndisinterested directors\u0092 vote, stockholders\u0092 vote, agreement or otherwise.\n\nThe DGCL also provides corporations with the power to purchase and maintain insurance on behalf of any\nperson who is or was a director,\nofficer, employee or agent of the corporation, or is or was serving at the request\n\nII-1\n\nof the corporation in a similar capacity for another corporation, partnership, joint venture, trust or other\nenterprise, against any liability asserted against him or her in any such capacity, or\narising out of his or her status as such, whether or not the corporation would have the power to indemnify\nhim or her against such liability as described above.\n\nThe certificate of incorporation of JPMorgan Chase & Co. (\u0093JPMorganChase\u0094) provides that, to the fullest\nextent that the\nDGCL as from time to time in effect permits the limitation or elimination of the liability of directors, no\ndirector of JPMorganChase shall be personally liable to JPMorganChase or its stockholders for monetary\ndamages for breach of fiduciary duty\nas a director.\n\nJPMorganChase\u0092s certificate of incorporation empowers JPMorganChase to indemnify any director, officer,\nemployee or\nagent of JPMorganChase or any other person who is serving at JPMorganChase\u0092s request in any such capacity\nwith another corporation, partnership, joint venture, trust or other enterprise (including, without\nlimitation, any employee benefit plan)\nto the fullest extent permitted under the DGCL as from time to time in effect, and any such indemnification\nmay continue as to any person who has ceased to be a director, officer, employee or agent and may inure to\nthe benefit of the heirs,\nexecutors and administrators of such a person.\n\nJPMorganChase\u0092s certificate of incorporation also empowers JPMorganChase by action of\nits board of directors, notwithstanding any interest of the directors in the action, to purchase and\nmaintain insurance in such amounts as the Board of Directors deems appropriate to protect any director,\nofficer, employee or agent of JPMorganChase\nor any other person who is serving at JPMorganChase\u0092s request in any such capacity with another corporation,\npartnership, joint venture, trust or other enterprise (including, without limitation, any employee benefit\nplan) against any liability\nasserted against him or her or incurred by him or her in any such capacity or arising out of his or her\nstatus as such (including, without limitation, expenses, judgments, fines (including any excise taxes\nassessed on a person with respect to any\nemployee benefit plan) and amounts paid in settlement) to the fullest extent permitted under the DGCL as\nfrom time to time in effect, whether or not JPMorganChase would have the power or be required to indemnify\nany such person under the terms of\nany agreement or by-law or the DGCL.\n\nIn addition, JPMorganChase\u0092s by-laws require JPMorganChase to indemnify, to the fullest extent permitted\nunder applicable law, as from time to time in effect, any person who was or is involved in any manner\n(including, without limitation, as a\nparty or witness), or is threatened to be made so involved, in any threatened, pending or completed\ninvestigation, claim, action, suit or proceeding, whether civil, criminal, administrative, or investigative\n(including without limitation, any\naction, suit or proceeding by or in the right of JPMorganChase to procure a judgment in its favor, but\nexcluding any action, suit, or proceeding, or part thereof, brought by such person against JPMorganChase or\nany of its affiliates unless consented\nto by JPMorganChase) (a \u0093Proceeding\u0094) by reason of the fact that he or she is or was a director, officer, or\nemployee of JPMorganChase, or is or was serving at the request of JPMorganChase as a director, officer or\nemployee of another\ncorporation, partnership, joint venture, trust or other enterprise, against all expenses (including\nattorneys\u0092 fees), judgments, fines and amounts paid in settlement actually and reasonably incurred by him or\nher in connection with such\nProceeding (or part thereof). The by-laws specify that the right to indemnification so provided is a\ncontract right, set forth certain procedural and evidentiary standards applicable to the enforcement of a\nclaim under the by-laws and entitle the persons to be indemnified to receive payment in advance of any\nexpenses incurred in connection with such Proceeding, consistent with the provisions of applicable law, as\nfrom time to time in effect. Such provisions, however, are intended to be in furtherance and not in\nlimitation of the general right to indemnification provided in the by-laws, which right of indemnification\nand of advancement of expenses is not exclusive of any other rights to which a person seeking\nindemnification may otherwise be entitled, under any statute, by-law, agreement, vote or otherwise.\n\nJPMorganChase\u0092s by-laws also provide that JPMorganChase may enter into contracts with any\ndirector, officer or employee of JPMorganChase in furtherance of the indemnification provisions in the by-\nlaws, as well as create a trust fund, grant a security interest or use other means (including, without\nlimitation, a letter of credit) to ensure payment of amounts indemnified.\n\nII-2\n\nLastly, JPMorganChase\u0092s by-laws also provide that\nany repeal or modification of the indemnification rights provided in the by-laws shall not adversely affect\nany right or protection thereunder of any person in respect of any act or omission occurring\nprior to the time of such repeal or modification.\n\nThe foregoing statements are subject to the detailed provisions of Section 145 of\nthe DGCL and the certificate of incorporation and by-laws of JPMorganChase.\n                      \n  ITEM 16.  Exhibits  \n                      \nThe exhibits to this registration statement are listed in the exhibit index, which appears elsewhere herein\nand is incorporated herein by\nreference.\n                           \n  ITEM 17.  Undertakings.  \n                           \nThe undersigned Registrant hereby undertakes:\n\n(1) To file, during any period in which offers or sales are being made, a post-effective amendment to this\nregistration\nstatement:\n\n(i) To include any prospectus required by Section 10(a)(3) of the Securities Act of 1933;\n\n(ii) To reflect in the prospectus any facts or events arising after the effective date of the registration\nstatement (or the\nmost recent post-effective amendment thereof) which, individually or in the aggregate, represent a\nfundamental change in the information set forth in the registration statement. Notwithstanding the\nforegoing, any increase or decrease in volume of\nsecurities offered (if the total dollar value of securities offered would not exceed that which was\nregistered) and any deviation from the low or high end of the estimated maximum offering range may be\nreflected in the form of prospectus filed with\nthe Commission pursuant to Rule 424(b) if, in the aggregate, the changes in volume and price represent no\nmore than a 20% change in the maximum aggregate offering price set forth in the \u0093Calculation of Registration\nFee\u0094 table in the\neffective registration statement; and\n\n(iii) To include any material information with respect to the plan of distribution\nnot previously disclosed in the registration statement or any material change to such information in the\nregistration statement;\n\nprovided,\nhowever, that paragraphs (1)(i), (1)(ii) and (1)(iii) do not apply if the information required to be\nincluded in a post-effective amendment by those paragraphs is contained in reports filed with or furnished\nto the Commission by the\nRegistrant pursuant to Section 13 or Section 15(d) of the Securities Exchange Act of 1934 that are\nincorporated by reference in the registration statement, or is contained in a form of prospectus filed\npursuant to Rule 424(b) that is part of the\nregistration statement.\n\n(2) That, for the purpose of determining any liability under the Securities Act of 1933, each such\npost-effective amendment shall be deemed to be a new registration statement relating to the securities\noffered therein, and the offering of such securities at that time shall be deemed to be the initial bona\nfide offering thereof.\n\n(3) To remove from registration by means of a post-effective amendment any of the securities being\nregistered which remain\nunsold at the termination of the offering.\n\n(4) That, for the purpose of determining liability under the Securities Act of\n1933 to any purchaser:\n\n(i) Each prospectus filed by the Registrant pursuant to Rule 424(b)(3) shall be deemed to be part\nof the registration statement as of the date the filed prospectus was deemed part of and included in the\nregistration statement; and\n\n(ii) Each prospectus required to be filed pursuant to Rule 424(b)(2), (b)(5), or (b)(7) as part of a\nregistration statement in\nreliance on Rule 430B relating to an offering made pursuant to Rule 415(a)(1)(i), (vii), or (x) for the\npurpose of providing the information required by Section 10(a) of the Securities Act of 1933 shall be deemed\nto be part of and included\nin the registration statement as of the earlier of the date such form of prospectus is first used after\neffectiveness or the date of the first contract of sale of securities\n\nII-3\n\nin the offering described in the prospectus. As provided in Rule 430B, for liability purposes of the issuer\nand any person that is at that date an underwriter, such date shall be deemed to be a\nnew effective date of the registration statement relating to the securities in the registration statement to\nwhich that prospectus relates, and the offering of such securities at that time shall be deemed to be the\ninitial bona fide offering\nthereof. Provided, however, that no statement made in a registration statement or prospectus that is part of\nthe registration statement or made in a document incorporated or deemed incorporated by reference into the\nregistration statement or\nprospectus that is part of the registration statement will, as to a purchaser with a time of contract of\nsale prior to such effective date, supersede or modify any statement that was made in the registration\nstatement or prospectus that was part of\nthe registration statement or made in any such document immediately prior to such effective date.\n\n(5) That, for the\npurpose of determining liability of the Registrant under the Securities Act of 1933 to any purchaser in the\ninitial distribution of the securities, the undersigned Registrant undertakes that in a primary offering of\nsecurities of the undersigned\nRegistrant pursuant to this registration statement, regardless of the underwriting method used to sell the\nsecurities to the purchaser, if the securities are offered or sold to such purchaser by means of any of the\nfollowing communications, the\nundersigned Registrant will be a seller to the purchaser and will be considered to offer or sell such\nsecurities to such purchaser:\n\n(i) Any preliminary prospectus or prospectus of the undersigned Registrant relating to the offering required\nto be filed\npursuant to Rule 424;\n\n(ii) Any free writing prospectus relating to the offering prepared by or on behalf of the\nundersigned Registrant or used or referred to by the undersigned Registrant;\n\n(iii) The portion of any other free writing\nprospectus relating to the offering containing material information about the undersigned Registrant or its\nsecurities provided by or on behalf of the undersigned Registrant; and\n\n(iv) Any other communication that is an offer in the offering made by the undersigned Registrant to the\npurchaser.\n\nThe undersigned Registrant hereby undertakes that, for purposes of determining any liability under the\nSecurities Act of 1933 each filing of\nthe Registrant\u0092s annual report pursuant to Section 13(a) or Section 15(d) of the Securities Exchange Act of\n1934 (and, where applicable, each filing of an employee benefit plan\u0092s annual report pursuant to Section\n15(d) of\nthe Securities Exchange Act of 1934) that is incorporated by reference in the registration statement shall\nbe deemed to be a new registration statement relating to the securities offered therein, and the offering of\nsuch securities at that time\nshall be deemed to be the initial bona fide offering thereof.\n\nInsofar as indemnification for liabilities arising under the Securities Act\nof 1933 may be permitted to directors, officers and controlling persons of the Registrant pursuant to the\nforegoing provisions, or otherwise, the Registrant has been advised that in the opinion of the Securities\nand Exchange Commission such\nindemnification is against public policy as expressed in the Act and is, therefore, unenforceable. In the\nevent that a claim for indemnification against such liabilities (other than the payment by the Registrant of\nexpenses incurred or paid by a\ndirector, officer or controlling person of the Registrant in the successful defense of any action, suit or\nproceeding) is asserted by such director, officer or controlling person in connection with the securities\nbeing registered, the Registrant\nwill, unless in the opinion of its counsel the matter has been settled by controlling precedent, submit to a\ncourt of appropriate jurisdiction the question whether such indemnification by it is against public policy\nas expressed in the Securities\nAct and will be governed by the final adjudication of such issue.\n\nII-4\n\nEXHIBIT INDEX\n                                                                                                            \n  Exhibit    Document Description                                                                           \n  Number                                                                                                    \n             Form of Debt Securities Underwriting Agreement (incorporated by reference to Exhibit 1.1 to    \n  1.1        the Registration Statement on Form S-3 (File No. 333-263304                                    \n             of JPMorgan Chase & Co.).                                                                      \n             Form of Equity Securities Underwriting Agreement (incorporated by reference to Exhibit 1.2 to  \n  1.2        the Registration Statement on Form S-3 (File No. 333-263304                                    \n             of JPMorgan Chase & Co.).                                                                      \n             Form of Certificate for shares of Common Stock (incorporated by reference to Exhibit 4.1 to    \n  4.1        the Registration Statement on Form S-3 (File No. 333-71876)                                    \n             of JPMorgan Chase & Co.).                                                                      \n             Form of Certificate of Designations for Preferred Stock (incorporated by reference to Exhibit  \n  4.2        4.2 to the Registration Statement on Form S-3 (File                                            \n             No. 333-191692) of JPMorgan Chase & Co.).                                                      \n  4.3        Form of Deposit Agreement.                                                                     \n  4.4        Form of Depositary Receipt representing Depositary Shares, included in Exhibit 4.3 hereto.     \n             Form of Debt Securities Warrant Agreement (incorporated by reference to Exhibit 4.24 to the    \n  4.5        Registration Statement on Form S-3 (File No. 333-71876)                                        \n             of JPMorgan Chase & Co.).                                                                      \n             Form of Preferred Stock Warrant Agreement (incorporated by reference to Exhibit 4.25 to the    \n  4.6        Registration Statement on Form S-3 (File No. 333-71876)                                        \n             of JPMorgan Chase & Co.).                                                                      \n             Form of Common Stock Warrant Agreement (incorporated by reference to Exhibit 4.26 to the       \n  4.7        Registration Statement on Form S-3 (File No. 333-71876)                                        \n             of JPMorgan Chase & Co.).                                                                      \n             Indenture, dated as of October 21, 2010, between JPMorgan Chase & Co. and Deutsche Bank Trust  \n  4.8        Company Americas (incorporated by reference to Exhibit                                         \n             4.1 to the Current Report on Form 8-K (File No. 1-05805) of JPMorgan Chase & Co. filed         \n             October 21, 2010).                                                                             \n             First Supplemental Indenture, dated as of January 13, 2017, between JPMorgan Chase & Co. and   \n             Deutsche Bank Trust Company Americas, as Trustee,                                              \n  4.9        to the Indenture, dated as of October 21, 2010 (incorporated by reference to Exhibit 4.1 to    \n             the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed January 13,     \n             2017).                                                                                         \n  4.10       Form of Senior Debt Security, included in Exhibit 4.8 hereto.                                  \n             Subordinated Indenture dated as of March 14, 2014 between JPMorgan Chase & Co. and U.S. Bank   \n  4.11       Trust National Association, as Trustee, incorporated                                           \n             by reference to Exhibit 4.1 to the Current Report on Form 8-K (File No. 1-5805) of JPMorgan    \n             Chase & Co. filed March 14, 2014).                                                             \n             First Supplemental Indenture, dated as of January 13, 2017, between JPMorgan Chase & Co. and   \n             U.S. Bank Trust National Association, as Trustee,                                              \n  4.12       to the Subordinated Indenture, dated as of March 14, 2014 (incorporated by reference to        \n             Exhibit 4.2 to the Current Report on Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed  \n             January 13, 2017).                                                                             \n  4.13       Form of Subordinated Debt Security, included in Exhibit 4.11 hereto.                           \n  4.14       Form of Unit Agreement.*                                                                       \n  4.15       Form of Units.*                                                                                \n  5.1        Opinion of Simpson Thacher & Bartlett LLP.                                                     \n  23.1       Consent of PricewaterhouseCoopers LLP.                                                         \n  23.2       Consent of Simpson Thacher & Bartlett LLP (included in Exhibit 5.1).                           \n  24.1       Powers of Attorney of JPMorgan Chase & Co.                                                     \n                                                                                                            \nII-5\n                                                                                                            \n  Exhibit    Document Description                                                                           \n  Number                                                                                                    \n  25.1       Form T-1 Statement of Eligibility under the Trust Indenture Act of 1939 of Deutsche Bank       \n             Trust Company Americas under the Senior Indenture.                                             \n  25.2       Form T-1 Statement of Eligibility under the Trust Indenture Act of 1939 of U.S. Bank Trust     \n             National Association under the Subordinated Indenture.                                         \n  107        Filing Fee Table                                                                               \n                                                                                                            \n                                                                     \n  *  To be filed by amendment or with a Current Report on Form 8-K.  \n                                                                     \nII-6\n\nSIGNATURES\n\nPursuant to the requirements of the Securities Act of 1933, as amended, the Registrant certifies that it has\nreasonable grounds to believe\nthat it meets all of the requirements for filing this Form S-3 and has duly caused this Registration\nStatement to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of New\nYork, State of New York, on March 4, 2025.\n                                                               \n          JPMORGAN CHASE & CO.                                 \n  By:                           /s/ STEPHEN B. GRANT           \n  Name:                         Stephen B. Grant               \n  Title:                        Assistant Corporate Secretary  \n                                                               \nPursuant to the requirements of the Securities Act of 1933, this Registration Statement has been signed\non behalf of the Registrant by the following persons in the capacities and on the dates indicated.\n                                                                                                            \n  Signature                                                                                                 \n  *                      Title                                                                              \n  James Dimon            Director, Chairman of the Board and Chief Executive Officer         Date           \n  *                      (Principal Executive Officer)                                       March 4, 2025  \n  Linda B. Bammann       Director                                                            March 4, 2025  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n  *                      Director                                                            March 4, 2025  \n  Stephen B. Burke                                                                                          \n  *                      Director                                                            March 4, 2025  \n  Todd A. Combs                                                                                             \n  *                      Director                                                            March 4, 2025  \n  Alicia Boler Davis                                                                                        \n  *                      Director                                                            March 4, 2025  \n  Alex Gorsky                                                                                               \n  *                      Director                                                            March 4, 2025  \n  Mellody Hobson                                                                                            \n  *                      Director                                                            March 4, 2025  \n  Phebe N. Novakovic                                                                                        \n  *                      Director                                                            March 4, 2025  \n  Virginia M. Rometty                                                                                       \n  *                      Director                                                            March 4, 2025  \n  Brad D. Smith                                                                                             \n  *                      Director                                                            March 4, 2025  \n  Mark A. Weinberger                                                                                        \n  *                      Executive Vice President and Chief Financial Officer (Principal     March 4, 2025  \n  Jeremy Barnum          Financial Officer)                                                                 \n                                                                                                            \nII-7\n                                                                                                            \n  Signature          Title                                                                                  \n  *                  Managing Director and Firmwide Controller (Principal Accounting         Date           \n  Elena Korablina    Officer)                                                                March 4, 2025  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                            \n                                                                                                            \n     Stephen B. Grant hereby signs this Registration Statement on behalf of each of the indicated persons   \n     for whom                                                                                               \n     he is attorney-in-fact on March 4, 2025 pursuant to powers of attorney filed as exhibits to the        \n  *  Registration Statement.                                                                                \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                            \n                               \n  By:    /S/ STEPHEN B. GRANT  \n         Stephen B. Grant      \n                               \nDated: March 4, 2025\n\nII-8\n"
}