{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "S-3",
  "filing_date": "2022-03-04",
  "period": "",
  "accession_number": "0001193125-22-066103",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0001193125-22-066103-index.html",
  "text": "As filed with the Securities and Exchange Commission on March 4, 2022\n\nReg. No. 333-\n                                                                                  \n   UNITED STATES                                                                  \n                                                                                  \n                                                                                  \n   SECURITIES                                                                     \n   AND EXCHANGE COMMISSION                                                        \n                                                                                  \nWashington, D.C. 20549\n\nFORM S-3\n                                                                                  \n   REGISTRATION STATEMENT                                                         \n                                                                                  \nUNDER\n\nTHE SECURITIES ACT OF 1933\n\nJPMORGAN CHASE & CO.\n\n(Exact name of registrant, as specified in charter)\n                                                         \n  Delaware                           13-2624428          \n  (State or other jurisdiction of    -IRS Employer       \n  incorporation or organization)     Identification No.  \n                                                         \nJPMorgan Chase & Co.\n\n383 Madison Avenue\n\nNew York, New York 10179\n\n(212) 270-6000\n\n(Address, including zip code, and telephone number, including area code, of\nregistrant\u0092s principal executive offices)\n\nJohn H. Tribolati\n\nCorporate Secretary\n\nJPMorgan Chase & Co.\n\n4 New York Plaza\n\nNew York, New York 10004\n\n(212) 270-6000\n\n(Name, address, including zip code, and telephone number, including area code, of\nagent for service)\n\nCopies of All Communications to:\n                                                                                  \n                             Lee Meyerson, Esq.         William V. Fogg, Esq.     \n  Stephen B. Grant, Esq.     Hui Lin, Esq. Benjamin     Michael E. Mariani, Esq.  \n  JPMorgan Chase & Co. 4     Heriaud, Esq. Simpson      Cravath, Swaine & Moore   \n  New York Plaza New         Thacher & Bartlett LLP     LLP                       \n  York, New York 10004       425 Lexington Avenue       825 Eighth Avenue New     \n  (212) 270-6000             New                        York,                     \n                             York, New York 10017       New York 10019 (212)      \n                             (212) 455-2000             474-1000                  \n                                                                                  \nApproximate date of commencement of proposed sale to the public: From time to time\nafter the\neffective date of this registration statement as determined by market conditions\nand other factors.\n\nIf the only securities being registered\non this Form are being offered pursuant to dividend or interest reinvestment\nplans, please check the following box. ☐\n\nIf\nany of the securities being registered on this Form are to be offered on a delayed\nor continuous basis pursuant to Rule 415 under the Securities Act of 1933, other\nthan securities offered only in connection with dividend or interest reinvestment\nplans, check the following box. ☒\n\nIf this Form is filed to register additional securities for an offering pursuant\nto Rule\n462(b) under the Securities Act, please check the following box and list the\nSecurities Act registration statement number of the earlier effective registration\nstatement for the same offering. ☐\n\nIf this Form is a post-effective amendment filed pursuant to Rule 462(c) under the\nSecurities Act, check the following box and list the\nSecurities Act registration statement number of the earlier effective registration\nstatement for the same offering. ☐\n\nIf\nthis Form is a registration statement pursuant to General Instruction I.D. or a\npost-effective amendment thereto that shall become effective upon filing with the\nCommission pursuant to Rule 462(e) under the Securities Act, check the following\nbox. ☐\n\nIf this Form is a post-effective amendment to a registration statement filed\npursuant to General Instruction I.D.\nfiled to register additional securities or additional classes of securities\npursuant to Rule 413(b) under the Securities Act, check the following box. ☐\n\nIndicate by check mark whether the registrant is a large accelerated filer, an\naccelerated filer, a non-accelerated filer, a smaller reporting\ncompany, or an emerging growth company. See the definitions of \u0093large accelerated\nfiler,\u0094 \u0093accelerated filer,\u0094 \u0093smaller reporting company\u0094 and \u0093emerging growth\ncompany\u0094 in Rule 12b-2 of the Exchange Act.\n                                                                  \n  Large Accelerated filer    ☒    Accelerated filer    ☐          \n  Non-accelerated filer      ☐    Smaller reporting company    ☐  \n                                  Emerging growth company    ☐    \n                                                                  \nIf an emerging growth company, indicate by check mark if the registrant has\nelected not to use the extended\ntransition period for complying with any new or revised financial accounting\nstandards provided pursuant to Section 7(a)(2)(B) of the Securities Act. ☐\n\nThe Registrant hereby amends this registration statement on the date or dates as\nmay be necessary to delay its effective date until the Registrant shall file a\nfurther amendment which specifically states that this registration statement shall\nthereafter become effective in accordance with Section 8(a) of the Securities Act\nor until this registration statement shall become effective on the date that the\nSecurities and Exchange Commission, acting pursuant to said Section 8(a), may\ndetermine.\n\nExplanatory Note\n\nThis Registration Statement contains:\n                                                                                  \n      a prospectus to be used by JPMorgan Chase & Co. in connection with          \n      offerings of up to $150,000,000,000, or                                     \n      the equivalent thereof in any other currency, of its debt securities,       \n      preferred stock, depositary shares representing its preferred stock,        \n      common stock, warrants and units at unspecified aggregate initial public    \n      offering prices and by affiliates of                                        \n      JPMorgan Chase & Co. in connection with market-making transactions from     \n      time to time in the securities described therein after they are initially   \n      offered and sold; and                                                       \n                                                                                  \n                                                                                  \n      a prospectus addendum to be used by affiliates of JPMorgan Chase & Co. in   \n      connection with market-making                                               \n      transactions from time to time in securities of one or more of the same     \n      classes that were initially registered under registration statements        \n      previously filed by JPMorgan Chase & Co. or its affiliates and that were    \n      initially offered and sold                                                  \n      prior to the date of the abovementioned prospectus addendum.                \n                                                                                  \nThe information in this prospectus is not complete and may be changed. We may not\nsell these securities until the registration statement filed with the Securities\nand Exchange Commission is effective. This prospectus is not an offer to sell\nthese securities, and we are not soliciting offers to buy these securities, in any\nstate where the offer or sale is not permitted.\n\nSUBJECT TO COMPLETION, DATED\n\nProspectus\n\n$150,000,000,000\n\nDebt Securities\n\nPreferred Stock\n\nDepositary Shares\n\nCommon Stock\n\nWarrants\n\nUnits\n\nUp to\n$150,000,000,000, or the equivalent thereof in any other currency, of these\nsecurities may be offered from time to time, in amounts, on terms and at prices\nthat will be determined at the time they are offered for sale. These terms and\nprices will be\ndescribed in more detail in one or more supplements to this prospectus, which will\nbe distributed at the time the securities are offered. Our common stock is listed\non the New York Stock Exchange under the symbol \u0093JPM.\u0094 The other\nsecurities that we may offer from time to time under this prospectus may be listed\non the New York Stock Exchange or another national securities exchange, as\nspecified in the applicable prospectus supplement.\n\nYou should read this prospectus and any supplement carefully before you invest.\nSee the section entitled \u0093Risk Factors\u0094 in our most recent Annual Report on Form\n10-K and any subsequent Quarterly Report on Form 10-Q, andany risk factors\ndescribed in anapplicable prospectus supplement,for a discussion of risks you\nshould consider in connection with an investment in any of the securities offered\nunder this prospectus.\n\nThis prospectus may not be used to sell any of the securities unless it is\naccompanied by a prospectus supplement.\n\nThe securities\nmay be sold to or through underwriters, through dealers or agents, directly to\npurchasers or through a combination of these methods. If an offering of securities\ninvolves any underwriters, dealers or agents, then the applicable prospectus\nsupplement\nwill name the underwriters, dealers or agents and will provide information\nregarding any fee, commission or discount arrangements made with those\nunderwriters, dealers or agents.\n\nThese securities are not deposits or other obligations of a bank and are not\ninsured by the Federal Deposit Insurance Corporation or any other governmental\nagency.\n\nThese securities have not been approved by the Securities and Exchange Commission\nor any state securities commission, nor have these organizations determined that\nthis prospectus is accurate or complete. Any representation to the contrary is a\ncriminal offense.\n\nThis prospectus is dated , 2022\n\nTABLE OF CONTENTS\n                                                            \n  Summary                                                3  \n  Where You Can Find More Information About JPMorgan     7  \n  Chase                                                     \n  Important Factors that may Affect Future Results       8  \n  Use of Proceeds                                       10  \n  Description of Debt Securities                        11  \n  Description of Preferred Stock                        21  \n                                                            \n                                                       \n  Description of Depositary Shares                 35  \n  Description of Common Stock                      36  \n  Description of Warrants                          37  \n  Description of Units                             38  \n  Book-Entry Issuance                              39  \n  Plan of Distribution                             43  \n  Independent Registered Public Accounting Firm    44  \n  Legal Opinions                                   44  \n                                                       \n2\n\nSUMMARY\n\nThis summary highlights selected information from this document and may not\ncontain all of the information that is important to you. To\nunderstand the terms of our securities, you should carefully read:\n                                                                                  \n      this prospectus, which explains the general terms of the securities we may  \n      offer;                                                                      \n                                                                                  \n                                                                                  \n      the attached prospectus supplement, which gives the specific terms of the   \n      particular securities we are offering                                       \n      and may change or update information in this prospectus; and                \n                                                                                  \n                                                                                  \n      the documents we have referred you to in \u0093Where You Can Find More            \n      Information About JPMorgan Chase\u0094 on                                         \n      page 7 for information about our company and our financial statements.      \n                                                                                  \nCertain capitalized terms used in this summary\nare defined elsewhere in this prospectus.\n\nJPMorgan Chase & Co.\n\nJPMorgan Chase & Co., which we refer to as \u0093JPMorgan Chase,\u0094 \u0093we\u0094 or \u0093us,\u0094 is a\nleading financial services\nfirm based in the United States, with operations worldwide. JPMorgan Chase is a\nleader in investment banking, financial services for consumers and small\nbusinesses, commercial banking, financial transaction processing and asset\nmanagement. Under the\nJ.P. Morgan and Chase brands, JPMorgan Chase serves millions of customers in the\nUnited States, and many of the world\u0092s most prominent corporate, institutional and\ngovernment clients globally.\n\nJPMorgan Chase is a financial holding company and was incorporated under Delaware\nlaw on October 28, 1968. JPMorgan Chase\u0092s principal\nbank subsidiary is JPMorgan Chase Bank, N.A., a national bank with branches in 48\nstates and Washington, D.C. as of December 31, 2021. JPMorgan Chase\u0092s principal\nnonbank subsidiary is J.P. Morgan Securities LLC, a U.S. broker-dealer. JPMorgan\nChase\u0092s principal operating subsidiary outside the United States is J.P. Morgan\nSecurities plc, a U.K.-based subsidiary of JPMorgan Chase Bank, N.A.\n\nTo find out how to obtain more information about us, see \u0093Where You Can Find More\nInformation About JPMorgan Chase.\u0094\n\nOur principal executive offices are located at 383 Madison Avenue, New York, New\nYork 10179 and our telephone number is (212) 270-6000.\n\nThe Securities We May Offer\n\nThis prospectus is part of a registration statement (the \u0093registration statement\u0094)\nthat we filed with the Securities and Exchange\nCommission (\u0093SEC\u0094) utilizing a \u0093shelf\u0094 registration process. Under this shelf\nprocess, we may offer from time to time up to $150,000,000,000, or the equivalent\nthereof in any other currency, of any of the following securities:\n             \n      debt;  \n             \n                        \n      preferred stock;  \n                        \n                          \n      depositary shares;  \n                          \n                     \n      common stock;  \n                     \n                     \n      warrants; and  \n                     \n              \n      units.  \n              \nThis prospectus provides you with a general description of the securities we may\noffer. Each time we offer securities, we will provide a\nprospectus supplement that will describe the specific amounts, prices and terms of\nthe securities being offered. The prospectus supplement may also add to, update or\nchange information contained in this prospectus. References to this prospectus or\nthe prospectus supplement also means the information contained in other documents\nwe have filed with the SEC and have referred you to in this prospectus. If this\nprospectus is inconsistent with the prospectus supplement, you should rely on the\nprospectus supplement. You should read this prospectus, the applicable prospectus\nsupplement and the additional information that we refer you to, as discussed under\n\u0093Where You Can Find More Information About JPMorgan Chase.\u0094\n\n3\n\nDebt Securities\n\nWe may use this prospectus and an applicable prospectus supplement to offer our\nunsecured general debt obligations, which may be senior or\nsubordinated. The senior debt securities will have the same rank as all of our\nother unsecured, unsubordinated debt. The subordinated debt securities will be\nentitled to payment only after payment on our \u0093Senior Indebtedness,\u0094 which\nincludes the senior debt securities. For the definition of Senior Indebtedness,\nsee \u0093Description of Debt Securities\u0097Subordinated Debt Securities\u0097Subordination\u0094\nbeginning on page 15 below.\n\nThe senior debt securities will be issued under the indenture, dated as of October\n21, 2010, as amended by the first\nsupplemental indenture, dated as of January 13, 2017, between us and Deutsche Bank\nTrust Company Americas, as trustee. We refer to that indenture, as so amended, as\nthe \u0093senior indenture.\u0094 The subordinated debt securities will be issued\nunder the subordinated indenture, dated as of March 14, 2014, as amended by the\nfirst supplemental indenture, dated as of January 13, 2017, between us and U.S.\nBank Trust National Association, as trustee. We refer to that indenture, as so\namended,\nas the \u0093subordinated indenture\u0094 and, together with the senior indenture, the\n\u0093indentures\u0094 and each an \u0093indenture.\u0094 We have summarized below certain general\nfeatures of the debt securities from the indentures. We\nencourage you to read the indentures, which are exhibits to the registration\nstatement.\n\nGeneral Indenture Provisions that Apply to the Senior Debt Securities and the\nSubordinated Debt Securities\n                                                                                  \n      Each indenture allows us to issue different types of debt securities,       \n      including indexed securities.                                               \n                                                                                  \n                                                                                  \n      Neither of the indentures limits the amount of debt securities that we may  \n      issue or provides you with any                                              \n      protection should there be a highly leveraged transaction,                  \n      recapitalization or restructuring involving JPMorgan Chase.                 \n                                                                                  \n                                                                                  \n      The indentures allow us to consolidate or merge with another entity, or to  \n      convey, transfer or lease all or                                            \n      substantially all of our assets to another entity. If one of these events   \n      occurs and we are not the successor in the transaction, the successor will  \n      be required to assume our responsibilities relating to the debt securities  \n      and the indentures.                                                         \n                                                                                  \n                                                                                  \n      The indentures provide that holders of a majority of the total principal    \n      amount of outstanding debt securities of                                    \n      any series may vote to change certain of our obligations or certain of      \n      your rights concerning the debt securities of that series. However, to      \n      change the amount or timing of principal, interest or other payments under  \n      the debt securities of a series,                                            \n      every holder in the series affected by the change must consent.             \n                                                                                  \n                                                                                  \n      If an event of default (as described below) occurs with respect to any      \n      series of debt securities, the trustee or                                   \n      holders of 25% of the outstanding principal amount of that series may       \n      declare the principal amount of the series immediately payable. However,    \n      holders of a majority of the principal amount may rescind this action.      \n                                                                                  \nGeneral Indenture Provisions that Apply Only to Senior Debt Securities\n\nWe have agreed in the senior indenture that we and our subsidiaries will not sell,\nassign, transfer, grant a security interest in or otherwise\ndispose of the voting stock of JPMorgan Chase Bank, N.A., which we refer to as the\n\u0093Bank\u0094, and that the Bank will not issue its voting stock, unless the sale or\nissuance is for fair market value and we and our subsidiaries would own at\nleast 80% of the voting stock of the Bank following the sale or issuance. This\ncovenant would not prevent us from completing a merger, consolidation or sale of\nsubstantially all of our assets. In addition, this covenant would not prevent the\nmerger\nor consolidation of the Bank into another domestic bank if JPMorgan Chase and its\nsubsidiaries would own at least 80% of the voting stock of the successor entity\nafter the merger or consolidation.\n\n4\n\nIf we satisfy certain conditions in the senior indenture, we may discharge that\nindenture at any\ntime by depositing with the trustee sufficient funds or government obligations to\npay the senior debt securities when due.\n\nEvents of Default. The senior indenture provides that the following are events of\ndefault with respect to any series of senior debt securities:\n                                                                                  \n      default in the payment of principal of (or premium, if any, on) any senior  \n      debt securities of that series and                                          \n      continuance of that default for 30 days;                                    \n                                                                                  \n                                                                                  \n      default in the payment of interest on any senior debt securities of that    \n      series and continuance of that default                                      \n      for 30 days;                                                                \n                                                                                  \n                                                                                  \n      specified events of bankruptcy, insolvency or reorganization of JPMorgan    \n      Chase; and                                                                  \n                                                                                  \n                                                                                  \n      any other event of default specified with respect to senior debt            \n      securities of that series.                                                  \n                                                                                  \nGeneral Indenture Provisions that Apply Only to Subordinated Debt Securities\n\nThe subordinated debt securities will be subordinated to all \u0093Senior\nIndebtedness,\u0094 which includes all of our indebtedness for money\nborrowed, except indebtedness that is stated not to be senior to, or that is\nstated to have the same rank as, the subordinated debt securities or other\nsecurities having the same rank as or that are subordinated to the subordinated\ndebt securities.\n\nEvents of Default. The subordinated indenture provides that the following are\nevents of default with respect to any series of\nsubordinated debt securities:\n                                                                                  \n      specified events of bankruptcy, reorganization or insolvency of JPMorgan    \n      Chase; and                                                                  \n                                                                                  \n                                                                                  \n      any other event specified with respect to subordinated debt securities of   \n      that series.                                                                \n                                                                                  \nPreferred Stock and Depositary Shares\n\nWe\nmay use this prospectus and an applicable prospectus supplement to offer our\npreferred stock, par value $1 per share, in one or more series. We will determine\nthe dividend, voting, conversion and other rights of the series being offered, and\nthe\nterms and conditions relating to the offering and sale of the series, at the time\nof the offer and sale. We may also issue preferred stock that will be represented\nby depositary shares.\n\nCommon Stock\n\nWe may use this prospectus\nand an applicable prospectus supplement to offer our common stock, par value $1\nper share. Subject to the rights of holders of our preferred stock, holders of our\ncommon stock are entitled to receive dividends when declared by our board of\ndirectors\n(which may also refer to a board committee). Each holder of common stock is\nentitled to one vote per share. The holders of common stock have no preemptive\nrights or cumulative voting rights.\n\nWarrants\n\nWe may use this prospectus and\nan applicable prospectus supplement to offer warrants for the purchase of debt\nsecurities, preferred stock or common stock, which we refer to as \u0093warrants.\u0094 We\nmay issue warrants independently or together with other securities.\n\nUnits\n\nWe may use this prospectus and an\napplicable prospectus supplement to offer any combination of debt securities,\npreferred stock, depositary shares, common stock and warrants issued by us, debt\nobligations or other\n\n5\n\nsecurities of an entity affiliated or not affiliated with us or other property\ntogether as units. In the applicable prospectus supplement, we will describe the\nparticular combination of debt\nsecurities, preferred stock, depositary shares, common stock and warrants issued\nby us, or debt obligations or other securities of an entity affiliated or not\naffiliated with us or other property constituting any units, and any other\nspecific terms\nof the units.\n\nJPMorgan Chase is a Holding Company\n\nWe are a holding company that holds the stock of the Bank and an intermediate\nholding company, JPMorgan Chase Holdings LLC, which we refer to\nas the \u0093IHC\u0094. We conduct substantially all of our operations through subsidiaries,\nincluding the Bank and the IHC. As a result, claims of the holders of our\nsecurities will generally have a junior position to claims of creditors of our\nsubsidiaries. Claims of our subsidiaries\u0092 creditors other than JPMorgan Chase\ninclude substantial amounts of deposit liabilities, long-term debt and other\nliabilities. In addition, we are obligated to contribute to the IHC substantially\nall the\nnet proceeds that we receive from the issuance of securities (including any\nsecurities offered by use of this prospectus), and the ability of the Bank and the\nIHC to make payments to us is limited. As a result of these arrangements, our\nability to\nmake various payments is dependent on our receiving dividends from the Bank and\ndividends and extensions of credit from the IHC. These limitations could affect\nour ability to pay interest on our debt securities, pay dividends on our preferred\nstock\nand common stock, redeem or repurchase outstanding securities, and fulfill our\nother payment obligations.\n\nConflicts of Interest\n\nWe own directly or indirectly all the outstanding equity securities of J.P. Morgan\nSecurities LLC. The underwriting arrangements for\nany offering pursuant to this prospectus will comply with the requirements of Rule\n5121 of the regulations of the Financial Industry Regulatory Authority (\u0093FINRA\u0094)\nregarding a FINRA member firm\u0092s underwriting of securities of an\naffiliate. In accordance with Rule 5121, J.P. Morgan Securities LLC may not make\nsales pursuant to this prospectus to any discretionary account without the prior\napproval of the customer.\n\n6\n\nWHERE YOU CAN FIND MORE INFORMATION\n\nABOUT JPMORGAN CHASE\n\nWe\nfile annual, quarterly and current reports, proxy statements and other information\nwith the SEC. Our SEC filings are available to the public on the website\nmaintained by the SEC at http://www.sec.gov. Such documents, reports and\ninformation are also\navailable on our website: https://jpmorganchaseco.gcs-web.com/financial-\ninformation/sec-filings. Websites that are cited or referred to in this prospectus\ndo not constitute part of this prospectus or any accompanying prospectus\nsupplement.\n\nThe SEC allows us to \u0093incorporate by reference\u0094 into this prospectus the\ninformation in documents we file with it, which means that\nwe can disclose important information to you by referring you to those documents.\nThe information incorporated by reference is considered to be a part of this\nprospectus, and later information that we file with the SEC will update and\nsupersede this\ninformation.\n\nWe incorporate by reference (i) the documents listed below and (ii) any future\nfilings we make with the SEC under\nSection 13(a), 13(c), 14, or 15(d) of the Securities Exchange Act of 1934 during\nthe period after the date of filing the initial registration statement of which\nthis prospectus forms a part and prior to the effectiveness of such registration\nstatement and after the date of this prospectus until the termination of each\noffering under this prospectus is completed, other than, in each case, those\ndocuments or the portions of those documents which are furnished and not filed:\n\n(a) Our Annual Report on Form 10-K for the year ended December 31, 2021;\n\n(b) Our Current Reports on Form 8-K filed on January 3, 2022, January 14, 2022,\nJanuary 20, 2022, January 25, 2022 and February 24, 2022;\n\n(c) The descriptions of our common stock contained in our Registration Statement\nfiled under\nSection 12 of the Securities Exchange Act of 1934 and any amendment or report\nfiled for the purpose of updating that description, and any other Registration\nStatement on Form 8-A relating to any securities offered by this prospectus.\n\nYou may request a copy of these filings, at no cost, by writing to or telephoning\nus at the following address:\n\nOffice of the Secretary\n\nJPMorgan\nChase & Co.\n\n4 New York Plaza\n\nNew York, New York 10004\n\n212-270-6000\n\nYou should rely only on the information provided or incorporated by reference in\nthis prospectus, any applicable prospectus supplement or in any related free\nwriting prospectus that we prepare or authorize. We have not authorized anyone to\nprovide you with any other information. We are not making an offer of securities\nin any state where the offer is not permitted. You should not assume that the\ninformation in this prospectus or any prospectus supplement or any document\nincorporated by reference is accurate as of any date other than the date on the\nfront of the applicable document.\n\n7\n\nIMPORTANT FACTORS THAT MAY AFFECT FUTURE RESULTS\n\nFrom time to time, we have made and will make forward-looking statements. These\nstatements can be identified by the fact that they do not\nrelate strictly to historical or current facts. Forward-looking statements often\nuse words such as \u0093anticipate,\u0094 \u0093target,\u0094 \u0093expect,\u0094 \u0093estimate,\u0094 \u0093intend,\u0094 \u0093plan,\u0094\n\u0093goal,\u0094\n\u0093believe,\u0094 or other words of similar meaning. Forward-looking statements provide\nour current expectations or forecasts of future events, circumstances, results or\naspirations. Our disclosures in this prospectus, any prospectus supplement\nand any documents incorporated by reference into this prospectus may contain\nforward-looking statements within the meaning of the Private Securities Litigation\nReform Act of 1995. We also may make forward-looking statements in our other\ndocuments\nfiled or furnished with the SEC. In addition, our senior management may make\nforward-looking statements orally to investors, analysts, representatives of the\nmedia and others.\n\nAll forward-looking statements are, by their nature, subject to risks and\nuncertainties, many of which are beyond our control. JPMorgan\nChase\u0092s actual future results may differ materially from those set forth in our\nforward-looking statements. While there is no assurance that any list of risks and\nuncertainties or risk factors is complete, below are certain factors which could\ncause actual results to differ from those in the forward-looking statements:\n                                                                                  \n      economic, financial, reputational and other impacts of the COVID-19         \n      pandemic;                                                                   \n                                                                                  \n                                                                                  \n      local, regional and global business, economic and political conditions and  \n      geopolitical events;                                                        \n                                                                                  \n                                                                                  \n      changes in laws, rules and regulatory requirements, including capital and   \n      liquidity requirements affecting our                                        \n      businesses, and our ability to address those requirements;                  \n                                                                                  \n                                                                                  \n      heightened regulatory and governmental oversight and scrutiny of our        \n      business practices, including dealings with                                 \n      retail customers;                                                           \n                                                                                  \n                                                                \n      changes in trade, monetary and fiscal policies and laws;  \n                                                                \n                                          \n      changes in the level of inflation;  \n                                          \n                                                          \n      changes in income tax laws, rules and regulations;  \n                                                          \n                                                                                  \n      securities and capital markets behavior, including changes in market        \n      liquidity and volatility;                                                   \n                                                                                  \n                                                                               \n      changes in investor sentiment or consumer spending or savings behavior;  \n                                                                               \n                                                                    \n      our ability to manage effectively our capital and liquidity;  \n                                                                    \n                                                                     \n      changes in credit ratings assigned to us or our subsidiaries;  \n                                                                     \n                                 \n      damage to our reputation;  \n                                 \n                                                                                  \n      our ability to appropriately address social, environmental and              \n      sustainability concerns that may arise, including                           \n      from our business activities;                                               \n                                                                                  \n                                                                                  \n      our ability to deal effectively with an economic slowdown or other          \n      economic or market disruption, including, but                               \n      not limited to, in the interest rate environment;                           \n                                                                                  \n                                                                               \n      technology changes instituted by us, our counterparties or competitors;  \n                                                                               \n                                                \n      the effectiveness of our control agenda;  \n                                                \n                                                                                  \n      our ability to develop or discontinue products and services, and the        \n      extent to which products or services                                        \n      previously sold by us require us to incur liabilities or absorb losses not  \n      contemplated at their initiation or origination;                            \n                                                                                  \n                                                                                  \n      acceptance of our new and existing products and services by the             \n      marketplace and our ability to innovate and to                              \n      increase market share;                                                      \n                                                                                  \n                                                                          \n      our ability to attract and retain qualified and diverse employees;  \n                                                                          \n                                        \n      our ability to control expenses;  \n                                        \n8\n                              \n      competitive pressures;  \n                              \n                                                                                  \n      changes in the credit quality of our clients, customers and                 \n      counterparties;                                                             \n                                                                                  \n                                                                                  \n      adequacy of our risk management framework, disclosure controls and          \n      procedures and internal control over financial                              \n      reporting;                                                                  \n                                                                                  \n                                                   \n      adverse judicial or regulatory proceedings;  \n                                                   \n                                                                                  \n      changes in applicable accounting policies, including the introduction of    \n      new accounting standards;                                                   \n                                                                                  \n                                                                                  \n      our ability to determine accurate values of certain assets and              \n      liabilities;                                                                \n                                                                                  \n                                                                                  \n      occurrence of natural or man-made disasters or calamities, including        \n      health emergencies, the spread of infectious                                \n      diseases, epidemics or pandemics, an outbreak or escalation of hostilities  \n      or other geopolitical instabilities, the effects of climate change or       \n      extraordinary events beyond our control, and our ability to deal            \n      effectively with disruptions caused by                                      \n      the foregoing;                                                              \n                                                                                  \n                                                                                  \n      our ability to maintain the security of our financial, accounting,          \n      technology, data processing and other                                       \n      operational systems and facilities;                                         \n                                                                                  \n                                                                                  \n      our ability to withstand disruptions that may be caused by any failure of   \n      our operational systems or those of                                         \n      third parties; and                                                          \n                                                                                  \n                                                                                  \n      our ability to effectively defend ourselves against cyber attacks and       \n      other attempts by unauthorized parties to                                   \n      access our or our customers\u0092 information or to disrupt our systems.          \n                                                                                  \nAdditional factors that may cause future\nresults to differ materially from forward-looking statements can be found in\nportions of our periodic and current reports filed with the SEC and incorporated\nby reference in this prospectus. These factors include, for example, those\ndiscussed under\nthe caption \u0093Risk Factors\u0094 in our most recent annual and quarterly reports, to\nwhich reference is hereby made.\n\nAny\nforward-looking statements made by or on behalf of us in this prospectus, any\napplicable prospectus supplement or in a document incorporated by reference into\nthis prospectus speak only as of the date of this prospectus, the prospectus\nsupplement or\nthe document incorporated by reference, as the case may be. We do not undertake to\nupdate any forward-looking statements. You should, however, consult any further\ndisclosures of a forward-looking nature we may make in any subsequent Annual\nReports\non Form 10-K, Quarterly Reports on Form 10-Q or Current Reports on Form 8-K.\n\n9\n\nUSE OF PROCEEDS\n\nUnless otherwise described in the applicable prospectus supplement, we will\ncontribute the net proceeds that we receive from the sale of the\nsecurities offered by use of this prospectus and the applicable prospectus\nsupplement to the IHC, which will use those net proceeds for general corporate\npurposes. General corporate purposes may include investments in our subsidiaries,\npayments of\ndividends to us, extensions of credit to us or our subsidiaries or the financing\nof possible acquisitions or business expansion. Net proceeds may be temporarily\ninvested pending application for their stated purpose. Interest on our debt\nsecurities\n(including interest on the debt securities offered by use of this prospectus) and\ndividends on our equity securities (including dividends on the preferred stock or\ncommon stock offered by use of this prospectus), as well as redemptions or\nrepurchases of our outstanding securities, will be made using amounts we receive\nas dividends or extensions of credit from the IHC or as dividends from the Bank.\n\n10\n\nDESCRIPTION OF DEBT SECURITIES\n\nGeneral\n\nWe have described below some\ngeneral terms that may apply to the debt securities we may offer by use of this\nprospectus and an applicable prospectus supplement. We will describe the\nparticular terms of any debt securities we offer to you in the prospectus\nsupplement relating to\nthose debt securities.\n\nThe debt securities will be either senior debt securities or subordinated debt\nsecurities. The senior debt\nsecurities will be issued under the senior indenture, and the subordinated debt\nsecurities will be issued under the subordinated indenture. The debt securities\nand the indentures are governed by the laws of the State of New York.\n\nThe following summary is not complete. You should refer to the indentures, copies\nof which are exhibits to the registration statement.\n\nThe indentures do not limit the amount of debt securities that we may issue. Each\nof the indentures provides that we may issue debt securities\nup to the principal amount we authorize from time to time. The senior debt\nsecurities will be unsecured and will have the same rank as all of our other\nunsecured and unsubordinated debt. The subordinated debt securities will be\nunsecured and will be\nsubordinated and junior to all Senior Indebtedness as defined below under \u0093\u0097\nSubordinated Debt Securities \u0097 Subordination.\u0094\n\nWe are a holding company that holds the stock of the Bank and the IHC. We conduct\nsubstantially all of our operations through subsidiaries,\nincluding the Bank and the IHC. As a result, claims of the holders of our\nsecurities will generally have a junior position to claims of creditors of our\nsubsidiaries. Claims of our subsidiaries\u0092 creditors other than JPMorgan Chase\ninclude\nsubstantial amounts of deposit liabilities, long-term debt and other liabilities.\nIn addition, we are obligated to contribute to the IHC substantially all the net\nproceeds that we receive from the issuance of securities (including any securities\noffered by use of this prospectus), and the ability of the Bank and the IHC to\nmake payments to us is limited. As a result of these arrangements, our ability to\nmake various payments is dependent on our receiving dividends from the Bank and\ndividends and extensions of credit from the IHC. These limitations could affect\nour ability to pay interest on our debt securities, pay dividends on our preferred\nstock and common stock, redeem or repurchase outstanding securities, and fulfill\nour\nother payment obligations.\n\nWe may issue the debt securities in one or more separate series of senior debt\nsecurities and/or subordinated\ndebt securities. We will specify in the prospectus supplement relating to the\nparticular series of debt securities being offered the particular amounts, prices\nand terms of those debt securities. These terms may include:\n                                                  \n      the title and type of the debt securities;  \n                                                  \n                                                                                  \n      any limit on the aggregate principal amount or aggregate initial offering   \n      price of the debt securities;                                               \n                                                                                  \n                                                  \n      the purchase price of the debt securities;  \n                                                  \n                                                                                  \n      the dates on which the principal of the debt securities will be payable     \n      and the amount payable upon acceleration;                                   \n                                                                                  \n                                                                                  \n      the interest rates of the debt securities, including the interest rates,    \n      if any, applicable to overdue payments,                                     \n      or the method for determining those rates;                                  \n                                                                                  \n                                                           \n      the interest payment dates for the debt securities;  \n                                                           \n                                                                     \n      the places where payments may be made on the debt securities;  \n                                                                     \n                                                                                  \n      any mandatory or optional redemption provisions applicable to the debt      \n      securities;                                                                 \n                                                                                  \n                                                                                 \n      any sinking fund or similar provisions applicable to the debt securities;  \n                                                                                 \n                                                                                  \n      the authorized denominations of the debt securities, if other than $1,000   \n      and integral multiples of $1,000;                                           \n                                                                                  \n11\n                                                                                  \n      if denominated in a currency other than U.S. dollars, the currency or       \n      currencies, including composite currencies,                                 \n      in which payments on the debt securities will be payable (which currencies  \n      may be different for principal, premium and interest payments);             \n                                                                                  \n                                                                                \n      any conversion or exchange provisions applicable to the debt securities;  \n                                                                                \n                                                                                  \n      any addition to, deletion from or change in the events of default           \n      applicable to the debt securities;                                          \n                                                                                  \n                                                                                  \n      any addition to, deletion from or change in the covenants applicable to     \n      the debt securities; and                                                    \n                                                                                  \n                                                        \n      any other specific terms of the debt securities.  \n                                                        \nWe may issue some of the debt securities as original issue discount debt\nsecurities. Original issue discount debt securities will bear no\ninterest or will bear interest at a below-market rate and will be sold at a\ndiscount below their stated principal amount. The prospectus supplement will\ncontain any special tax, accounting or other information relating to original\nissue discount\ndebt securities. If we offer other kinds of debt securities, including debt\nsecurities linked to an index or payable in currencies other than U.S. dollars,\nthe prospectus supplement relating to those debt securities will also contain any\nspecial\ntax, accounting or other information relating to those debt securities.\n\nWe will issue the debt securities only in registered form without\ncoupons. The indentures permit us to issue debt securities of a series in\ncertificated form or in permanent global form. You will not be required to pay a\nservice charge for any transfer or exchange of debt securities, but we may require\npayment of\nany taxes or other governmental charges.\n\nWe will pay principal of, and premium, if any, and interest, if any, on the debt\nsecurities at\nthe corporate trust office in New York City of our paying agent, The Bank of New\nYork Mellon, or any successor paying agent that we may designate. You may also\nmake transfers or exchanges of debt securities at that location. We also have the\nright\nto pay interest on any debt securities by check mailed to the registered holders\nof the debt securities at their registered addresses. In connection with any\npayment on a debt security, we may require the holder to certify information to\nus. In the\nabsence of that certification, we may rely on any legal presumption to enable us\nto determine our responsibilities, if any, to deduct or withhold taxes,\nassessments or governmental charges from the payment.\n\nThe indentures do not limit our ability to enter into a highly leveraged\ntransaction or provide you with any special protection in the event\nof such a transaction. In addition, neither of the indentures provides special\nprotection in the event of a sudden or dramatic decline in our credit quality\nresulting from a takeover, recapitalization or similar restructuring of JPMorgan\nChase.\n\nWe may issue debt securities upon the exercise of warrants or upon exchange or\nconversion of exchangeable or convertible debt securities. The\nprospectus supplement will describe the specific terms of any of those warrants or\nexchangeable or convertible securities. It will also describe the specific terms\nof the debt securities or other securities issuable upon the exercise, exchange or\nconversion of those securities. See \u0093Description of Warrants\u0094 below.\n\nEach of the indentures contains a provision that, if made\napplicable to any series of senior or subordinated debt securities, respectively,\npermits us to elect:\n                                                                                  \n      defeasance, which would discharge us from all of our obligations (subject   \n      to limited exceptions) with respect to                                      \n      any debt securities of that series then outstanding, and/or                 \n                                                                                  \n                                                                                  \n      covenant defeasance, which would release us from our obligations under      \n      specified covenants, including, with                                        \n      respect to any series of senior securities, the covenant described under    \n      \u0093Senior Debt Securities\u0097Limitation on Disposition of Stock of the Bank\u0094.       \n                                                                                  \n12\n\nTo make either of the above elections, we must deposit in trust with the\nrespective trustee money\nand/or U.S. government obligations (as defined below) which, through the payment\nof principal and interest in accordance with their terms, will provide sufficient\nmoney, without reinvestment, to repay in full those senior or subordinated debt\nsecurities, as the case may be. As used in the indentures, \u0093U.S. government\nobligations\u0094 are: (1) direct obligations of the United States or of an agency or\ninstrumentality of the United States, in either case that are, or are guaranteed\nas, full faith and credit obligations of the United States and that are not\nredeemable by the issuer; and (2) certain depositary receipts with respect to an\nobligation referred to in clause (1).\n\nAs a condition to defeasance or covenant defeasance, we must deliver to the\ntrustee an opinion of counsel that the holders of the senior or\nsubordinated debt securities, as the case may be, will not recognize income, gain,\nor loss for federal income tax purposes as a result of the defeasance or covenant\ndefeasance and will be subject to federal income tax on the same amount, in the\nsame\nmanner and at the same times as would have been the case if defeasance or covenant\ndefeasance had not occurred. That opinion, in the case of defeasance but not\ncovenant defeasance, must refer to and be based upon a ruling received by us from,\nor\npublished by, the Internal Revenue Service or be based upon a change in applicable\nfederal income tax law.\n\nIf we exercise our covenant\ndefeasance option with respect to a particular series of debt securities, then\neven if there were a default under the defeased covenant, payment of those debt\nsecurities could not be accelerated. We may exercise our defeasance option with\nrespect to\na particular series of debt securities even if we previously had exercised our\ncovenant defeasance option. If we exercise our defeasance option, payment of those\ndebt securities may not be accelerated because of any event of default. If we\nexercise\nour covenant defeasance option and an acceleration were to occur, the realizable\nvalue at the acceleration date of the money and U.S. government obligations in the\ndefeasance trust could be less than the principal and interest then due on those\ndebt\nsecurities. This is because the required deposit of money and/or U.S. government\nobligations in the defeasance trust is based upon scheduled cash flows rather than\nmarket value, which will vary depending upon interest rates and other factors.\n\nWe and the trustee under each indenture may modify that indenture with the consent\nof the holders of not less than a majority in principal\namount of outstanding debt securities of any series issued under that indenture\naffected by the modification. However, without the consent of each affected\nholder, no such modification may:\n                                                        \n      change the stated maturity of any debt security;  \n                                                        \n                                                                                  \n      reduce the principal amount of, or premium, if any, on, any debt security;  \n                                                                                  \n                                                                                  \n      change the rate or method of computation of the interest on any debt        \n      security;                                                                   \n                                                                                  \n                                                                                  \n      reduce the amount of the principal of an original issue discount debt       \n      security that would be due and payable upon                                 \n      a declaration of acceleration of the maturity thereof;                      \n                                                                                  \n                                                                                  \n      reduce the amount of, or postpone the date fixed for, the payment of any    \n      sinking fund or analogous obligation;                                       \n                                                                                  \n                                                                                \n      change the currency or currencies in which any debt security is payable;  \n                                                                                \n                                                                                  \n      impair the right to institute suit for the enforcement of any payment on a  \n      debt security on or after the stated                                        \n      maturity thereof (or, in the case of redemption, on or after the            \n      redemption date);                                                           \n                                                                                  \n                                                                                  \n      reduce the percentage of holders of outstanding debt securities of any      \n      series required to consent to any                                           \n      modification, amendment or any waiver under the applicable indenture; or    \n                                                                                  \n                                                                                  \n      change the provisions in the applicable indenture that relate to its        \n      modification or amendment.                                                  \n                                                                                  \nIn addition, we and the trustee under each indenture may modify that indenture\nwithout the consent of the holders of\ndebt securities of any series for any of the following purposes:\n                                                            \n      to evidence the succession of another company to us;  \n                                                            \n13\n                                                                                  \n      to add to our covenants or to surrender any right or power conferred upon   \n      us;                                                                         \n                                                                                  \n                                                \n      to add any additional events of default;  \n                                                \n                                                                                  \n      to permit or facilitate the issuance of debt securities in bearer form,     \n      certificated form or global form;                                           \n                                                                                  \n                                                                                  \n      to add to, change or eliminate any of the provisions of the applicable      \n      indenture in respect of all or any series                                   \n      of debt securities, provided that any such addition, change or elimination  \n      will neither (i) apply to any debt security issued prior to the execution   \n      of such amendment and entitled to the benefit of such provision nor (ii)    \n      modify the rights of the                                                    \n      holders of any such debt securities with respect to such provision;         \n                                                                                  \n                                                                                  \n      to conform the text of the applicable indenture or any debt securities to   \n      any provision of the \u0093Description                                            \n      of Debt Securities\u0094 in this prospectus or a similarly captioned section in   \n      any applicable prospectus supplement relating to the offering of debt       \n      securities;                                                                 \n                                                                                  \n                                                                                \n      to provide security for or a guarantee of any series of debt securities;  \n                                                                                \n                                                                        \n      to establish the form or terms of any series of debt securities;  \n                                                                        \n                                                                                  \n      to provide for a successor trustee or the appointment of more than one      \n      trustee; or                                                                 \n                                                                                  \n                                                                                  \n      to cure any ambiguity, to correct or supplement any provision of the        \n      applicable indenture which may be                                           \n      inconsistent with any other provision thereof, or to make any other         \n      provisions as we may deem necessary or desirable, provided such amendment   \n      does not adversely affect the interests of the holders of any series of     \n      debt securities in any material                                             \n      respect.                                                                    \n                                                                                  \nEach indenture allows us, without the consent of the holders of the debt\nsecurities of any series issued under\nthat indenture, to consolidate or merge with any other entity, to convey, transfer\nor lease all or substantially all of our assets to another entity, or to permit\nanother entity to merge into JPMorgan Chase, provided that:\n\n(1) the successor is a corporation, association, company or business trust\norganized under U.S. laws;\n\n(2) the successor, if not us, assumes our obligations on the debt securities and\nunder the indentures;\n\n(3) after giving effect to the transaction, no event of default (or, in the case\nof the senior debt securities, a covenant breach under the\nsenior indenture), and no event which, after notice or lapse of time or both,\nwould become an event of default (or, in the case of the senior debt securities, a\ncovenant breach under the senior indenture), shall have occurred and be\ncontinuing; and\n\n(4) other specified conditions are met.\n\nIn addition, each indenture allows us, without the consent of the holders of the\ndebt securities of any series issued under that indenture, to\nconvey, transfer or lease all or substantially all of our assets to one or more of\nour subsidiaries.\n\nSenior Debt Securities\n\nThe senior debt securities will be direct, unsecured general obligations of\nJPMorgan Chase and will constitute Senior Indebtedness of JPMorgan\nChase. For a definition of \u0093Senior Indebtedness,\u0094 see \u0093\u0097 Subordinated Debt\nSecurities \u0097 Subordination\u0094 below.\n\nLimitation on Disposition of Stock of the Bank. Unless otherwise specified in the\nprospectus supplement relating to a particular series\nof debt securities, the senior indenture contains a covenant by us that, so long\nas any of the senior debt securities are outstanding, neither we nor any\nIntermediate Subsidiary (as defined below) will sell, assign, grant a security\ninterest in or\notherwise dispose of any shares of voting stock of the Bank, or any securities\nconvertible into, or options, warrants or rights to purchase shares of voting\nstock of the Bank, except to JPMorgan Chase or an Intermediate Subsidiary. In\naddition, the\ncovenant provides that neither we nor any Intermediate\n\n14\n\nSubsidiary will permit the Bank to issue any shares of its voting stock, or\nsecurities convertible into, or options, warrants or rights to purchase shares of\nits voting stock, nor will we permit\nany Intermediate Subsidiary that owns any shares of voting stock of the Bank, or\nsecurities convertible into, or options, warrants or rights to purchase shares of\nthe Bank\u0092s voting stock, to cease to be an Intermediate Subsidiary.\n\nThe above covenant is subject to our rights in connection with a consolidation or\nmerger of JPMorgan Chase with another entity or a\nconveyance, transfer or lease of all or substantially all of our assets to another\nentity. The covenant also will not apply if both:\n\n(1) the disposition in question is made for fair market value, as determined by\nthe board of directors of JPMorgan Chase or the\nIntermediate Subsidiary; and\n\n(2) after giving effect to the disposition, we and any one or more of our\nIntermediate\nSubsidiaries will collectively own at least 80% of the issued and outstanding\nvoting stock of the Bank or any successor to the Bank, free and clear of any\nsecurity interest.\n\nThe above covenant also does not restrict the Bank from being consolidated with or\nmerged into another domestic banking institution if, after\nthe merger or consolidation, (A) JPMorgan Chase, or its successor, and any one or\nmore Intermediate Subsidiaries own at least 80% of the voting stock of the\nresulting bank and (B) treating for purposes of the senior indenture the resulting\nbank as\nthe Bank, no covenant breach, event of default or event which, after notice or\nlapse of time or both, would become a covenant breach or event of default, shall\nhave happened and be continuing.\n\nThe senior indenture defines an \u0093Intermediate Subsidiary\u0094 as a subsidiary (1) that\nis organized under the laws of any domestic\njurisdiction and (2) of which all the shares of capital stock, and all securities\nconvertible into, and options, warrants and rights to purchase shares of capital\nstock, are owned directly by JPMorgan Chase, free and clear of any security\ninterest.\nAs used above, \u0093voting stock\u0094 means a class of stock having general voting power\nunder ordinary circumstances to elect at least a majority of the board of\ndirectors, managers or trustees irrespective of the happening of a contingency.\n\nDefaults andWaivers. Unless otherwise specified in the applicable prospectus\nsupplement, under the senior indenture, any one of\nthe following events will be an event of default with respect to the senior debt\nsecurities of any series:\n\n(1) default in\nthe payment of principal of (or premium, if any, on) any senior debt securities of\nthat series and continuance of that default for 30 days;\n\n(2) default in the payment of interest on any senior debt securities of that\nseries and continuance of that default for 30\ndays;\n\n(3) specified events of bankruptcy, insolvency or reorganization of JPMorgan\nChase; and\n\n(4) any other event of default specified with respect to senior debt securities of\nthat series.\n\nSenior debt securities issued by us prior to December 31, 2016 (the \u0093Pre-2017\nSenior Debt\u0094) contain events of default that are\ndifferent from those set forth above. In particular:\n                                                                                  \n      The events of default applicable to the Pre-2017 Senior Debt do not         \n      provide for a 30-day cure period with respect                               \n      to any failure by us to pay the principal of those senior debt securities;  \n                                                                                  \n                                                                                  \n      Most series of Pre-2017 Senior Debt contain an additional event of default  \n      that is applicable if we fail to                                            \n      perform any of the covenants contained in the terms and conditions of, or   \n      the governing instrument for, those senior debt securities and that         \n      failure continues for 90 days; and                                          \n                                                                                  \n                                                                                  \n      The events of default applicable to certain series of Pre-2017 Senior Debt  \n      provide that specified events of                                            \n      bankruptcy, insolvency or reorganization of JPMorgan Chase Bank, N.A.       \n      would constitute an event of default with respect to those senior debt      \n      securities.                                                                 \n                                                                                  \n15\n\nAccordingly, if we fail to pay the principal of any series of Pre-2017 Senior Debt\nwhen due, the\nholders of such senior debt securities would be entitled to declare their\nsecurities due and payable immediately, whereas holders of the senior debt\nsecurities of any series would not be entitled to accelerate those senior debt\nsecurities until 30\ndays after our failure to pay the principal of those senior debt securities. In\naddition, holders of the senior debt securities will not have the benefit of the\nadditional events of default described above that are applicable to the Pre-2017\nSenior\nDebt.\n\nUnder the senior indenture, if any event of default with respect to the senior\ndebt securities of any series occurs and is\ncontinuing, either the trustee or the holders of not less than 25% in principal\namount of the outstanding senior debt securities of that series may declare the\nprincipal amount (or, if the senior debt securities of that series are original\nissue\ndiscount senior debt securities, a specified portion of the principal amount) of\nall senior debt securities of that series to be due and payable immediately. No\nsuch declaration is required upon certain specified events of bankruptcy,\ninsolvency or\nreorganization. Subject to the conditions set forth in the senior indenture, the\nholders of a majority in principal amount of the outstanding senior debt\nsecurities of that series may annul the declaration and waive past defaults,\nexcept uncured\npayment defaults and other specified defaults.\n\nWe will describe in the prospectus supplement any particular provisions relating\nto the\nacceleration of the maturity of a portion of the principal amount of original\nissue discount senior debt securities upon an event of default.\n\nSubordinated Debt Securities\n\nThe\nsubordinated debt securities will be direct, unsecured general obligations of\nJPMorgan Chase. The subordinated debt securities will be subordinate and junior in\nright of payment to all Senior Indebtedness.\n\nUnless otherwise provided in the prospectus supplement relating to a particular\nseries of subordinated debt securities, holders of the\nsubordinated debt securities may not accelerate the maturity of the subordinated\ndebt securities, except in the event of our bankruptcy, reorganization or\ninsolvency, and may not accelerate the subordinated debt securities if we fail to\npay\nprincipal or interest or fail to perform any other agreement in the subordinated\ndebt securities or the subordinated indenture. See \u0093\u0097 Defaults and Waivers\u0094 below.\n\nSubordination. The subordinated debt securities will be subordinate and junior in\nright of payment to all Senior Indebtedness whether\noutstanding on the date the subordinated indenture became effective or created,\nassumed or incurred after that date.\n\nThe subordinated\nindenture defines \u0093Senior Indebtedness\u0094 to mean the principal of, and premium, if\nany, and interest on all of our indebtedness for money borrowed, including all\nindebtedness for money borrowed by another person that we guarantee; similar\nobligations arising from off-balance sheet guarantees and direct credit\nsubstitutes; all obligations for claims in respect of derivative products such as\ninterest rate and foreign exchange contracts, commodity contracts and similar\narrangements; and\nany deferrals, renewals or extensions of any of the foregoing. However, Senior\nIndebtedness does not include indebtedness that is stated not to be senior to or\nto have the same rank as the subordinated debt securities or other securities\nhaving the\nsame rank as or that are subordinated to the subordinated debt securities. In\nparticular, Senior Indebtedness does not include (A) the subordinated debt\nsecurities issued under the subordinated indenture, (B) the subordinated\nindebtedness\nissued under the amended and restated indenture, dated as of December 15, 1992, as\namended, between us and U.S. Bank Trust National Association, as trustee, (C) the\nsubordinated indebtedness issued under the indenture, dated as of October 21,\n2010,\nbetween us and U.S. Bank Trust National Association, as trustee, and (D) other\ndebt of JPMorgan Chase that is expressly stated to have the same rank as or not to\nrank senior to the subordinated debt securities or other securities having the\nsame\nrank as or that are subordinated to the subordinated debt securities.\n\n16\n\nUnder the subordinated indenture, we may not make any payment on the subordinated\ndebt securities\nin the event:\n                                                                                  \n      we have failed to make full payment of all amounts of principal, and        \n      premium, if any, and interest, if any, due                                  \n      on all Senior Indebtedness; or                                              \n                                                                                  \n                                                                                  \n      there shall exist any event of default on any Senior Indebtedness           \n      permitting the holders thereof to accelerate                                \n      the maturity thereof or any event which, with notice or lapse of time or    \n      both, would become such an event of default.                                \n                                                                                  \nIn addition, upon our dissolution, winding-up, liquidation or reorganization\n(whether in bankruptcy, insolvency or receivership proceedings or\notherwise) we must pay to the holders of Senior Indebtedness the full amounts of\nprincipal of, and premium, if any, and interest, if any, on the Senior\nIndebtedness before any payment or distribution is made on the subordinated debt\nsecurities.\n\nNo series of our subordinated debt securities (other than our outstanding junior\nsubordinated indebtedness) is subordinated to any other\nseries of subordinated debt securities or to any other subordinated indebtedness\nof JPMorgan Chase referred to above. However, due to the subordination provisions\nof the various series of subordinated indebtedness issued by us and our\npredecessor\ninstitutions, in the event of our dissolution, winding-up, liquidation,\nreorganization or insolvency, holders of the subordinated debt securities that may\nbe offered by use of this prospectus and an applicable prospectus supplement may\nrecover less,\nratably, than holders of some of our other series of outstanding subordinated\nindebtedness and more, ratably, than holders of other series of our outstanding\nsubordinated indebtedness. In addition, holders of the subordinated debt\nsecurities\nmay be fully subordinated to interests held by the U.S. government in the event\nthat we enter into a receivership, insolvency, liquidation or similar proceeding.\n\nNo Limitation on Disposition of Voting Stock of the Bank. The subordinated\nindenture does not contain a covenant prohibiting us from\nselling or otherwise disposing of any shares of voting stock of the Bank, or\nsecurities convertible into, or options, warrants or rights to purchase shares of\nvoting stock of the Bank. The subordinated indenture also does not prohibit the\nBank from\nissuing any shares of its voting stock or securities convertible into, or options,\nwarrants or rights to purchase shares of its voting stock.\n\nDefaults and Waivers. Unless otherwise specified in the prospectus supplement\nrelating to a particular series of subordinated debt\nsecurities, the subordinated indenture defines an event of default with respect to\nany series of subordinated debt securities as follows:\n                                                                                  \n      specified events of bankruptcy, reorganization or insolvency of JPMorgan    \n      Chase; and                                                                  \n                                                                                  \n                                                                                  \n      any other event specified with respect to subordinated debt securities of   \n      that series.                                                                \n                                                                                  \nIf any event of default with respect to subordinated debt securities of any series\noccurs and is continuing, either the trustee or the holders\nof not less than 25% in principal amount of the outstanding subordinated debt\nsecurities of that series may declare the principal amount (or, if the\nsubordinated debt securities of that series are original issue discount\nsubordinated debt\nsecurities, a specified portion of the principal amount) of all subordinated debt\nsecurities of that series to be due and payable immediately. No such declaration\nis required upon certain specified events of bankruptcy, reorganization or\ninsolvency.\nSubject to the conditions set forth in the subordinated indenture, the holders of\na majority in principal amount of the outstanding subordinated debt securities of\nthat series may annul the declaration and waive past defaults, except uncured\npayment\ndefaults.\n\nWe will describe in the prospectus supplement any particular provisions relating\nto the acceleration of the maturity of a\nportion of the principal amount of original issue discount subordinated debt\nsecurities upon an event of default. In the event of the bankruptcy, liquidation,\nreorganization or insolvency of JPMorgan Chase, any right to enforce that payment\nin cash\nwould be subject to the broad equity powers of a federal bankruptcy court and to\nits determination of the nature and status of the payment claims of the holders of\nthe subordinated debt securities.\n\n17\n\nUnless otherwise provided in the prospectus supplement relating to a particular\nseries of\nsubordinated debt securities, there will be no right of acceleration of the\npayment of principal of the subordinated debt securities of that series upon a\ndefault in the payment of principal or interest or a default in the performance of\nany\ncovenant or agreement in the subordinated debt securities or the subordinated\nindenture. In the event of a default in the payment of principal or interest or a\ndefault in the performance of any covenant or agreement in the subordinated debt\nsecurities or the subordinated indenture, the trustee may, subject to specified\nlimitations and conditions, seek to enforce that payment or the performance of\nthat covenant or agreement.\n\nCovenant Breach\n\nUnder each indenture, a\n\u0093covenant breach\u0094 would occur with respect to the debt securities of any series\nissued under that indenture if we fail to perform or breach any of the covenants\ncontained in that indenture (in the case of the senior indenture, other than a\nfailure to pay principal of or interest on the senior debt securities) and that\nfailure or breach continues for 90 days after the trustee under that indenture or\nthe holders of not less than 25% in principal amount of the outstanding debt\nsecurities\nof that series give written notice of that failure or breach. Under each\nindenture, neither the trustee nor the holders of the debt securities will be\nentitled to accelerate the maturity of the debt securities as a result of any\ncovenant breach.\n\nIf a covenant breach or event of default with respect to the debt securities of\nany series occurs and is continuing, the relevant trustee\nmay in its discretion proceed to protect and enforce its rights and the rights of\nthe holders of those debt securities by such appropriate judicial proceedings as\nthe trustee deems most effectual to protect and enforce any such rights, whether\nfor\nthe specific enforcement of any covenant or agreement in the relevant indenture,\nin aid of the exercise of any power granted in that indenture, or to enforce any\nother proper remedy.\n\nLimitation of Suits\n\nUnder each\nindenture, a holder of the debt securities of any series issued under that\nindenture will not have the right to institute any proceeding with respect to that\nindenture or those debt securities unless:\n                                                                                  \n      the holder has given the trustee written notice of a continuing covenant    \n      breach or event of default with respect                                     \n      to those debt securities;                                                   \n                                                                                  \n                                                                                  \n      the holders of not less than 25% in principal amount of those debt          \n      securities at the time outstanding have made a                              \n      written request to the trustee to institute proceedings in respect of the   \n      covenant breach or event of default, and offered the trustee indemnity      \n      reasonably satisfactory to it; and                                          \n                                                                                  \n                                                                                  \n      the trustee has not received from the holders of a majority in principal    \n      amount of those debt securities at the                                      \n      time outstanding a direction inconsistent with such request, and has        \n      failed to institute any such proceeding, for 60 days after receipt of such  \n      notice, request and offer of indemnity.                                     \n                                                                                  \nThe foregoing limitations will not apply to any suit instituted by holders of the\ndebt securities for the enforcement of any payment of\nprincipal or interest on or after the date when due.\n\nOther Provisions of the Indentures\n\nEach of the indentures requires the relevant trustee, within 90 days after the\noccurrence of a default known to it with respect to the debt\nsecurities of any series issued under that indenture, to give the holders of those\ndebt securities notice of the default if uncured or not waived. The trustee may\nwithhold the notice if it determines in good faith that the withholding of the\nnotice\nis in the interest of those holders. However, the trustee may not withhold the\nnotice in the case of a default in the payment of principal or interest. The\ntrustee may not give the above notice until at least 60 days after the occurrence\nof a\ndefault in the performance of a covenant in the indenture, other than, in the case\nof the senior indenture, a covenant to pay principal of or interest on the senior\ndebt securities. The term \u0093default\u0094 for the purpose of this provision\nmeans any event that is, or after notice or lapse of time or both would become, a\ncovenant breach or event of default with respect to the debt securities.\n\n18\n\nOther than the duty to act with the required standard of care during a default,\nthe trustee under\neach of the indentures is not obligated to exercise any of its rights or powers\nunder that indenture at the request or direction of any of the holders of the debt\nsecurities issued under that indenture, unless the holders have offered to the\ntrustee\nreasonable security or indemnity. Each of the indentures provides that the holders\nof a majority in principal amount of the debt securities issued under that\nindenture may direct the time, method and place of conducting any proceeding for\nany remedy\navailable to the trustee, or exercising any trust or other power conferred on the\ntrustee. However, the trustee may decline to act if the direction is contrary to\nlaw or the indenture, and the trustee may take any other action deemed proper by\nthe\ntrustee which is not inconsistent with such direction.\n\nEach of the indentures includes a covenant requiring us to file annually with the\nrelevant trustee a certificate stating that there exists no covenant breach, event\nof default or event that is, or after notice or lapse of time or both would\nbecome, a covenant breach or event of default under the relevant indenture, or if\nany such\ndefault exists, specifying such default.\n\nInformation Concerning The Trustees\n\nWe and our subsidiaries may maintain deposits or conduct other banking\ntransactions with the trustees under the senior indenture and the\nsubordinated indenture in the ordinary course of business. Deutsche Bank Trust\nCompany Americas is a trustee under certain of our existing indentures pursuant to\nwhich we have issued and outstanding series of senior debt securities. U.S. Bank\nTrust National Association is a trustee under certain of our existing indentures\npursuant to which we have issued and outstanding series of subordinated debt\nsecurities.\n\nInsolvency and Resolution Considerations\n\nThe debt securities offered by use of this prospectus constitute \u0093loss-absorbing\ncapacity\u0094 within the meaning of the rules issued by\nthe Board of Governors of the Federal Reserve System (the \u0093Federal Reserve\u0094).\nFederal Reserve rules require that JPMorgan Chase & Co. (the \u0093Parent Company\u0094)\nmaintain minimum levels of unsecured external long-term debt and\nother loss-absorbing capacity with specific terms for purposes of recapitalizing\nJPMorgan Chase\u0092s operating subsidiaries if the Parent Company were to enter into a\nresolution either:\n                                                                                  \n      in a bankruptcy proceeding under Chapter 11 of the U.S. Bankruptcy Code,    \n      or                                                                          \n                                                                                  \n                                                                                  \n      in a receivership administered by the Federal Deposit Insurance             \n      Corporation (\u0093FDIC\u0094) under Title II of                                        \n      the Dodd-Frank Act (\u0093Title II\u0094).                                              \n                                                                                  \nIf the Parent Company were to enter into a resolution, holders of the debt\nsecurities offered by use of this prospectus and other debt and equity securities\nof the Parent Company will absorb the losses of the Parent Company and its\nsubsidiaries.\n\nThe preferred \u0093single point of entry\u0094 strategy under JPMorgan Chase\u0092s resolution\nplan contemplates that only the Parent Company\nwould enter bankruptcy proceedings. JPMorgan Chase\u0092s subsidiaries would be\nrecapitalized, as needed, so that they could continue normal operations or\nsubsequently be divested or wound down in an orderly manner. As a result, the\nParent\nCompany\u0092s losses and any losses incurred by its subsidiaries would be imposed\nfirst on holders of the Parent Company\u0092s equity securities and thereafter on its\nunsecured creditors, including holders of the debt securities offered by use of\nthis prospectus and other debt securities. Claims of holders of those securities\nwould have a junior position to the claims of creditors of JPMorgan Chase\u0092s\nsubsidiaries and to the claims of priority (as determined by statute) and secured\ncreditors of the Parent Company.\n\nAccordingly, in a resolution of the Parent Company in bankruptcy, holders of the\ndebt securities offered\nby use of this prospectus and other debt securities of the Parent Company would\nrealize value only to the extent\n\n19\n\navailable to the Parent Company as a shareholder of JPMorgan Chase Bank, N.A. and\nits other subsidiaries, and only after any claims of priority and secured\ncreditors of the Parent Company have\nbeen fully repaid.\n\nThe FDIC has similarly indicated that a single-point-of-entry recapitalization\nmodel could be a desirable strategy to\nresolve a systemically important financial institution, such as the Parent\nCompany, under Title II. However, the FDIC has not formally adopted any specific\nresolution strategy.\n\nIf the Parent Company were to approach, or enter into, a resolution, none of the\nParent Company, the Federal Reserve or the FDIC is obligated\nto follow JPMorgan Chase\u0092s preferred resolution strategy, and losses to holders of\nthe debt securities offered by use of this prospectus and other debt and equity\nsecurities of the Parent Company, under whatever strategy is ultimately followed,\ncould be greater than they might have been under JPMorgan Chase\u0092s preferred\nstrategy.\n\n20\n\nDESCRIPTION OF PREFERRED STOCK\n\nGeneral\n\nUnder our certificate of\nincorporation, our board of directors is authorized, without further stockholder\naction, to issue up to 200,000,000 shares of preferred stock, $1 par value per\nshare, in one or more series, and to determine the voting powers and the\ndesignations,\npreferences and relative, participating, optional or other special rights, and\nqualifications, limitations or restrictions of each series. We may amend our\ncertificate of incorporation to increase or decrease the number of authorized\nshares of\npreferred stock in a manner permitted by our certificate of incorporation and the\nDelaware General Corporation Law (\u0093DGCL\u0094). As of the date of this prospectus, we\nhave the following issued and outstanding series of preferred stock, the\nterms of each of which we summarize below:\n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series I;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series Q;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series R;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series S;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series U;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series V;  \n                                                                        \n                                                                        \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series X;  \n                                                                        \n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series CC;  \n                                                                         \n                                                        \n      5.75% Non-Cumulative Preferred Stock, Series DD;  \n                                                        \n                                                        \n      6.00% Non-Cumulative Preferred Stock, Series EE;  \n                                                        \n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series FF;  \n                                                                         \n                                                        \n      4.75% Non-Cumulative Preferred Stock, Series GG;  \n                                                        \n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series HH;  \n                                                                         \n                                                                         \n      Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series II;  \n                                                                         \n                                                        \n      4.55% Non-Cumulative Preferred Stock, Series JJ;  \n                                                        \n                                                                         \n      3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK;  \n                                                                         \n                                                             \n      4.625% Non-Cumulative Preferred Stock, Series LL; and  \n                                                             \n                                                        \n      4.20% Non-Cumulative Preferred Stock, Series MM.  \n                                                        \nWe will describe the particular terms of any series of preferred stock being\noffered in the prospectus supplement relating to that series of\npreferred stock. Those terms may include:\n                                           \n      the number of shares being offered;  \n                                           \n                                                       \n      the title and liquidation preference per share;  \n                                                       \n                           \n      the purchase price;  \n                           \n                                                              \n      the dividend rate or method for determining that rate;  \n                                                              \n                                                  \n      the dates on which dividends will be paid;  \n                                                  \n                                                                                  \n      whether dividends will be cumulative or noncumulative and, if cumulative,   \n      the dates from which dividends will                                         \n      begin to accumulate;                                                        \n                                                                                  \n                                                             \n      any applicable redemption or sinking fund provisions;  \n                                                             \n                                             \n      any applicable conversion provisions;  \n                                             \n                                                                                  \n      whether we have elected to offer depositary shares representing that        \n      series of preferred stock; and                                              \n                                                                                  \n                                                                                  \n      any additional dividend, liquidation, redemption, sinking fund and other    \n      rights and restrictions applicable to                                       \n      that series of preferred stock.                                             \n                                                                                  \n21\n\nIf the terms of any series of preferred stock being offered differ from the terms\nset forth\nbelow, we will also disclose those different terms in the prospectus supplement\nrelating to that series of preferred stock. The following summary is not complete.\nYou should also refer to our certificate of incorporation and to the certificate\nof\ndesignations relating to the series of the preferred stock being offered for the\ncomplete terms of that series of preferred stock. A form of certificate of\ndesignations is filed as an exhibit to the registration statement. We will file\nthe\ncertificate of designations with respect to the particular series of preferred\nstock being offered with the SEC promptly after the offering of that series of\npreferred stock.\n\nThe preferred stock will, when issued against full payment of the purchase price\nrelating to a series of preferred stock, be fully paid and\nnonassessable. Unless otherwise specified in the prospectus supplement, in the\nevent we liquidate, dissolve or wind-up our business, each series of preferred\nstock being offered will have the same rank as to dividends and distributions as\nour\ncurrently outstanding preferred stock and each other series of preferred stock we\nmay offer in the future by use of this prospectus and an applicable prospectus\nsupplement. The preferred stock will have no preemptive rights.\n\nDividend Rights\n\nHolders of the preferred\nstock offered by use of this prospectus and an applicable prospectus supplement\nwill be entitled to receive, when, as and if declared by our board of directors or\nany duly authorized committee of our board, cash dividends at the rates and on the\ndates set forth in the prospectus supplement. Dividend rates may be fixed or\nvariable or both. Different series of preferred stock may be entitled to dividends\nat different dividend rates or based upon different methods of determination. We\nwill pay\neach dividend to the holders of record as they appear on our stock register (or,\nif applicable, the records of the depositary referred to under \u0093Description of\nDepositary Shares\u0094) on record dates determined by our board of directors or a\nduly authorized committee of our board. Dividends on any series of preferred stock\nmay be cumulative or noncumulative, as specified in the prospectus supplement. If\na dividend is not declared on any series of preferred stock for which dividends\nare\nnoncumulative, then the right of holders of that preferred stock to receive that\ndividend will be lost, and we will have no obligation to pay the dividend for that\ndividend period, whether or not dividends are declared for any future dividend\nperiod.\n\nUnless otherwise specified in the applicable prospectus supplement, each series of\npreferred stock that we offer by use of this\nprospectus and an applicable prospectus supplement will provide that we may not\ndeclare or pay or set aside for payment full dividends on any series of preferred\nstock ranking, as to dividends, equally with or junior to the series of preferred\nstock\nwe are offering unless we have previously declared and paid or set aside for\npayment, or we contemporaneously declare and pay or set aside for payment, full\ndividends (including cumulative dividends still owing, if any) on the series of\npreferred\nstock we are offering for, in the case of a series of noncumulative preferred\nstock, the most recently completed dividend period, or, in the case of a series of\ncumulative preferred stock, all past dividend periods. If we fail to pay dividends\nin\nfull as stated above, we may only declare dividends on equally ranking series of\npreferred stock pro rata so that the amount of dividends declared per share on the\nseries of preferred stock we are offering and the equally ranking series bear to\neach\nother the same ratio that accumulated and unpaid dividends per share on the series\nbeing offered and the other series bear to each other. We will not pay interest or\nany sum of money instead of interest in respect of any dividend that is not\ndeclared, or if declared is not paid, on any series of preferred stock we are\noffering.\n\nUnless otherwise specified in the applicable\nprospectus supplement, the preferred stock we offer by use of this prospectus and\nan applicable prospectus supplement will also provide that, unless we have paid or\ndeclared and set aside a sum sufficient for the payment thereof, in the case\nof a series of noncumulative preferred stock, full dividends on all outstanding\nshares of that preferred stock in respect of the most recently completed dividend\nperiod, or, in the case of a series of cumulative preferred stock, full dividends,\nincluding cumulative dividends, if any, owing on that preferred stock for all past\ndividend periods:\n                                                                                  \n      no dividend (other than a dividend in common stock or in any junior or      \n      equally ranking stock as to dividends and                                   \n      upon liquidation, dissolution or winding-up) will be declared or paid or a  \n      sum sufficient for the payment thereof set aside for such payment or other  \n      distribution declared or made upon our                                      \n                                                                                  \n22\n                                                      \n  common stock or upon any junior or equally ranking  \n  stock as to dividends or upon liquidation,          \n  dissolution or winding-up, and                      \n                                                      \n                                                                                  \n      no common stock or other capital stock ranking junior or equally as to      \n      dividends or upon liquidation, dissolution                                  \n      or winding-up will be redeemed, purchased or otherwise acquired for any     \n      consideration (or any moneys be paid to or made available for a sinking     \n      fund for the redemption of any shares of any such capital stock) by us,     \n      except:                                                                     \n                                                                                  \n                                                                                  \n  (1)  by conversion into or exchange for capital stock ranking junior to the     \n       preferred stock being offered;                                             \n                                                                                  \n                                                                                  \n  (2)  as a result of reclassification into capital stock ranking junior to the   \n       preferred stock being offered;                                             \n                                                                                  \n                                                                                  \n       through the use of the proceeds of a substantially contemporaneous sale    \n       of shares of capital stock ranking                                         \n       junior to the preferred stock being offered or, in the case of capital     \n  (3)  stock ranking on a parity with the preferred stock being offered, through  \n       the use of the proceeds of a substantially contemporaneous sale of other   \n       shares of capital stock ranking                                            \n       on a parity with the preferred stock being offered;                        \n                                                                                  \n                                                                                  \n       in the case of capital stock ranking on a parity with the preferred stock  \n       being offered, pursuant to pro rata                                        \n  (4)  offers to purchase all or a pro rata portion of the shares of preferred    \n       stock being offered and such capital stock ranking on a parity with the    \n       preferred stock being offered;                                             \n                                                                                  \n                                                                                  \n       in connection with the satisfaction of our obligations pursuant to any     \n  (5)  contract entered into in the ordinary                                      \n       course prior to the beginning of the most recently completed dividend      \n       period; or                                                                 \n                                                                                  \n                                                                                  \n       any purchase, redemption or other acquisition of capital stock ranking     \n       junior to the preferred stock being                                        \n       offered pursuant to any of our or our subsidiaries\u0092 employee, consultant    \n  (6)  or director incentive or benefit plans or arrangements (including any      \n       employment, severance or consulting arrangements) adopted before or after  \n       the issuance of the                                                        \n       preferred stock being offered).                                            \n                                                                                  \nHowever, the foregoing will not restrict our ability or the ability of any of our\naffiliates to engage in underwriting, stabilization, market-making or similar\ntransactions in our capital stock in the ordinary course of business. Subject to\nthe conditions described above, and not otherwise, dividends (payable in cash,\ncapital\nstock, or otherwise), as may be determined by our board of directors or a duly\nauthorized committee of our board, may be declared and paid on our common stock\nand any other capital stock ranking junior to or on a parity with the preferred\nstock\nbeing offered from time to time out of any assets legally available for such\npayment, and the holders of the preferred stock being offered will not be entitled\nto participate in those dividends.\n\nAs used in this prospectus, \u0093junior to the preferred stock being offered\u0094 and like\nterms refer to our common stock and any other\nclass or series of our capital stock over which the preferred stock being offered\nhas preference or priority, either as to dividends or upon liquidation,\ndissolution or winding-up, or both, as the context may require; \u0093parity preferred\nstock\u0094 and \u0093on a parity with the preferred stock being offered\u0094 and like terms\nrefer to any class or series of our capital stock that ranks on a parity with the\nshares of the preferred stock being offered, either as to dividends or\nupon liquidation, dissolution or winding-up, or both, as the context may require;\nand \u0093senior to the preferred stock being offered\u0094 and like terms refer to any\nclass or series of our capital stock that ranks senior to the preferred stock\nbeing offered, either as to dividends or upon liquidation, dissolution or winding-\nup, or both, as the context may require.\n\nUnless\notherwise specified in the applicable prospectus supplement, we will compute the\namount of dividends payable by annualizing the applicable dividend rate and\ndividing by the number of dividend periods in a year, except that the amount of\ndividends\npayable for any period greater or less than a full dividend period, other than the\ninitial dividend period, will be computed on the basis of a 360-day year\nconsisting of twelve 30-day months and, for any\nperiod less than a full month, the actual number of days elapsed in the period.\nDollar amounts resulting from that calculation will be rounded to the nearest\ncent, with one-half cent being rounded upward.\n\n23\n\nRights Upon Liquidation\n\nIn the event of our voluntary or involuntary liquidation, dissolution or winding-\nup, holders of each series of preferred stock that we offer by\nuse of this prospectus and an applicable prospectus supplement will be entitled to\nreceive and to be paid out of our assets legally available for distribution to our\nstockholders the amount set forth in the prospectus supplement plus, in the case\nof\na series of noncumulative preferred stock, an amount equal to any declared and\nunpaid dividends, without accumulation of undeclared dividends, if any, from the\nday following the immediately preceding dividend payment date, to, but not\nincluding, the\ndate of the liquidating distribution, but without accumulation of any unpaid\ndividends for prior dividend periods, or, in the case of a series of cumulative\npreferred stock, an amount equal to any accumulated and unpaid dividends, whether\nor not\ndeclared, before we make any payment or distribution on our common stock or on any\nother capital stock ranking junior to the preferred stock offered by use of this\nprospectus and an applicable prospectus supplement, and any stock having the same\nrank as that series of preferred stock upon our liquidation, dissolution or\nwinding-up. After the payment to such holders of the full preferential amounts to\nwhich they are entitled, such holders will have no right or claim to any of our\nremaining\nassets.\n\nIf, upon our voluntary or involuntary liquidation, dissolution or winding-up, we\nfail to pay in full the amounts payable with\nrespect to preferred stock offered by use of this prospectus and an applicable\nprospectus supplement, and any stock having the same rank as that series of\npreferred stock, the holders of the preferred stock and of that other stock will\nshare ratably\nin any such distribution of our assets in proportion to the full respective\ndistributions to which they are entitled. For any series of preferred stock\noffered by use of this prospectus and an applicable prospectus supplement, neither\nthe sale of\nall or substantially all of our property or business, nor our merger or\nconsolidation into or with any other entity will be considered a liquidation,\ndissolution or winding-up.\n\nRedemption\n\nThe applicable prospectus\nsupplement will indicate whether the series of preferred stock offered by use of\nthis prospectus and the applicable prospectus supplement is subject to redemption,\nin whole or in part, whether at our option or mandatorily and whether or not\npursuant\nto a sinking fund. The redemption provisions that may apply to a series of\npreferred stock offered, including the redemption dates, the redemption prices for\nthat series and whether those redemption prices will be paid in cash, stock or a\ncombination of cash and stock, will be set forth in the prospectus supplement. If\nthe redemption price is to be paid only from the proceeds of the sale of our\ncapital stock, the terms of the series of preferred stock may also provide that,\nif our\ncapital stock is not sold or if the amount of cash received is insufficient to pay\nin full the redemption price then due, the series of preferred stock will\nautomatically be converted into shares of the applicable capital stock pursuant to\nconversion provisions specified in the prospectus supplement.\n\nIf we are redeeming fewer than all the outstanding shares of preferred\nstock of any series, whether by mandatory or optional redemption, our board of\ndirectors or any duly authorized committee of our board will determine the method\nfor selecting the shares to be redeemed, which (unless otherwise specified in the\napplicable prospectus supplement) may be by lot or pro rata or in such other\nmanner as the board of directors or any duly authorized committee of our board\ndetermines to be equitable. From and after the redemption date, dividends will\ncease to\naccumulate on the shares of preferred stock called for redemption up to the\nredemption date and all rights of the holders of those shares, except the right to\nreceive the redemption price, will cease.\n\nIn the event that we fail to pay full dividends, including accumulated but unpaid\ndividends, if any, on any series of preferred stock offered,\nwe may not redeem that series in part and we may not purchase or acquire any\nshares of that series of preferred stock, except by a purchase or exchange offer\nmade on the same terms to all holders of that series of preferred stock.\n\n24\n\nConversion Rights\n\nThe prospectus supplement will state the terms, if any, on which shares of the\nseries of preferred stock offered by use of this prospectus and\nan applicable prospectus supplement are convertible into shares of our common\nstock or other securities. As described under \u0093\u0097 Redemption\u0094 above, under certain\ncircumstances, preferred stock may be mandatorily convertible into our\ncommon stock or another series of our preferred stock.\n\nVoting Rights\n\nExcept as indicated below or in the applicable prospectus supplement, or except as\nexpressly required by applicable law, the holders of the\npreferred stock offered by use of this prospectus and an applicable prospectus\nsupplement will not be entitled to vote. Unless otherwise indicated in the\nprospectus supplement, each share of preferred stock of each series will be\nentitled to one\nvote on matters on which holders of that series of preferred stock are entitled to\nvote. However, as more fully described under \u0093Description of Depositary Shares,\u0094\nif we use this prospectus and an applicable prospectus supplement to offer\ndepositary shares representing a fractional interest in a share of a series of\npreferred stock, each depositary share, in effect, will be entitled to that\nfraction of a vote, rather than a full vote. If (unless otherwise indicated in the\nprospectus\nsupplement) each full share of any series of preferred stock offered is entitled\nto one vote, the voting power of that series will depend on the number of shares\nin that series, and not on the aggregate liquidation preference or initial\noffering\nprice of the shares of that series of preferred stock.\n\nUnless otherwise specified in a prospectus supplement, if, at any time or times,\nthe equivalent of an aggregate of six quarterly dividends, whether or not\nconsecutive, for any series of preferred stock being offered has not been paid,\nthe number of directors constituting our board of directors will be automatically\nincreased by\ntwo and the holders of each outstanding series of preferred stock with such voting\nrights, together with holders of such other shares of any other class or series of\nparity preferred stock outstanding at the time upon which like voting rights have\nbeen conferred and are exercisable, which we refer to as \u0093voting parity stock,\u0094\nvoting together as a class, will be entitled to elect those additional two\ndirectors, which we refer to as \u0093preferred directors,\u0094 at that annual\nmeeting and at each subsequent annual meeting of stockholders until full dividends\nhave been paid for at least four quarterly consecutive dividend periods. At that\ntime such right will terminate, except as expressly provided in the applicable\ncertificate of designations or by law, subject to revesting. Upon any termination\nof the right of the holders of shares of preferred stock being offered and voting\nparity stock as a class to vote for directors as provided above, the preferred\ndirectors will cease to be qualified as directors, the term of office of all\npreferred directors then in office will terminate immediately and the authorized\nnumber of directors will be reduced by the number of preferred directors elected.\nAny\npreferred director may be removed and replaced at any time, with cause as provided\nby law or without cause by the affirmative vote of the holders of shares of\npreferred stock voting together as a class with the holders of shares of voting\nparity\nstock, to the extent the voting rights of such holders described above are then\nexercisable. Any vacancy created by removal with or without cause may be filled\nonly as described in the preceding sentence. If the office of any preferred\ndirector\nbecomes vacant for any reason other than removal, the remaining preferred director\nmay choose a successor who will hold office for the unexpired term in respect of\nwhich such vacancy occurred.\n\nSo long as any shares of the preferred stock being offered remain outstanding, we\nwill not, without the affirmative vote of the holders of at\nleast 66 2/3% in voting power of the preferred stock being offered and any voting\nparity stock, voting together as a class, authorize, create or issue any capital\nstock ranking senior to the preferred stock being offered as to dividends or upon\nliquidation, dissolution or winding-up, or reclassify any authorized capital stock\ninto any such shares of such capital stock or issue any obligation or security\nconvertible into or evidencing the right to purchase any such shares of capital\nstock.\nSo long as any shares of the preferred stock being offered remain outstanding, we\nwill not, without the affirmative vote of the holders of at least 66 2/3% in\nvoting power of the preferred stock being offered, amend, alter or repeal any\nprovision of\nthe applicable certificate of designations or our certificate of incorporation,\nincluding by merger, consolidation or otherwise, so as to adversely affect the\npowers, preferences or special rights of the preferred stock being offered.\n\n25\n\nNotwithstanding the foregoing, none of the following will be deemed to adversely\naffect the\npowers, preferences or special rights of the preferred stock being offered:\n                                                                                  \n      any increase in the amount of authorized common stock or authorized         \n      preferred stock, or any increase or decrease                                \n      in the number of shares of any series of preferred stock, or the            \n      authorization, creation and issuance of other classes or series of capital  \n      stock, in each case ranking on a parity with or junior to the preferred     \n      stock being offered as to dividends                                         \n      or upon liquidation, dissolution or winding-up;                             \n                                                                                  \n                                                                                  \n      a merger or consolidation of JPMorgan Chase with or into another entity in  \n      which the shares of the preferred                                           \n      stock being offered remain outstanding; and                                 \n                                                                                  \n                                                                                  \n      a merger or consolidation of JPMorgan Chase with or into another entity in  \n      which the shares of the preferred                                           \n      stock being offered are converted into or exchanged for preference          \n      securities of the surviving entity or any entity, directly or indirectly,   \n      controlling such surviving entity and such new preference securities have   \n      powers, preferences and special                                             \n      rights that are not materially less favorable than the preferred stock      \n      being offered;                                                              \n                                                                                  \nprovided that if the amendment would adversely\naffect such series but not any other series of outstanding preferred stock, then\nthe amendment will only need to be approved by holders of at least two-thirds of\nthe shares of the series of preferred stock adversely affected.\n\nUnder regulations adopted by the Federal Reserve Board, if the holders of any\nseries of our preferred stock become entitled to vote for the\nelection of directors because dividends on that series are in arrears, that series\nmay then be deemed a \u0093class of voting securities.\u0094 In such a case, a holder of 25%\nor more of the series, or a holder of 5% or more if that holder would\nalso be considered to exercise a \u0093controlling influence\u0094 over JPMorgan Chase, may\nthen be subject to regulation as a bank holding company in accordance with the\nBank Holding Company Act. In addition, (1) any other bank holding company may\nbe required to obtain the prior approval of the Federal Reserve Board to acquire\nor retain 5% or more of that series, and (2) any person other than a bank holding\ncompany may be required to provide notice to the Federal Reserve Board prior to\nacquiring or retaining 10% or more of that series.\n\nOutstanding Series of Preferred Stock\n\nRanking. Each of our Series I Preferred Stock, Series Q Preferred Stock, Series R\nPreferred Stock, Series S Preferred Stock, Series U\nPreferred Stock, Series V Preferred Stock, Series X Preferred Stock, Series CC\nPreferred Stock, Series DD Preferred Stock, Series EE Preferred Stock, Series FF\nPreferred Stock, Series GG Preferred Stock, Series HH Preferred Stock, Series II\nPreferred Stock, Series JJ Preferred Stock, Series KK Preferred Stock, Series LL\nPreferred Stock and Series MM Preferred Stock (each as defined below, and\ncollectively, the \u0093Outstanding Preferred Stock\u0094) ranks senior to our common stock\nas\nwell as any of our other stock that states it is expressly made junior to such\nseries of Outstanding Preferred Stock as to payment of dividends and distribution\nof assets upon our liquidation, dissolution, or winding up.\n\nDividends. We may not declare or pay or set apart for payment full dividends on\nany series of preferred stock ranking, as to dividends,\nequally with or junior to the Outstanding Preferred Stock unless we have\npreviously declared and paid or set apart for payment full dividends on the\nOutstanding Preferred Stock for the most recently completed dividend period. When\ndividends are not\npaid in full on the Outstanding Preferred Stock and any series of preferred stock\nranking equally as to dividends, all dividends upon the Outstanding Preferred\nStock and such equally ranking series will be declared and paid pro rata.\n\nWith certain exceptions, unless we have paid or declared and set aside for payment\nfull dividends on the Outstanding Preferred Stock for the\nmost recently completed dividend period, we will not:\n                                                                                  \n      declare or make any dividend payment or distribution on any junior ranking  \n      stock, other than a dividend paid in                                        \n      junior ranking stock, or                                                    \n                                                                                  \n26\n                                                                                  \n      redeem, purchase, otherwise acquire or set apart money for a sinking fund   \n      for the redemption of any junior or                                         \n      equally ranking stock, except by conversion into or exchange for junior     \n      ranking stock.                                                              \n                                                                                  \nRights Upon Liquidation.\nIn the event we liquidate, dissolve or wind-up our business and affairs, either\nvoluntarily or involuntarily, holders of the Outstanding Preferred Stock of each\nseries will be entitled to receive liquidating distributions equal to the\nliquidation\npreference per share for such series, plus any declared and unpaid dividends,\nwithout accumulation of undeclared dividends, before we make any distribution of\nassets to the holders of our common stock or any other class or series of shares\nranking\njunior to the Outstanding Preferred Stock of such series.\n\nRedemption. We may redeem each series of Outstanding Preferred Stock on\nthe dates and at the redemption prices set forth below. In addition, we may redeem\neach series of Outstanding Preferred Stock (other than the Series I Preferred\nStock) in whole, but not in part, at a redemption price equal to the liquidation\npreference per share for each such series of Outstanding Preferred Stock, plus any\ndeclared and unpaid dividends, following the occurrence of a capital treatment\nevent. For these purposes, \u0093capital treatment event\u0094 means the good faith\ndetermination by JPMorgan Chase that, as a result of any:\n                                                                                  \n      amendment to, or change or any announced prospective change in, the laws    \n      or regulations of the United States or                                      \n      any political subdivision of or in the United States that is enacted or     \n      becomes effective after the initial issuance of any shares of such series   \n      of Outstanding Preferred Stock;                                             \n                                                                                  \n                                                                                  \n      proposed change in those laws or regulations that is announced or becomes   \n      effective after the initial issuance of                                     \n      any shares of such series of Outstanding Preferred Stock; or                \n                                                                                  \n                                                                                  \n      official administrative decision or judicial decision or administrative     \n      action or other official pronouncement                                      \n      interpreting or applying those laws or regulations that is announced or     \n      becomes effective after the initial issuance of any shares of such series   \n      of Outstanding Preferred Stock,                                             \n                                                                                  \nthere is more than an insubstantial risk that JPMorgan Chase will not be entitled\nto treat an amount equal to the full liquidation amount of all shares of\nsuch series of Outstanding Preferred Stock then outstanding as \u0093additional Tier 1\ncapital\u0094 (or its equivalent) for purposes of the capital adequacy guidelines or\nregulations of the appropriate federal banking agency, as then in effect and\napplicable, for as long as any share of such series of Outstanding Preferred Stock\nis outstanding. Redemption of any Outstanding Preferred Stock may be subject to\nour receipt of any required approvals from the Federal Reserve Board or any other\nregulatory authority.\n\nVoting Rights. The Outstanding Preferred Stock has limited voting rights. Each\nshare of Outstanding\nPreferred Stock has one vote whenever it is entitled to voting rights.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series I\n\nOn April 23, 2008, we issued an aggregate of 600,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock,\nSeries I, $1 par value, with a liquidation preference of $10,000 per share (the\n\u0093Series I Preferred Stock\u0094). Shares of the Series I Preferred Stock are\nrepresented by depositary shares, each representing a one-tenth interest in a\nshare of\npreferred stock of the series.\n\nDividends. Dividends on the Series I Preferred Stock are payable when, as, and if\ndeclared by our\nboard of directors or a duly authorized committee of our board, from the date of\nissuance to, but excluding, April 30, 2018 at a rate of 7.90% per annum, payable\nsemi-annually, in arrears, on April 30 and October 30 of each year, beginning on\nOctober 30, 2008. From and including April 30, 2018, dividends will be paid when,\nas, and if declared by our board of directors or such committee thereof at a\nfloating rate equal to three-month LIBOR plus a spread of 3.47% per annum, payable\nquarterly, in arrears, on January 30, April 30, July 30 and October 30 of each\nyear. Dividends on the Series I Preferred Stock are neither mandatory nor\ncumulative.\n\n27\n\nRedemption. The Series I Preferred Stock may be redeemed on any dividend payment\ndate on\nor after April 30, 2018, in whole or in part, at a redemption price equal to\n$10,000 per share (equivalent to $1,000 per depositary share), plus any declared\nand unpaid dividends. On October 30, 2018 and October 30, 2019, we redeemed\n169,925\nand 137,000 outstanding shares, respectively, of the Series I Preferred Stock.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series Q\n\nOn April 23, 2013, we issued an aggregate of 150,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred\nStock, Series Q, $1 par value, with a liquidation preference of $10,000 per share\n(the \u0093Series Q Preferred Stock\u0094). Shares of the Series Q Preferred Stock are\nrepresented by depositary shares, each representing a one-tenth interest in a\nshare of preferred stock of the series.\n\nDividends. Dividends on the Series Q Preferred Stock are payable when, as, and if\ndeclared\nby our board of directors or a duly authorized committee of our board, from the\ndate of issuance to, but excluding, May 1, 2023 at a rate of 5.15% per annum,\npayable semi-annually, in arrears, on May 1 and November 1 of each year, beginning\non\nNovember 1, 2013. From and including May 1, 2023, dividends will be paid when, as,\nand if declared by our board or such committee at a floating rate equal to three-\nmonth LIBOR plus a spread of 3.25% per annum, payable quarterly, in arrears, on\nFebruary 1, May 1, August 1 and November 1 of each year, beginning on August 1,\n2023. Dividends on the Series Q Preferred Stock are neither mandatory nor\ncumulative.\n\nRedemption. The Series Q Preferred Stock may be redeemed on any dividend payment\ndate on or after May 1, 2023, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series Q Preferred Stock following the occurrence of a \u0093capital\ntreatment event\u0094, as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series R\n\nOn July 29, 2013, we issued an aggregate of 150,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series R, $1 par value,\nwith a liquidation preference of $10,000 per share (the \u0093Series R Preferred\nStock\u0094). Shares of the Series R Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock of\nthe\nseries.\n\nDividends. Dividends on the Series R Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a\nduly authorized committee of our board, from the date of issuance to, but\nexcluding, August 1, 2023 at a rate of 6.00% per annum, payable semi-annually, in\narrears, on February 1 and August 1 of each year, beginning on February 1, 2014.\nFrom and\nincluding August 1, 2023, dividends will be paid when, as, and if declared by our\nboard or such committee at a floating rate equal to three-month LIBOR plus a\nspread of 3.30% per annum, payable quarterly, in arrears, on February 1, May 1,\nAugust 1\nand November 1 of each year, beginning on November 1, 2023. Dividends on the\nSeries R Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series R Preferred Stock may be redeemed on any dividend payment\ndate on or after August 1, 2023, in whole or from time\nto time in part, at a redemption price equal to $10,000 per share (equivalent to\n$1,000 per depositary share), plus any declared and unpaid dividends. We may also\nredeem the Series R Preferred Stock following the occurrence of a \u0093capital\ntreatment event\u0094, as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series S\n\nOn January 22, 2014, we issued an aggregate of 200,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series S, $1 par value,\nwith a liquidation preference of $10,000 per share (the \u0093Series S Preferred\nStock\u0094). Shares of the Series S Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock of\nthe\nseries.\n\n28\n\nDividends. Dividends on the Series S Preferred Stock are payable when, as, and if\ndeclared\nby our board of directors or a duly authorized committee of our board, from the\ndate of issuance to, but excluding, February 1, 2024 at a rate of 6.750% per\nannum, payable semi-annually in arrears, on February 1 and August 1 of each year,\nbeginning\non February 1, 2014. From and including February 1, 2024, dividends will be paid\nwhen, as, and if declared by our board or such committee at a floating rate equal\nto three-month LIBOR plus a spread of 3.78% per annum, payable quarterly in\narrears,\non February 1, May 1, August 1 and November 1 of each year, beginning on May 1,\n2024. Dividends on the Series S Preferred Stock are neither mandatory nor\ncumulative.\n\nRedemption. The Series S Preferred Stock may be redeemed on any dividend payment\ndate on or after February 1, 2024, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series S Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series U\n\nOn March 10, 2014, we issued an aggregate of 100,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series U, $1 par value,\nwith a liquidation preference of $10,000 per share (the \u0093Series U Preferred\nStock\u0094). Shares of the Series U Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock of\nthe\nseries.\n\nDividends. Dividends on the Series U Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a\nduly authorized committee of our board, from the date of issuance to, but\nexcluding, April 30, 2024 at a rate of 6.125% per annum, payable semi-annually in\narrears, on April 30 and October 30 of each year, beginning on October 30, 2014.\nFrom and\nincluding April 30, 2024, dividends will be paid when, as, and if declared by our\nboard or such committee at a floating rate equal to three-month LIBOR plus a\nspread of 3.33% per annum, payable quarterly in arrears, on January 30, April 30,\nJuly 30\nand October 30 of each year, beginning on July 30, 2024. Dividends on the Series U\nPreferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series U Preferred Stock may be redeemed on any dividend payment\ndate on or after April 30, 2024, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series U Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series V\n\nOn June 9, 2014, we issued an aggregate of 250,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series V, $1 par value,\nwith a liquidation preference of $10,000 per share (the \u0093Series V Preferred\nStock\u0094). Shares of the Series V Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock of\nthe\nseries.\n\nDividends. Dividends on the Series V Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a\nduly authorized committee of our board, from the date of issuance to, but\nexcluding, July 1, 2019 at a rate of 5.00% per annum, payable semi-annually in\narrears, on January 1 and July 1 of each year, beginning on January 1, 2015. From\nand including\nJuly 1, 2019, dividends will be paid when, as, and if declared by our board or\nsuch committee at a floating rate equal to three-month LIBOR plus a spread of\n3.32% per annum, payable quarterly in arrears, on January 1, April 1, July 1 and\nOctober 1\nof each year, beginning on October 1, 2019. Dividends on the Series V Preferred\nStock are neither mandatory nor cumulative.\n\nRedemption. The Series V Preferred Stock may be redeemed on any dividend payment\ndate on or after July 1, 2019, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series V Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n29\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series X\n\nOn September 23, 2014, we issued an aggregate of 160,000 shares of Fixed-to-\nFloating Rate Non-Cumulative Preferred Stock, Series X, $1 par\nvalue, with a liquidation preference of $10,000 per share (the \u0093Series X Preferred\nStock\u0094). Shares of the Series X Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock\nof the series.\n\nDividends. Dividends on the Series X Preferred Stock are payable when, as, and if\ndeclared by our board of\ndirectors or a duly authorized committee of our board, from the date of issuance\nto, but excluding, October 1, 2024 at a rate of 6.10% per annum, payable semi-\nannually in arrears, on April 1 and October 1 of each year, beginning on April 1,\n2015.\nFrom and including October 1, 2024, dividends will be paid when, as, and if\ndeclared by our board or such committee at a floating rate equal to three-month\nLIBOR plus a spread of 3.33% per annum, payable quarterly in arrears, on January\n1, April 1,\nJuly 1 and October 1 of each year, beginning on January 1, 2025. Dividends on the\nSeries X Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series X Preferred Stock may be redeemed on any dividend payment\ndate on or after October 1, 2024, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series X Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series CC\n\nOn October 20, 2017, we issued an aggregate of 125,750 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series CC, $1 par\nvalue, with a liquidation preference of $10,000 per share (the \u0093Series CC\nPreferred Stock\u0094). Shares of the Series CC Preferred Stock are represented by\ndepositary shares, each representing a one-tenth interest in a share of preferred\nstock\nof the series.\n\nDividends. Dividends on the Series CC Preferred Stock are payable when, as, and if\ndeclared by our board of\ndirectors or a duly authorized committee of our board, from the date of issuance\nto, but excluding, November 1, 2022 at a rate of 4.625% per annum, payable semi-\nannually in arrears, on May 1 and November 1 of each year, beginning on May 1,\n2018.\nFrom and including November 1, 2022, dividends will be paid when, as, and if\ndeclared by our board or such committee at a floating rate equal to three-month\nLIBOR plus a spread of 2.58% per annum, payable quarterly in arrears, on February\n1, May 1,\nAugust 1 and November 1 of each year, beginning on February 1, 2023. Dividends on\nthe Series CC Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series CC Preferred Stock may be redeemed on any dividend payment\ndate on or after November 1, 2022, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series CC Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n5.75% Non-Cumulative Preferred Stock, Series DD\n\nOn September 21, 2018, we issued an aggregate of 169,625 shares of 5.75% Non-\nCumulative Preferred Stock, Series DD, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series DD Preferred Stock\u0094).\nShares of the Series DD Preferred Stock are represented by depositary shares, each\nrepresenting a 1/400th interest in a share of preferred stock of the series.\n\nDividends.Dividends on the Series DD Preferred Stock are payable when, as, and if\ndeclared by our board of\ndirectors or a duly authorized committee of our board, at a rate of 5.75% per\nannum, payable quarterly in arrears, on March 1, June 1, September 1 and December\n1 of each year, beginning on December 1, 2018. Dividends on the Series DD\nPreferred Stock\nare neither mandatory nor cumulative.\n\n30\n\nRedemption.The Series DD Preferred Stock may be redeemed on any\ndividend payment date on or after December 1, 2023, in whole or from time to time\nin part, at a redemption price equal to $10,000 per share (equivalent to $25 per\ndepositary share), plus any declared and unpaid dividends. We may also redeem the\nSeries DD Preferred Stock following the occurrence of a \u0093capital treatment event,\u0094\nas described above.\n\n6.00% Non-Cumulative Preferred Stock, Series EE\n\nOn January 24, 2019, we issued an aggregate of 185,000 shares of 6.00% Non-\nCumulative\nPreferred Stock, Series EE, $1 par value, with a liquidation preference of $10,000\nper share (the \u0093Series EE Preferred Stock\u0094). Shares of the Series EE Preferred\nStock are represented by depositary shares, each representing a 1/400th\ninterest in a share of preferred stock of the series.\n\nDividends.Dividends on the Series EE Preferred Stock are\npayable when, as, and if declared by our board of directors or a duly authorized\ncommittee of our board, at a rate of 6.00% per annum, payable quarterly in\narrears, on March 1, June 1, September 1 and December 1 of each year, beginning on\nJune 1,\n2019. Dividends on the Series EE Preferred Stock are neither mandatory nor\ncumulative.\n\nRedemption.The Series\nEE Preferred Stock may be redeemed on any dividend payment date on or after March\n1, 2024, in whole or from time to time in part, at a redemption price equal to\n$10,000 per share (equivalent to $25 per depositary share), plus any declared and\nunpaid\ndividends. We may also redeem the Series EE Preferred Stock following the\noccurrence of a \u0093capital treatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series FF\n\nOn July 31, 2019, we issued an aggregate of 250,000 shares of Fixed-to-Floating\nRate Non-Cumulative Preferred Stock, Series FF, $1 par value,\nwith a liquidation preference of $10,000 per share (the \u0093Series FF Preferred\nStock\u0094). Shares of the Series FF Preferred Stock are represented by depositary\nshares, each representing a one-tenth interest in a share of preferred stock of\nthe\nseries.\n\nDividends. Dividends on the Series FF Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a\nduly authorized committee of our board, from the date of issuance to, but\nexcluding, August 1, 2024 at a rate of 5.00% per annum, payable semi-annually in\narrears on February 1 and August 1 of each year, beginning on February 1, 2020.\nFrom and\nincluding August 1, 2024, dividends will be paid when, as, and if declared by our\nboard or such committee at a floating rate equal to a benchmark rate (which is\nexpected to be Three-Month Term SOFR) plus a spread of 3.38% per annum, payable\nquarterly in arrears, on February 1, May 1, August 1 and November 1 of each year,\nbeginning on November 1, 2024. Dividends on the Series FF Preferred Stock are\nneither mandatory nor cumulative.\n\nRedemption. The Series FF Preferred Stock may be redeemed on any dividend payment\ndate on or after August 1, 2024, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $1,000 per depositary share), plus any declared and unpaid dividends. We may\nalso redeem the Series FF Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n4.75% Non-Cumulative Preferred Stock, Series GG\n\nOn November 7, 2019, we issued an aggregate of 90,000 shares of 4.75% Non-\nCumulative Preferred Stock, Series GG, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series GG Preferred Stock\u0094).\nShares of the Series GG Preferred Stock are represented by depositary shares, each\nrepresenting a 1/400th interest in a share of preferred stock of the series.\n\nDividends. Dividends on the Series GG Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a duly\nauthorized committee of our board, at a rate of 4.75% per annum, payable quarterly\nin arrears, on March 1, June 1, September 1 and December 1 of each year, beginning\non March 1, 2020. Dividends on the Series GG Preferred Stock are neither mandatory\nnor cumulative.\n\n31\n\nRedemption. The Series GG Preferred Stock may be redeemed on any dividend payment\ndate on\nor after December 1, 2024, in whole or from time to time in part, at a redemption\nprice equal to $10,000 per share (equivalent to $25 per depositary share), plus\nany declared and unpaid dividends. We may also redeem the Series GG Preferred\nStock\nfollowing the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series HH\n\nOn January 23, 2020, we issued an aggregate of 300,000 shares of Fixed-to-Floating\nRate Non-Cumulative\nPreferred Stock, Series HH, $1 par value, with a liquidation preference of $10,000\nper share (the \u0093Series HH Preferred Stock\u0094). Shares of the Series HH Preferred\nStock are represented by depositary shares, each representing a one-tenth\ninterest in a share of preferred stock of the series.\n\nDividends. Dividends on the Series HH Preferred Stock are payable when, as,\nand if declared by our board of directors or a duly authorized committee of our\nboard, from the date of issuance to, but excluding, February 1, 2025 at a rate of\n4.60% per annum, payable semi-annually in arrears on February 1 and August 1 of\neach\nyear, beginning on August 1, 2020. From and including February 1, 2025, dividends\nwill be paid when, as, and if declared by our board or such committee at a\nfloating rate equal to a benchmark rate (which is expected to be Three-Month Term\nSOFR) plus\na spread of 3.125% per annum, payable quarterly in arrears, on February 1, May 1,\nAugust 1 and November 1 of each year, beginning on May 1, 2025. Dividends on the\nSeries HH Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series HH Preferred Stock may be redeemed on any dividend payment\ndate on or after February 1, 2025, in whole or from\ntime to time in part, at a redemption price equal to $10,000 per share\n\n(equivalent to $1,000 per depositary share), plus any declared and unpaid\ndividends. We may also redeem the Series HH Preferred Stock following the\noccurrence of a \u0093capital treatment event,\u0094 as described above.\n\nFixed-to-Floating Rate Non-Cumulative Preferred Stock, Series II\n\nOn February 24, 2020, we issued an aggregate of 150,000 shares of Fixed-to-\nFloating Rate Non-Cumulative Preferred Stock, Series II, $1 par\nvalue, with a liquidation preference of $10,000 per share (the \u0093Series II\nPreferred Stock\u0094). Shares of the Series II Preferred Stock are represented by\ndepositary shares, each representing a one-tenth interest in a share of preferred\nstock\nof the series.\n\nDividends. Dividends on the Series II Preferred Stock are payable when, as, and if\ndeclared by our board of\ndirectors or a duly authorized committee of our board, from the date of issuance\nto, but excluding, April 1, 2025 at a rate of 4.00% per annum, payable semi-\nannually in arrears on April 1 and October 1 of each year, beginning on October 1,\n2020.\nFrom and including April 1, 2025, dividends will be paid when, as, and if declared\nby our board or such committee at a floating rate equal to a benchmark rate (which\nis expected to be Three-Month Term SOFR) plus a spread of 2.745% per annum,\npayable\nquarterly in arrears, on January 1, April 1, July 1 and October 1of each year,\nbeginning on July 1, 2025. Dividends on the Series II Preferred Stock are neither\nmandatory nor cumulative.\n\nRedemption. The Series II Preferred Stock may be redeemed on any dividend payment\ndate on or after April 1, 2025, in whole or from time\nto time in part, at a redemption price equal to $10,000 per share (equivalent to\n$1,000 per depositary share), plus any declared and unpaid dividends. We may also\nredeem the Series II Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n4.55% Non-Cumulative Preferred Stock, Series JJ\n\nOn March 17, 2021, we issued an aggregate of 150,000 shares of 4.55% Non-\nCumulative Preferred Stock, Series JJ, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series JJ Preferred Stock\u0094).\nShares of the Series JJ Preferred Stock are represented by depositary shares, each\nrepresenting a 1/400th interest in a share of preferred stock of the series.\n\n32\n\nDividends. Dividends on the Series JJ Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a duly authorized committee of our board, at\na rate of 4.55% per annum, payable quarterly in arrears, on March 1, June 1,\nSeptember 1 and December 1 of each year, beginning on June 1, 2021. Dividends on\nthe\nSeries JJ Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series JJ Preferred Stock may be redeemed on any\ndividend payment date on or after June 1, 2026, in whole at any time or from time\nto time in part, at a redemption price equal to $10,000 per share (equivalent to\n$25 per depositary share), plus any declared and unpaid dividends. We may also\nredeem\nthe Series JJ Preferred Stock following the occurrence of a \u0093capital treatment\nevent,\u0094 as described above.\n\n3.65% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series KK\n\nOn May 12, 2021, we issued an aggregate of 200,000 shares of 3.65%\nFixed-Rate Reset Non-Cumulative Preferred Stock, Series KK, $1 par value, with a\nliquidation preference of $10,000 per share (the \u0093Series KK Preferred Stock\u0094).\nShares of the Series KK Preferred Stock are represented by depositary shares,\neach representing a one-tenth interest in a share of preferred stock of the\nseries.\n\nDividends. Dividends on the Series KK\nPreferred Stock are payable when, as, and if declared by our board of directors or\na duly authorized committee of our board, quarterly in arrears, on March 1, June\n1, September 1 and December 1 of each year, beginning on September 1, 2021. From\nthe\ndate of issuance to, but excluding, June 1, 2026, dividends will accrue at a rate\nequal to 3.65% per annum, and thereafter, for each reset period, at a rate equal\nto a five-year treasury rate as of the most recent reset dividend determination\ndate\nplus a spread of 2.85% per annum. Dividends on the Series KK Preferred Stock are\nneither mandatory nor cumulative.\n\nRedemption. The\nSeries KK Preferred Stock may be redeemed on any dividend payment date on or after\nJune 1, 2026, in whole at any time or from time to time in part, at a redemption\nprice equal to $10,000 per share (equivalent to $1,000 per depositary share), plus\nany declared and unpaid dividends. We may also redeem the Series KK Preferred\nStock following the occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n4.625% Non-Cumulative Preferred Stock, Series LL\n\nOn May 20, 2021, we issued an aggregate of 185,000 shares of 4.625% Non-Cumulative\nPreferred Stock, Series LL, $1 par value, with a liquidation\npreference of $10,000 per share (the \u0093Series LL Preferred Stock\u0094). Shares of the\nSeries LL Preferred Stock are represented by depositary shares, each representing\na 1/400th interest in a share of preferred stock of the series.\n\nDividends. Dividends on the Series LL Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a duly\nauthorized committee of our board, at a rate of 4.625% per annum, payable\nquarterly in arrears, on March 1, June 1, September 1 and December 1 of each year,\nbeginning on September 1, 2021. Dividends on the Series LL Preferred Stock are\nneither\nmandatory nor cumulative.\n\nRedemption. The Series LL Preferred Stock may be redeemed on any dividend payment\ndate on or after June\n1, 2026, in whole at any time or from time to time in part, at a redemption price\nequal to $10,000 per share (equivalent to $25 per depositary share), plus any\ndeclared and unpaid dividends. We may also redeem the Series LL Preferred Stock\nfollowing\nthe occurrence of a \u0093capital treatment event,\u0094 as described above.\n\n4.20% Non-Cumulative Preferred Stock, Series MM\n\nOn July 29, 2021, we issued an aggregate of 200,000 shares of 4.20% Non-Cumulative\nPreferred Stock, Series MM, $1 par value, with\na liquidation preference of $10,000 per share (the \u0093Series MM Preferred Stock\u0094).\nShares of the Series MM Preferred Stock are represented by depositary shares, each\nrepresenting a 1/400th interest in a share of preferred stock of the\nseries.\n\n33\n\nDividends. Dividends on the Series MM Preferred Stock are payable when, as, and if\ndeclared by our board of directors or a duly authorized committee of our board, at\na rate of 4.20% per annum, payable quarterly in arrears, on March 1, June 1,\nSeptember 1 and December 1 of each year, beginning on December 1, 2021. Dividends\non the\nSeries MM Preferred Stock are neither mandatory nor cumulative.\n\nRedemption. The Series MM Preferred Stock may be redeemed on any\ndividend payment date on or after September 1, 2026, in whole at any time or from\ntime to time in part, at a redemption price equal to $10,000 per share (equivalent\nto $25 per depositary share), plus any declared and unpaid dividends. We may also\nredeem the Series MM Preferred Stock following the occurrence of a \u0093capital\ntreatment event,\u0094 as described above.\n\n34\n\nDESCRIPTION OF DEPOSITARY SHARES\n\nGeneral.We may, at our option, elect to offer depositary shares representing\nfractional interests in shares of preferred stock. If we\ndo, we will arrange the issuance by a depositary of receipts for depositary\nshares, and each of those depositary shares will represent a fractional interest\nin a share of a particular series of preferred stock. We will specify that\nfractional\ninterest in the applicable prospectus supplement.\n\nThe shares of any series of preferred stock underlying the depositary shares\noffered by\nuse of this prospectus and an applicable prospectus supplement will be deposited\nunder a deposit agreement between us and a depositary selected by us. Subject to\nthe terms of the deposit agreement, each owner of a depositary share will be\nentitled,\nin proportion to the applicable fractional interest in the share of preferred\nstock underlying that depositary share, to all the powers, preferences and rights\nof the preferred stock underlying that depositary share, in proportion to the\napplicable\nfractional interest in a share of the preferred stock which those depositary\nshares represent. Those rights include dividend, voting, redemption, conversion\nand liquidation rights.\n\nThe depositary shares offered by use of this prospectus and an applicable\nprospectus supplement will be evidenced by depositary receipts\nissued under the deposit agreement. The depositary will issue depositary receipts\nto those persons who purchase the fractional interests in the preferred stock\nunderlying the depositary shares, in accordance with the terms of the offering.\nThe\nfollowing summary of the deposit agreement, the depositary shares and the\ndepositary receipts is not complete. You should refer to the forms of the deposit\nagreement and depositary receipts that are filed as exhibits to the registration\nstatement.\n\nDividends and Other Distributions. The depositary will distribute all cash\ndividends or other cash distributions received in\nrespect of the preferred stock to the record holders of related depositary\nreceipts in proportion to the number of depositary shares owned by those holders.\n\nIf we make a distribution other than in cash, the depositary will distribute\nproperty received by it to the record holders of depositary\nreceipts that are entitled to receive the distribution as nearly as practicable in\nproportion to the number of depositary shares held by each holder, unless the\ndepositary determines that it is not feasible to make the distribution. If this\noccurs,\nthe depositary may, with our approval, adopt a method of distribution that it\ndeems practicable, including the sale of the property and distribution of the net\nproceeds from the sale to the applicable holders of the depositary receipts.\n\nRedemption of Depositary Shares. Upon redemption, in whole or in part, of shares\nof any series of preferred stock that are held by the\ndepositary, the depositary will redeem, as of the same redemption date, the number\nof depositary shares representing the shares of preferred stock so redeemed. The\nredemption price per depositary share will be equal to the applicable fraction of\nthe\nredemption price per share payable with respect to that series of the preferred\nstock.\n\nDepositary shares called for redemption will no\nlonger be outstanding after the applicable redemption date, and all rights of the\nholders of those depositary shares will cease, except the right to receive any\nmoney, securities, or other property upon surrender to the depositary of the\ndepositary\nreceipts evidencing those depositary shares.\n\nVoting the Preferred Stock. Upon receipt of notice of any meeting at which the\nholders of preferred stock are entitled to vote, the depositary will mail the\ninformation contained in the notice of meeting to the record holders of the\ndepositary shares representing that preferred stock. Each record holder of those\ndepositary\nshares on the record date, which will be the same date as the record date for the\npreferred stock, will be entitled to instruct the depositary as to the exercise of\nthe voting rights pertaining to the amount of the preferred stock underlying that\nholder\u0092s depositary shares. The depositary will try, to the extent practicable, to\nvote the number of shares of preferred stock underlying those depositary shares in\naccordance with those instructions, and we will agree to take all action that\nthe depositary deems necessary in order to enable the depositary to do so. The\ndepositary will not vote the shares of preferred stock to the extent it does not\nreceive specific instructions from the holders of depositary shares representing\nthe\npreferred stock.\n\n35\n\nAmendment and Termination of the Deposit Agreement. We and the depositary may\namend the\nform of depositary receipt evidencing the depositary shares and any provision of\nthe deposit agreement at any time regarding any depositary shares offered by use\nof this prospectus and an applicable prospectus supplement. However, any amendment\nthat\nmaterially and adversely alters the rights of the holders of depositary shares or\nwould be materially and adversely inconsistent with the rights granted to holders\nof the underlying preferred stock pursuant to our certificate of incorporation\nwill\nnot be effective unless the amendment has been approved by the holders of at least\na majority of the depositary shares then outstanding. The deposit agreement may be\nterminated by us or by the depositary only if:\n                                                                \n      all outstanding depositary shares have been redeemed; or  \n                                                                \n                                                                                  \n      there has been a final distribution of the underlying preferred stock in    \n      connection with our liquidation,                                            \n      dissolution or winding up and the preferred stock has been distributed to   \n      the holders of depositary receipts.                                         \n                                                                                  \nCharges of Depositary. We will pay all transfer and other taxes and governmental\ncharges arising solely from the existence of the\ndepositary arrangements regarding any depositary shares offered by use of this\nprospectus and an applicable prospectus supplement. We will also pay charges of\nthe depositary in connection with the initial deposit of the preferred stock and\nany\nredemption of the preferred stock. Holders of depositary receipts will pay\ntransfer and other taxes and governmental charges and other charges with respect\nto their depositary receipts as expressly provided in the deposit agreement.\n\nResignation and Removal of Depositary. The depositary for the depositary shares\noffered by use of this prospectus and an applicable\nprospectus supplement may resign at any time by delivering a notice to us of its\nelection to do so. We may remove the depositary at any time. Any such resignation\nor removal will take effect upon the appointment of a successor depositary and its\nacceptance of its appointment. We must appoint a successor depositary within 60\ndays after delivery of the notice of resignation or removal.\n\nMiscellaneous. The depositary will forward to holders of depositary receipts all\nreports and communications from us that we deliver to\nthe depositary and that we are required to furnish to the holders of the preferred\nstock.\n\nNeither we nor the depositary will be liable if\neither of us is prevented or delayed by law or any circumstance beyond our control\nin performing our respective obligations under the deposit agreement. Our\nobligations and those of the depositary will be limited to performing in good\nfaith our\nrespective duties under the deposit agreement. Neither we nor the depositary will\nbe obligated to prosecute or defend any legal proceeding relating to any\ndepositary shares or preferred stock unless satisfactory indemnity is furnished.\nWe and the\ndepositary may rely upon written advice of counsel or accountants, or upon\ninformation provided by persons presenting preferred stock for deposit, holders of\ndepositary receipts or other persons we believe to be competent, and on documents\nwe\nbelieve to be genuine.\n\nDESCRIPTION OF COMMON STOCK\n\nAs of the date of this prospectus, we are authorized to issue up to 9,000,000,000\nshares of common stock. As of December 31, 2021, we had\n2,944,149,145 shares of common stock issued and outstanding (which excludes\n1,160,784,750 shares held in treasury).\n\nThe following summary\nis not complete. You should refer to the applicable provisions of our certificate\nof incorporation and to the DGCL for a complete statement of the terms and rights\nof our common stock.\n\nDividends. Holders of common stock are entitled to receive dividends if, as and\nwhen declared by our board of directors out of funds\nlegally available for payment, subject to the rights of holders of our preferred\nstock.\n\n36\n\nVoting Rights. Each holder of common stock is entitled to one vote per share.\nSubject to\nthe rights, if any, of the holders of any series of preferred stock under its\napplicable certificate of designations and applicable law, all voting rights are\nvested in the holders of shares of our common stock. Holders of shares of our\ncommon stock\nhave noncumulative voting rights, which means that the holders of more than 50% of\nthe shares voting for the election of directors can elect 100% of the directors\nand the holders of the remaining shares will not be able to elect any directors.\n\nRights Upon Liquidation. In the event of our voluntary or involuntary liquidation,\ndissolution or winding-up, the holders of our common\nstock will be entitled to share equally in any of our assets available for\ndistribution after we have paid in full all of our debts and after the holders of\nall series of our outstanding preferred stock have received their liquidation\npreferences in\nfull.\n\nMiscellaneous. The issued and outstanding shares of common stock are fully paid\nand nonassessable. Holders of shares of our\ncommon stock are not entitled to preemptive rights or to the benefit of any\nsinking funds. Our common stock is not convertible into shares of any other class\nof our capital stock. Computershare Inc is the transfer agent, registrar and\ndividend\ndisbursement agent for our common stock.\n\nDESCRIPTION OF WARRANTS\n\nWe may issue warrants for the purchase of debt securities, preferred stock or\ncommon stock. We may issue warrants independently or together\nwith debt securities, preferred stock, common stock or other securities, other\nproperty or any combination of those securities in the form of units. Each series\nof warrants will be issued under a separate warrant agreement to be entered into\nbetween\nus and a bank or trust company (which may be the Bank), as warrant agent. The\nwarrant agent will act solely as our agent under the applicable warrant agreement\nand will not assume any obligation to, or relationship of agency or trust for or\nwith,\nany registered holders or beneficial owners of warrants. This summary of certain\nprovisions of the warrants and the warrant agreement is not complete. You should\nrefer to the warrant agreement relating to the specific warrants being offered,\nincluding the forms of warrant certificates representing those warrants, for the\ncomplete terms of the warrant agreement and the warrants. Forms of those documents\nare filed as exhibits to the registration statement.\n\nEach warrant will entitle the holder to purchase the principal amount of debt\nsecurities or the number of shares of preferred stock or common\nstock at the exercise price set forth in, or calculable as set forth in, the\napplicable prospectus supplement. The exercise price may be subject to adjustment\nupon the occurrence of certain events, as set forth in the prospectus supplement.\nWe will\nalso specify in the prospectus supplement the place or places where, and the\nmanner in which, warrants may be exercised. After the close of business on the\nexpiration date of the warrants, unexercised warrants will become void.\n\nPrior to the exercise of any warrants, holders of the warrants will not have any\nof the rights of holders of the debt securities, preferred\nstock or common stock, as the case may be, that may be purchased upon exercise of\nthose warrants, including, (1) in the case of warrants for the purchase of debt\nsecurities, the right to receive payments of principal of, and premium, if any, or\ninterest, if any, on those debt securities or to enforce covenants in the senior\nindenture or subordinated indenture, as the case may be, or (2) in the case of\nwarrants for the purchase of preferred stock or common stock, the right to receive\npayments of dividends, if any, on that preferred stock or common stock or to\nexercise any applicable right to vote.\n\n37\n\nDESCRIPTION OF UNITS\n\nWemay issue units that will consist of any combination of debt securities,\npreferred stock, common stock and warrants issued by us,\ndepositary shares representing preferred stock issued by us, debt obligations or\nother securities of an entity affiliated or not affiliated with us or other\nproperty. We may issue units in one or more series, which will be described in the\napplicable prospectus supplement. Each series of units will be issued under a\nseparate unit agreement to be entered into between us and a bank or trust company\n(which may be the Bank), as unit agent. The below summary of certain provisions of\nthe\nunits and unit agreements is not complete. You should refer to the unit agreement\nfor the complete terms of the unit agreement and the units. Forms of those\ndocuments will be filed as exhibits to or incorporated by reference in the\nregistration\nstatement.\n\nUnless otherwise specified in the applicable prospectus supplement, each unit will\nbe issued so that the holder of the unit is\nalso the holder of each security included in the unit. Thus, the holder of a unit\nwill have the rights and obligations of a holder of each included security. The\nunit agreement under which a unit is issued may provide that the securities\nincluded in\nthe unit may not be held or transferred separately, at any time or at any time\nbefore a specified date. We will describe the particular terms of any series of\nunits being offered in the prospectus supplement relating to that series of units.\nThose\nterms may include:\n                                                                                  \n      the designation and the terms of the units and any combination of debt      \n      securities, preferred stock, common stock                                   \n      and warrants issued by us, depositary shares representing preferred stock   \n      issued by us, debt obligations or other securities of an entity affiliated  \n      or not affiliated with us or other property constituting the units,         \n      including and whether and under                                             \n      what circumstances the debt securities, preferred stock, common stock and   \n      warrants issued by us, depositary shares representing preferred stock       \n      issued by us, debt obligations or other securities of an entity affiliated  \n      or not affiliated with us or                                                \n      other securities may be traded separately;                                  \n                                                                                  \n                                                             \n      any additional terms of the governing unit agreement;  \n                                                             \n                                                                                  \n      any additional provisions for the issuance, payment, settlement, transfer   \n      or exchange of the units or of the debt                                     \n      securities, preferred stock, common stock and warrants issued by us,        \n      depositary shares representing preferred stock issued by us, debt           \n      obligations or other securities of an entity affiliated or not affiliated   \n      with us or other property constituting                                      \n      the units; and                                                              \n                                                                                  \n                                                            \n      any applicable U.S. federal income tax consequences.  \n                                                            \nThe terms and conditions described under \u0093Description of Debt Securities,\u0094\n\u0093Description of Preferred Stock,\u0094\n\u0093Description of Common Stock\u0094 and \u0093Description of Warrants\u0094 will apply to each\nunit and to any debt securities, preferred stock, common stock or warrants issued\nby us, depositary shares representing preferred stock issued by us,\ndebt obligations or other securities of an entity affiliated or not affiliated\nwith us or other property included in each unit, unless otherwise specified in the\napplicable prospectus supplement.\n\nAn investment in units may involve special risks, including risks associated with\nindexed securities and currency-related risks if the\nsecurities comprising the units are linked to an index or are payable in or\notherwise linked to a non-U.S. dollar currency.\n\n38\n\nBOOK-ENTRY ISSUANCE\n\nWe may issue series of any securities as global securities and deposit them with a\ndepositary with respect to that series for settlement and\nclearance through a book-entry settlement system, as indicated in the applicable\nprospectus supplement. The following is a summary of the depositary arrangements\napplicable to securities issued in permanent global form and for which The\nDepository\nTrust Company (\u0093DTC\u0094) will act as depositary (the \u0093global securities\u0094).\n\nEach global security will be deposited with,\nor on behalf of, DTC, as depositary, or its nominee and registered in the name of\na nominee of DTC. Except under the limited circumstances described below, global\nsecurities will not be exchangeable for certificated securities.\n\nOnly institutions that have accounts with DTC or its nominee (\u0093DTC participants\u0094)\nor persons that may hold interests through DTC\nparticipants may own beneficial interests in a global security. DTC will maintain\nrecords evidencing ownership of beneficial interests by DTC participants in the\nglobal securities and transfers of those ownership interests. DTC participants\nwill\nmaintain records evidencing ownership of beneficial interests in the global\nsecurities by persons that hold through those DTC participants and transfers of\nthose ownership interests within those DTC participants. DTC has no knowledge of\nthe actual\nbeneficial owners of the securities. You will not receive written confirmation\nfrom DTC of your purchase, but we do expect that you will receive written\nconfirmations providing details of the transaction, as well as periodic statements\nof your\nholdings, from the DTC participant through which you entered the transaction. The\nlaws of some jurisdictions require that certain purchasers of securities take\nphysical delivery of those securities in certificated form. Those laws may impair\nyour\nability to transfer beneficial interests in a global security.\n\nDTC has advised us that upon the issuance of a global security and the\ndeposit of that global security with DTC, DTC will immediately credit, on its\nbook-entry registration and transfer system, the respective principal amounts or\nnumber of shares represented by that global security to the accounts of DTC\nparticipants.\n\nWe will make payments on securities represented by a global security to DTC or its\nnominee, as the case may be, as the registered owner\nand holder of the global security representing those securities. DTC has advised\nus that upon receipt of any payment on a global security, DTC will immediately\ncredit accounts of DTC participants with payments in amounts proportionate to\ntheir\nrespective beneficial interests in that security, as shown in the records of DTC.\nStanding instructions and customary practices will govern payments by DTC\nparticipants to owners of beneficial interests in a global security held through\nthose DTC\nparticipants, as is now the case with securities held for the accounts of\ncustomers in bearer form or registered in \u0093street name.\u0094 Those payments will be\nthe sole responsibility of those DTC participants, subject to any statutory or\nregulatory requirements in effect from time to time.\n\nNone of JPMorgan Chase, the trustees, the depositary or any of our respective\nagents\nwill have any responsibility or liability for any aspect of the records of DTC,\nany nominee or any DTC participant relating to, or payments made on account of,\nbeneficial interests in a global security or for maintaining, supervising or\nreviewing\nany of the records of DTC, any nominee or any DTC participant relating to those\nbeneficial interests.\n\nA global security is exchangeable\nfor certificated securities registered in the name of a person other than DTC or\nits nominee only if:\n                                                                                  \n      DTC notifies us that it is unwilling or unable to continue as depositary    \n      for that global security or DTC ceases                                      \n      to be registered under the Securities Exchange Act of 1934;                 \n                                                                                  \n                                                                                  \n      we determine in our discretion that the global security will be             \n      exchangeable for certificated securities in                                 \n      registered form; or                                                         \n                                                                                  \n                                                                                  \n      if applicable to the particular type of security, there shall have          \n      occurred and be continuing an event of default                              \n      or an event which, with notice or the lapse of time or both, would          \n      constitute an event of default under the securities.                        \n                                                                                  \n39\n\nAny global security that is exchangeable as described in the preceding sentence\nwill be\nexchangeable in whole for certificated securities in registered form, and, in the\ncase of global debt securities, of like tenor and of an equal aggregate principal\namount as the global security, in denominations of $1,000 and integral multiples\nof\n$1,000 (or in denominations and integral multiples as otherwise specified in the\napplicable prospectus supplement). The registrar for the securities will register\nthe certificated securities in the name or names instructed by DTC. We expect that\nthose instructions may be based upon directions received by DTC from DTC\nparticipants with respect to ownership of beneficial interests in the global\nsecurity. In the case of global debt securities, we will make payment of any\nprincipal and interest\non the certificated securities and will register transfers and exchanges of those\ncertificated securities at the corporate trust office of The Bank of New York\nMellon or any successor paying agent that we may designate. However, we may elect\nto pay\ninterest by check mailed to the address of the person entitled to that interest\npayment as of the record date, as shown on the register for the securities.\n\nExcept as provided above, as an owner of a beneficial interest in a global\nsecurity, you will not be entitled to receive physical delivery of\nsecurities in certificated form and will not be considered a holder of securities\nfor any purpose under either of the indentures. No global security will be\nexchangeable except for another global security of like denomination and tenor to\nbe\nregistered in the name of DTC or its nominee. Accordingly, you must rely on the\nprocedures of DTC and the DTC participant through which you own your interest to\nexercise any rights of a holder under the global security or the applicable\nindenture.\n\nWe understand that, under existing industry practices, in the event that we\nrequest any action of holders, or an owner of a beneficial\ninterest in a global security desires to take any action that a holder is entitled\nto take under the securities or the indentures, DTC would authorize the DTC\nparticipants holding the relevant beneficial interests to take that action, and\nthose DTC\nparticipants would authorize beneficial owners owning through those DTC\nparticipants to take that action or would otherwise act upon the instructions of\nbeneficial owners owning through them.\n\nDTC has advised us that DTC is a limited purpose trust company organized under the\nNew York Banking Law, a \u0093banking organization\u0094\nwithin the meaning of the New York Banking Law, a member of the Federal Reserve\nSystem, a \u0093clearing corporation\u0094 within the meaning of the New York Uniform\nCommercial Code and a \u0093clearing agency\u0094 registered under the Securities\nExchange Act of 1934.\n\nIf specified in the applicable prospectus supplement, investors may elect to hold\ninterests in the global\nsecurities deposited with DTC outside the United States through Clearstream\nBanking, S.A. (\u0093Clearstream\u0094) or Euroclear Bank SA/NV, as operator of the\nEuroclear System (\u0093Euroclear\u0094), if they are participants in those systems, or\nindirectly through organizations that are participants in those systems.\nClearstream and Euroclear will hold interests on behalf of their participants\nthrough customers\u0092 securities accounts in Clearstream\u0092s and Euroclear\u0092s names on\nthe books of their respective depositaries. Those depositaries in turn hold those\ninterests in customers\u0092 securities accounts in the depositaries\u0092 names on the\nbooks of DTC. Unless otherwise specified in the prospectus supplement, The Bank\nof New York Mellon will act as depositary for each of Clearstream and Euroclear in\nthe case of global debt securities.\n\nClearstream has\nadvised us that it is incorporated under the laws of Luxembourg as a professional\ndepositary. Clearstream holds securities for its participants and facilitates the\nclearance and settlement of securities transactions between its participants\nthrough\nelectronic book-entry transfers between their accounts. Clearstream provides its\nparticipants with, among other things, services for safekeeping, administration,\nclearance and settlement of internationally traded securities and securities\nlending\nand borrowing. Clearstream interfaces with domestic securities markets in several\ncountries through established depository and custodial relationships. As a\nprofessional depositary, Clearstream is subject to regulation by the Luxembourg\nCommission\nfor the Supervision of the Financial Sector, also known as the Commission de\nSurveillance du Secteur Financier. Clearstream participants are recognized\nfinancial institutions around the world, including underwriters, securities\nbrokers and\ndealers, banks, trust companies, clearing corporations and other organizations.\nClearstream\u0092s participants in the United States are limited to securities brokers\nand dealers and banks. Indirect access to Clearstream is also available to other\ninstitutions such as banks, brokers, dealers and trust companies that clear\nthrough or maintain a custodial relationship with Clearstream participants.\n\n40\n\nDistributions with respect to interests in global securities held through\nClearstream will be\ncredited to cash accounts of its customers in accordance with its rules and\nprocedures, to the extent received by the U.S. depositary for Clearstream.\n\nEuroclear has advised us that it was created in 1968 to hold securities for its\nparticipants and to clear and settle transactions between\nEuroclear participants through simultaneous electronic book-entry delivery against\npayment, thereby eliminating the need for physical movement of certificates and\nany risk from lack of simultaneous transfers of securities and cash. Euroclear\nprovides various other services, including securities lending and borrowing, and\ninterfaces with domestic markets in several countries. Euroclear is operated by\nEuroclear Bank SA/NV under contract with Euroclear plc, a U.K. corporation.\nEuroclear\nparticipants include banks, including central banks, securities brokers and\ndealers and other professional financial intermediaries. Indirect access to\nEuroclear is also available to other firms that clear through or maintain a\ncustodial\nrelationship with a Euroclear participant, either directly or indirectly.\n\nDistributions with respect to interests in global securities\nheld beneficially through Euroclear will be credited to the cash accounts of\nEuroclear participants in accordance with Euroclear\u0092s terms and conditions and\noperating procedures and applicable Belgian law, to the extent received by the\nU.S.\ndepositary for Euroclear.\n\nGlobal Clearance and Settlement Procedures\n\nUnless otherwise specified in a prospectus supplement with respect to a particular\nseries of global securities, initial settlement for global\nsecurities will be made in immediately available funds. DTC participants will\nconduct secondary market trading with other DTC participants in the ordinary way\nin accordance with DTC rules. Thereafter, secondary market trades will settle in\nimmediately available funds using DTC\u0092s same day funds settlement system.\n\nIf the prospectus supplement specifies that interests in\nthe global securities may be held through Clearstream or Euroclear, Clearstream\ncustomers and/or Euroclear participants will conduct secondary market trading with\nother Clearstream customers and/or Euroclear participants in the ordinary way in\naccordance with the applicable rules and operating procedures of Clearstream and\nEuroclear. Thereafter, secondary market trades will settle in immediately\navailable funds.\n\nCross-market transfers between persons holding directly or indirectly through DTC\non the one hand, and directly or indirectly through\nClearstream customers or Euroclear participants, on the other, will be effected in\nDTC in accordance with DTC\u0092s rules on behalf of the relevant European\ninternational clearing system by the U.S. depositary for that system; however,\nthose\ncross-market transactions will require delivery by the counterparty in the\nrelevant European international clearing system of instructions to that system in\naccordance with its rules and procedures and within its established deadlines\n(European\ntime). The relevant European international clearing system will, if the\ntransaction meets its settlement requirements, deliver instructions to the U.S.\ndepositary for that system to take action to effect final settlement on its behalf\nby delivering\nor receiving interests in global securities in DTC, and making or receiving\npayment in accordance with normal procedures for same-day funds settlement\napplicable to DTC. Clearstream customers and Euroclear participants may not\ndeliver instructions\ndirectly to DTC.\n\nBecause of time-zone differences, credits of interests in global securities\nreceived in Clearstream or Euroclear as a\nresult of a transaction with a DTC participant will be made during subsequent\nsecurities settlement processing and will be credited the business day following\nthe DTC settlement date. Those credits or any transactions in global securities\nsettled\nduring that processing will be reported to the relevant Euroclear participants or\nClearstream customers on that business day. Cash received in Clearstream or\nEuroclear as a result of sales of interests in global securities by or through a\nClearstream customer or a Euroclear participant to a DTC participant will be\nreceived with value on the DTC settlement date but will be available in the\nrelevant Clearstream or Euroclear cash account only as of the business day\nfollowing settlement\nin DTC.\n\nAlthough DTC, Clearstream and Euroclear have agreed to the procedures described\nabove in order to facilitate transfers of\ninterests in global securities among DTC participants, Clearstream and Euroclear,\nthey are under no obligation to perform those procedures and those procedures may\nbe discontinued at any time.\n\n41\n\nSpecial Provisions Relating to Certain Foreign Currency Securities\n\nIf specified in the applicable prospectus supplement, book-entry securities\ndenominated in currencies other than U.S. dollars may be held\ndirectly through participants in the systems of Clearstream or Euroclear, or\nindirectly through organizations that are participants in such systems. Such\nsecurities will be issued in the form of one or more global certificates (the\n\u0093international global securities\u0094), which will be registered in the name of a\nnominee for, and shall be deposited with, a common depositary for Clearstream\nand/or Euroclear. If a particular tranche or series of securities is issued\nutilizing both a global security and an international global security, in order to\nallow transfers between account holders utilizing the different book-entry systems\nthe registrar will adjust the amounts of the global securities on the register for\nthe accounts of the nominees for the respective systems.\n\nUnless otherwise specified in the applicable prospectus supplement, with\nrespect to an international global security, distributions of principal and\ninterest for a global debt security and dividends for a global equity security\nwill be credited, in the specified currency, to the extent received by Clearstream\nor\nEuroclear, to the cash accounts of Clearstream or Euroclear customers in\naccordance with the relevant system\u0092s rules and procedures. If the prospectus\nsupplement provides for both a global security and an international global\nsecurity or if a\nbeneficial interest in a global security is held by a participant in Clearstream\nor Euroclear, then a holder of a beneficial interest in a global security will\nreceive all payments in U.S. dollars in accordance with DTC\u0092s rules and\nprocedures,\nunless it has, or participants through which it holds its beneficial interest\nhave, made other arrangements.\n\nRelationship of Accountholders with Clearing Systems\n\nUnless otherwise specified in the applicable prospectus supplement, each of the\npersons shown in the records of\nClearstream, Euroclear or any other clearing system as the holder of the\nsecurities represented by the global securities must look solely to Clearstream or\nEuroclear for such holder\u0092s share of each payment made by or on behalf of JPMorgan\nChase\nto Clearstream or Euroclear, and in relation to all other rights arising under the\nglobal securities, subject to and in accordance with the respective rules and\nprocedures of Clearstream or Euroclear. Such persons shall have no claim directly\nagainst JPMorgan Chase in respect of payments due on the securities for so long as\nthe securities are represented by global securities and such obligations of\nJPMorgan Chase will be discharged by payment to Clearstream or Euroclear in\nrespect of\neach amount so paid.\n\n42\n\nPLAN OF DISTRIBUTION\n\nWe may sell the debt securities, preferred stock, depositary shares, common stock,\nwarrants or units being offered by use of this prospectus\nand an applicable prospectus supplement:\n                             \n      through underwriters;  \n                             \n                        \n      through dealers;  \n                        \n                          \n      through agents; or  \n                          \n                               \n      directly to purchasers.  \n                               \nWe will set forth the terms of the offering of any securities being offered in the\napplicable prospectus supplement.\n\nIf we utilize underwriters in an offering of securities using this prospectus, we\nwill execute an underwriting agreement with those\nunderwriters. The underwriting agreement will provide that the obligations of the\nunderwriters with respect to a sale of the offered securities are subject to\ncertain conditions precedent and that the underwriters will be obligated to\npurchase all\nthe offered securities if any are purchased, other than securities subject to an\nunderwriter\u0092s overallotment option. Underwriters may sell those securities to or\nthrough dealers. The underwriters may change any initial public offering price and\nany discounts or concessions allowed or reallowed or paid to dealers from time to\ntime. If we utilize underwriters in an offering of securities using this\nprospectus, the applicable prospectus supplement will contain a statement\nregarding the\nintention, if any, of the underwriters to make a market in the offered securities.\n\nIf we utilize a dealer in an offering of securities\nusing this prospectus, we will sell the offered securities to the dealer, as\nprincipal. The dealer may then resell those securities to the public at a fixed\nprice or at varying prices to be determined by the dealer at the time of resale.\n\nWe may also use this prospectus to offer and sell securities through agents\ndesignated by us from time to time. Unless otherwise indicated in\nthe prospectus supplement, any agent will be acting on a reasonable efforts basis\nfor the period of its appointment.\n\nUnderwriters,\ndealers or agents participating in a distribution of securities by use of this\nprospectus and an applicable prospectus supplement may be deemed to be\nunderwriters, and any discounts and commissions received by them and any profit\nrealized by them on\nresale of the offered securities, whether received from us or from purchasers of\noffered securities for whom they act as agent, may be deemed to be underwriting\ndiscounts and commissions under the Securities Act of 1933.\n\nUnder agreements that we may enter into, underwriters, dealers or agents who\nparticipate in the distribution of securities by use of this\nprospectus and an applicable prospectus supplement may be entitled to\nindemnification by us against certain liabilities, including liabilities under the\nSecurities Act of 1933, or to contribution with respect to payments that those\nunderwriters,\ndealers or agents may be required to make.\n\nWe may offer to sell securities either at a fixed price or at prices that may be\nchanged, at\nmarket prices prevailing at the time of sale, at prices related to prevailing\nmarket prices or at negotiated prices.\n\nUnderwriters,\ndealers, agents or their affiliates may be customers of, engage in transactions\nwith, or perform services for, us and our subsidiaries in the ordinary course of\nbusiness.\n\nOur direct or indirect wholly-owned subsidiaries, including J.P. Morgan Securities\nLLC, may use this prospectus and the applicable prospectus\nsupplement in connection with offers and sales of securities in the secondary\nmarket. Those subsidiaries may act as principal or agent in those transactions.\nSecondary market sales will be made at prices related to prevailing market prices\nat the\ntime of sale.\n\n43\n\nWe may also use this prospectus to directly solicit offers to purchase securities.\nExcept as set\nforth in the applicable prospectus supplement, none of our directors, officers, or\nemployees nor those of our bank subsidiaries will solicit or receive a commission\nin connection with those direct sales. Those persons may respond to inquiries by\npotential purchasers and perform ministerial and clerical work in connection with\ndirect sales.\n\nConflicts of Interest\n\nWe own directly or indirectly all the outstanding equity securities of J.P. Morgan\nSecurities LLC. The underwriting arrangements for any\noffering pursuant to this prospectus will comply with the requirements of Rule\n5121 of the regulations of FINRA regarding a FINRA member firm\u0092s underwriting of\nsecurities of an affiliate. In accordance with Rule 5121, J.P. Morgan Securities\nLLC\nmay not make sales pursuant to this prospectus to any discretionary account\nwithout the prior approval of the customer.\n\nINDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n\nThe financial statements and management\u0092s assessment of the effectiveness of\ninternal control over financial reporting (which is included in Management\u0092s\nReport on Internal Control over Financial Reporting) incorporated in this\nprospectus by reference to the Annual Report on Form 10-K of JPMorgan Chase & Co.\nfor the\nyear ended December 31, 2021 have been so incorporated in reliance on the report\nof PricewaterhouseCoopers LLP, an independent registered public accounting firm,\ngiven on the authority of said firm as experts in auditing and accounting.\n\nLEGAL OPINIONS\n\nSimpson Thacher & Bartlett LLP, New York, New York, will provide an opinion for us\nregarding the validity of the offered securities and\nCravath, Swaine & Moore LLP, New York, New York, will provide such an opinion for\nthe underwriters. Cravath, Swaine & Moore LLP acts as legal counsel to us and our\nsubsidiaries in a substantial number of matters on a regular basis.\n\n44\n\nThe information in this prospectus addendum is not complete and may be changed. We\nmay not sell these securities until the registration statement filed with the\nSecurities and Exchange Commission is effective. This prospectus addendum is not\nan offer to sell these securities, and we are not soliciting offers to buy these\nsecurities, in any state where the offer or sale is not permitted.\n\nSUBJECT TO COMPLETION, DATED\n\nProspectus addendum\n\n(To Prospectus dated , 2022)\n\nDebt Securities\n\nPreferred Stock\n\nDepositary Shares\n\nWarrants\n\nUnits\n\nAffiliates of JPMorgan Chase & Co. (\u0093JPMorgan Chase\u0094), including J.P. Morgan\nSecurities LLC, may use this prospectus addendum in\nconnection with offers and sales in the secondary markets related to market-making\ntransactions in the outstanding securities of JPMorgan Chase referenced herein.\nThese affiliates of JPMorgan Chase may act as principal or agent in those\ntransactions. Secondary market sales by any of these affiliates will be made at\nprices related to prevailing market prices at the time of sale. JPMorgan Chase\nwill not receive any of the proceeds of those sales. These affiliates of JPMorgan\nChase do\nnot have any obligation to make a market in the securities referenced herein, and\nmay discontinue their market-making activities at any time with notice, in their\nsole discretion.\n\nThe outstanding securities being offered by use of this prospectus addendum\nconsist of debt securities, preferred stock, depositary shares,\nwarrants and units previously registered under the following registration\nstatements of JPMorgan Chase or predecessor companies of JPMorgan Chase:\n333-230098, 333-209681, 333-191692, 333-169900, 333-146731, 333-117775,\n333-107207, 333-71876,\n333-94393, 333-14959, 333-14959-02, 333-14959-03, 333-37567, 333-37567-03,\n333-117785, 333-117785-05, 333-126750, 333-126750-02, 333-126750-04, 333-116775,\n333-116775-02, 333-116773, 333-116773-01, 333-70639,\n33-49965, 33-64261, 33-64193, 33-60807, 33-64195, 333-22413, 333-15649 and\n333-136666. The descriptions of the securities being offered hereby are contained\nin the prospectuses and supplements thereto pursuant\nto which those securities were initially offered that are contained in or deemed a\npart of the registration statements referred to above. The instruments governing\nthose securities and other exhibits in respect of those securities were filed as\nexhibits or incorporated by reference in those registration statements. Those\ndescriptions and exhibits are incorporated by reference into this prospectus\naddendum, except that information contained in those prospectuses and supplements\nthereto that\n(i) constitutes a description of JPMorgan Chase or any of its predecessors or (ii)\nincorporates by reference any information contained in JPMorgan Chase\u0092s current or\nperiodic reports filed with the SEC, are superseded by the information\ncontained in the prospectus to which this prospectus addendum is attached.\n\nThe following securities are listed on the New York Stock\nExchange under the trading symbols indicated:\n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 5.75% Non-Cumulative Preferred                                     \n      Stock, Series DD, listed under the trading symbol \u0093JPM PR D\u0094;                 \n                                                                                  \n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 6.00% Non-Cumulative Preferred                                     \n      Stock, Series EE, listed under the trading symbol \u0093JPM PR C\u0094;                 \n                                                                                  \n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 4.75% Non-Cumulative Preferred                                     \n      Stock, Series GG, listed under the trading symbol \u0093JPM PR J\u0094;                 \n                                                                                  \n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 4.55% Non-Cumulative Preferred                                     \n      Stock, Series JJ, listed under the trading symbol \u0093JPM PR K\u0094;                 \n                                                                                  \n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 4.625% Non-Cumulative Preferred                                    \n      Stock, Series LL, listed under the trading symbol \u0093JPM PR L\u0094; and             \n                                                                                  \n                                                                                  \n      Depositary Shares, each representing a one-four hundredth interest in a     \n      share of 4.20% Non-Cumulative Preferred                                     \n      Stock, Series MM, listed under the trading symbol \u0093JPM PR M\u0094.                 \n                                                                                  \nThese securities have not been approved by the Securities and Exchange Commission\n(the \u0093SEC\u0094) or any state securities commission, nor have these organizations\ndetermined that this prospectus addendum is accurate or complete. Any\nrepresentation to the contrary is a criminal offense.\n\nSee the section entitled \u0093Risk Factors\u0094 in our most recent Annual Report on Form\n10-K and any subsequent Quarterly Report on Form 10-Q, and any risk factors\ndescribed in an applicable prospectus supplement, for a discussion of risks you\nshould consider in connection with an investment in any of the securities offered\nunder this prospectus addendum.\n\nIn making your investment decision, you should rely only on the information\ncontained or incorporated by reference in this prospectus addendum, any applicable\nsupplement to this prospectus addendum or in any related free writing prospectus\nthat we prepare or authorize. We have not authorized anyone to provide you with\nany other information.\n\nNeither we nor any of our affiliates is making an offer of securities in any state\nor jurisdiction where the offer is not permitted.\n\nThis prospectus addendum is dated\n, 2022.\n\nPART II\n\nINFORMATION NOT REQUIRED IN PROSPECTUS\n                                                          \n  ITEM 14.  Other Expenses of Issuance and Distribution.  \n                                                          \nEstimated expenses in connection with the issuance and distribution of the\nsecurities being registered other than underwriting compensation are\nas follows:\n                                                                \n  Registration fee \u0097 Securities and Exchange    $  \u0086              \n  Commission                                                    \n  Attorneys\u0092 fees and expenses                     (1,500,000)*  \n  Accountants\u0092 fees and expenses                   (3,500,000)*  \n  Printing and engraving expenses                 (1,000,000)*  \n  Rating agency fees                              (2,000,000)*  \n  Trustee fees                                    (100,000)*    \n  Miscellaneous expenses                          (150,000)*    \n  Total                                        $                \n                                                                \n                                                                                \n    To be provided in a pre-effective amendment to the Registration Statement.  \n                                                                                \n                \n  *  Estimated  \n                \n                                                        \n  ITEM 15.  Indemnification of Directors and Officers.  \n                                                        \nPursuant to the Delaware General Corporation Law (\u0093DGCL\u0094), a corporation may\nindemnify any person who was or is a party or is\nthreatened to be made a party to any threatened, pending or completed action, suit\nor proceeding, whether civil, criminal, administrative or investigative (other\nthan a derivative action by or in the right of such corporation) who is or was a\ndirector, officer, employee or agent of such corporation, or serving at the\nrequest of such corporation in such capacity for another corporation, partnership,\njoint venture, trust or other enterprise, against expenses (including attorneys\u0092\nfees), judgments, fines and amounts paid in settlement actually and reasonably\nincurred in connection with such action, suit or proceeding, if such person acted\nin good faith and in a manner he or she reasonably believed to be in or not\nopposed to\nthe best interests of such corporation, and, with respect to any criminal action\nor proceeding, had no reasonable cause to believe his or her conduct was unlawful.\n\nThe DGCL also permits indemnification by a corporation under similar circumstances\nfor expenses (including attorneys\u0092 fees) actually and\nreasonably incurred by such persons in connection with the defense or settlement\nof a derivative action, except that no indemnification shall be made in respect of\nany claim, issue or matter as to which such person shall have been adjudged to be\nliable to such corporation unless and only to the extent that the Delaware Court\nof Chancery or the court in which such action or suit was brought shall determine\nupon application that such person is fairly and reasonably entitled to indemnity\nfor\nsuch expenses which such court shall deem proper.\n\nThe DGCL provides that the indemnification described above shall not be deemed\nexclusive of any other indemnification that may be granted by a corporation\npursuant to its by-laws, disinterested directors\u0092 vote, stockholders\u0092 vote,\nagreement or otherwise.\n\nThe DGCL also provides corporations with the power to purchase and maintain\ninsurance on behalf of any person who is or was a director,\nofficer, employee or agent of the corporation, or is or was serving at the request\nof the corporation in a similar capacity for another corporation, partnership,\njoint venture, trust or other enterprise, against any liability asserted against\nhim or\nher in any such capacity, or arising out of his or her status as such, whether or\nnot the corporation would have the power to indemnify him or her against such\nliability as described above.\n\nII-1\n\nThe certificate of incorporation of JPMorgan Chase & Co. (\u0093JPMorgan Chase\u0094)\nprovides that, to the fullest extent that the DGCL as from time to time in effect\npermits the limitation or elimination of the liability of directors, no director\nof JPMorgan Chase shall be personally liable to JPMorgan Chase or its stockholders\nfor\nmonetary damages for breach of fiduciary duty as a director.\n\nJPMorgan Chase\u0092s certificate of incorporation empowers JPMorgan Chase\nto indemnify any director, officer, employee or agent of JPMorgan Chase or any\nother person who is serving at JPMorgan Chase\u0092s request in any such capacity with\nanother corporation, partnership, joint venture, trust or other enterprise\n(including, without limitation, any employee benefit plan) to the fullest extent\npermitted under the DGCL as from time to time in effect, and any such\nindemnification may continue as to any person who has ceased to be a director,\nofficer, employee\nor agent and may inure to the benefit of the heirs, executors and administrators\nof such a person.\n\nJPMorgan Chase\u0092s certificate of\nincorporation also empowers JPMorgan Chase by action of its board of directors,\nnotwithstanding any interest of the directors in the action, to purchase and\nmaintain insurance in such amounts as the Board of Directors deems appropriate to\nprotect\nany director, officer, employee or agent of JPMorgan Chase or any other person who\nis serving at JPMorgan Chase\u0092s request in any such capacity with another\ncorporation, partnership, joint venture, trust or other enterprise (including,\nwithout\nlimitation, any employee benefit plan) against any liability asserted against him\nor her or incurred by him or her in any such capacity or arising out of his or her\nstatus as such (including, without limitation, expenses, judgments, fines\n(including\nany excise taxes assessed on a person with respect to any employee benefit plan)\nand amounts paid in settlement) to the fullest extent permitted under the DGCL as\nfrom time to time in effect, whether or not JPMorgan Chase would have the power or\nbe\nrequired to indemnify any such person under the terms of any agreement or by-law\nor the DGCL.\n\nIn\naddition, JPMorgan Chase\u0092s by-laws require JPMorgan Chase to indemnify, to the\nfullest extent permitted under applicable law, as from time to time in effect, any\nperson who was or is involved in any\nmanner (including, without limitation, as a party or witness), or is threatened to\nbe made so involved, in any threatened, pending or completed investigation, claim,\naction, suit or proceeding, whether civil, criminal, administrative, or\ninvestigative (including without limitation, any action, suit or proceeding by or\nin the right of JPMorgan Chase to procure a judgment in its favor, but excluding\nany action, suit, or proceeding, or part thereof, brought by such person against\nJPMorgan Chase or any of its affiliates unless consented to by JPMorgan Chase) (a\n\u0093Proceeding\u0094) by reason of the fact that he or she is or was a director, officer,\nor employee of JPMorgan Chase, or is or was serving at the request of\nJPMorgan Chase as a director, officer or employee of another corporation,\npartnership, joint venture, trust or other enterprise, against all expenses\n(including attorneys\u0092 fees), judgments, fines and amounts paid in settlement\nactually and\nreasonably incurred by him or her in connection with such Proceeding (or part\nthereof). The by-laws specify that the right to indemnification so provided is a\ncontract right, set forth certain procedural and\nevidentiary standards applicable to the enforcement of a claim under the by-laws\nand entitle the persons to be indemnified to receive payment in advance of any\nexpenses incurred in connection with such\nProceeding, consistent with the provisions of applicable law, as from time to time\nin effect. Such provisions, however, are intended to be in furtherance and not in\nlimitation of the general right to indemnification provided in the by-laws, which\nright of indemnification and of advancement of expenses is not exclusive of any\nother rights to which a person seeking indemnification may otherwise be entitled,\nunder any statute, by-law, agreement,\nvote or otherwise.\n\nJPMorgan Chase\u0092s by-laws also provide that JPMorgan Chase may enter into\ncontracts with any director, officer or employee of JPMorgan Chase in furtherance\nof the indemnification provisions in the by-laws, as well as create a trust fund,\ngrant a security interest or use other means\n(including, without limitation, a letter of credit) to ensure payment of amounts\nindemnified.\n\nLastly, JPMorgan Chase\u0092s by-laws also provide that any repeal or modification of\nthe indemnification rights provided in the by-laws shall not adversely affect any\nright or protection thereunder\nof any person in respect of any act or omission occurring prior to the time of\nsuch repeal or modification.\n\nII-2\n\nThe foregoing statements are subject to the detailed provisions of Section 145 of\nthe DGCL\nand the certificate of incorporation and by-laws of JPMorgan Chase.\n                      \n  ITEM 16.  Exhibits  \n                      \nThe exhibits to this registration statement are listed in the exhibit index, which\nappears elsewhere herein and is incorporated herein by\nreference.\n                           \n  ITEM 17.  Undertakings.  \n                           \nThe undersigned Registrant hereby undertakes:\n\n(1) To file, during any period in which offers or sales are being made, a post-\neffective amendment to this registration\nstatement:\n\n(i) To include any prospectus required by Section 10(a)(3) of the Securities Act\nof 1933;\n\n(ii) To reflect in the prospectus any facts or events arising after the effective\ndate of the registration statement (or the\nmost recent post-effective amendment thereof) which, individually or in the\naggregate, represent a fundamental change in the information set forth in the\nregistration statement. Notwithstanding the foregoing, any increase or decrease in\nvolume of\nsecurities offered (if the total dollar value of securities offered would not\nexceed that which was registered) and any deviation from the low or high end of\nthe estimated maximum offering range may be reflected in the form of prospectus\nfiled with\nthe Commission pursuant to Rule 424(b) if, in the aggregate, the changes in volume\nand price represent no more than a 20% change in the maximum aggregate offering\nprice set forth in the \u0093Calculation of Registration Fee\u0094 table in the\neffective registration statement; and\n\n(iii) To include any material information with respect to the plan of distribution\nnot previously disclosed in the registration statement or any material change to\nsuch information in the registration statement;\n\nprovided,\nhowever, that paragraphs (1)(i), (1)(ii) and (1)(iii) do not apply if the\ninformation required to be included in a post-effective amendment by those\nparagraphs is contained in reports filed with or furnished to the Commission by\nthe\nRegistrant pursuant to Section 13 or Section 15(d) of the Securities Exchange Act\nof 1934 that are incorporated by reference in the registration statement, or is\ncontained in a form of prospectus filed pursuant to Rule 424(b) that is part of\nthe\nregistration statement.\n\n(2) That, for the purpose of determining any liability under the Securities Act of\n1933, each such\npost-effective amendment shall be deemed to be a new registration statement\nrelating to the securities offered therein, and the offering of such securities at\nthat time shall be deemed to be the initial bona fide offering thereof.\n\n(3) To remove from registration by means of a post-effective amendment any of the\nsecurities being registered which remain\nunsold at the termination of the offering.\n\n(4) That, for the purpose of determining liability under the Securities Act of\n1933 to any purchaser:\n\n(i) Each prospectus filed by the Registrant pursuant to Rule 424(b)(3) shall be\ndeemed to be part\nof the registration statement as of the date the filed prospectus was deemed part\nof and included in the registration statement; and\n\n(ii) Each prospectus required to be filed pursuant to Rule 424(b)(2), (b)(5), or\n(b)(7) as part of a registration statement in\nreliance on Rule 430B relating to an offering made pursuant to Rule 415(a)(1)(i),\n(vii), or (x) for the purpose of providing the information required by Section\n10(a) of the Securities Act of 1933 shall be deemed to be part of and included\nin the registration statement as of the earlier of the date such form of\nprospectus is first used after effectiveness or the date of the first contract of\nsale of securities in the offering described in the prospectus. As provided in\nRule 430B, for\nliability purposes of the issuer and any person that is at that date an\nunderwriter, such date shall be deemed to be a new effective date of\n\nII-3\n\nthe registration statement relating to the securities in the registration\nstatement to which that prospectus relates, and the offering of such securities at\nthat time shall be deemed to be the\ninitial bona fide offering thereof. Provided, however, that no statement made in a\nregistration statement or prospectus that is part of the registration statement or\nmade in a document incorporated or deemed incorporated by reference into the\nregistration statement or prospectus that is part of the registration statement\nwill, as to a purchaser with a time of contract of sale prior to such effective\ndate, supersede or modify any statement that was made in the registration\nstatement or\nprospectus that was part of the registration statement or made in any such\ndocument immediately prior to such effective date.\n\n(5) That, for the purpose of determining liability of the Registrant under the\nSecurities Act of 1933 to any purchaser in the\ninitial distribution of the securities, the undersigned Registrant undertakes that\nin a primary offering of securities of the undersigned Registrant pursuant to this\nregistration statement, regardless of the underwriting method used to sell the\nsecurities to the purchaser, if the securities are offered or sold to such\npurchaser by means of any of the following communications, the undersigned\nRegistrant will be a seller to the purchaser and will be considered to offer or\nsell such\nsecurities to such purchaser:\n\n(i) Any preliminary prospectus or prospectus of the undersigned Registrant\nrelating to the\noffering required to be filed pursuant to Rule 424;\n\n(ii) Any free writing prospectus relating to the offering prepared by\nor on behalf of the undersigned Registrant or used or referred to by the\nundersigned Registrant;\n\n(iii) The portion of any\nother free writing prospectus relating to the offering containing material\ninformation about the undersigned Registrant or its securities provided by or on\nbehalf of the undersigned Registrant; and\n\n(iv) Any other communication that is an offer in the offering made by the\nundersigned Registrant to the purchaser.\n\nThe undersigned Registrant hereby undertakes that, for purposes of determining any\nliability under the Securities Act of 1933 each filing of\nthe Registrant\u0092s annual report pursuant to Section 13(a) or Section 15(d) of the\nSecurities Exchange Act of 1934 (and, where applicable, each filing of an employee\nbenefit plan\u0092s annual report pursuant to Section 15(d) of\nthe Securities Exchange Act of 1934) that is incorporated by reference in the\nregistration statement shall be deemed to be a new registration statement relating\nto the securities offered therein, and the offering of such securities at that\ntime\nshall be deemed to be the initial bona fide offering thereof.\n\nInsofar as indemnification for liabilities arising under the Securities Act\nof 1933 may be permitted to directors, officers and controlling persons of the\nRegistrant pursuant to the foregoing provisions, or otherwise, the Registrant has\nbeen advised that in the opinion of the Securities and Exchange Commission such\nindemnification is against public policy as expressed in the Act and is,\ntherefore, unenforceable. In the event that a claim for indemnification against\nsuch liabilities (other than the payment by the Registrant of expenses incurred or\npaid by a\ndirector, officer or controlling person of the Registrant in the successful\ndefense of any action, suit or proceeding) is asserted by such director, officer\nor controlling person in connection with the securities being registered, the\nRegistrant\nwill, unless in the opinion of its counsel the matter has been settled by\ncontrolling precedent, submit to a court of appropriate jurisdiction the question\nwhether such indemnification by it is against public policy as expressed in the\nSecurities\nAct and will be governed by the final adjudication of such issue.\n\nII-4\n\nEXHIBIT INDEX\n                                                                                  \n  Exhibit    Document Description                                                 \n  Number                                                                          \n  1.1        Form of Debt Securities Underwriting Agreement.                      \n  1.2        Form of Equity Securities Underwriting Agreement.                    \n             Form of Certificate for shares of Common Stock (incorporated by      \n  4.1        reference to Exhibit 4.1 to the Registration Statement on Form S-3   \n             (File No. 333-71876)                                                 \n             of JPMorgan Chase & Co.).                                            \n             Form of Certificate of Designations for Preferred Stock              \n  4.2        (incorporated by reference to Exhibit 4.2 to the Registration        \n             Statement on Form S-3 (File                                          \n             No. 333-191692) of JPMorgan Chase & Co.).                            \n             Form of Deposit Agreement (incorporated by reference to Exhibit 4.3  \n  4.3        to the Registration Statement on Form S-3 (File No. 333-191692) of   \n             JPMorgan                                                             \n             Chase & Co.).                                                        \n  4.4        Form of Depositary Receipt representing Depositary Shares, included  \n             in Exhibit 4.3 hereto.                                               \n             Form of Debt Securities Warrant Agreement (incorporated by           \n  4.5        reference to Exhibit 4.24 to the Registration Statement on Form S-3  \n             (File No. 333-71876)                                                 \n             of JPMorgan Chase & Co.).                                            \n             Form of Preferred Stock Warrant Agreement (incorporated by           \n  4.6        reference to Exhibit 4.25 to the Registration Statement on Form S-3  \n             (File No. 333-71876)                                                 \n             of JPMorgan Chase & Co.).                                            \n             Form of Common Stock Warrant Agreement (incorporated by reference    \n  4.7        to Exhibit 4.26 to the Registration Statement on Form S-3 (File No.  \n             333-71876)                                                           \n             of JPMorgan Chase & Co.).                                            \n             Indenture, dated as of October 21, 2010, between JPMorgan Chase &    \n             Co. and Deutsche Bank Trust Company Americas (incorporated by        \n  4.8        reference to Exhibit                                                 \n             4.1 to the Current Report on Form 8-K (File No. 1-05805) of          \n             JPMorgan Chase & Co. filed October 21, 2010).                        \n             First Supplemental Indenture, dated as of January 13, 2017, between  \n             JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas, as    \n  4.9        Trustee,                                                             \n             to the Indenture, dated as of October 21, 2010 (incorporated by      \n             reference to Exhibit 4.1 to the Current Report on Form 8-K of        \n             JPMorgan Chase & Co. (File No. 1-5805) filed January 13, 2017).      \n  4.10       Form of Senior Debt Security, included in Exhibit 4.8 hereto.        \n             Subordinated Indenture dated as of March 14, 2014 between JPMorgan   \n             Chase & Co. and U.S. Bank Trust National Association, as Trustee,    \n  4.11       incorporated                                                         \n             by reference to Exhibit 4.1 to the Current Report on Form 8-K (File  \n             No. 1-5805) of JPMorgan Chase & Co. filed March 14, 2014).           \n             First Supplemental Indenture, dated as of January 13, 2017, between  \n             JPMorgan Chase & Co. and U.S. Bank Trust National Association, as    \n             Trustee,                                                             \n  4.12       to the Subordinated Indenture, dated as of March 14, 2014            \n             (incorporated by reference to Exhibit 4.2 to the Current Report on   \n             Form 8-K of JPMorgan Chase & Co. (File No. 1-5805) filed January     \n             13, 2017).                                                           \n  4.13       Form of Subordinated Debt Security, included in Exhibit 4.11         \n             hereto.                                                              \n  4.14       Form of Unit Agreement.*                                             \n  4.15       Form of Units.*                                                      \n  5.1        Opinion of Simpson Thacher & Bartlett LLP.                           \n  23.1       Consent of PricewaterhouseCoopers LLP.                               \n  23.2       Consent of Simpson Thacher & Bartlett LLP (included in Exhibit       \n             5.1).                                                                \n  24.1       Powers of Attorney of JPMorgan Chase & Co.                           \n                                                                                  \nII-5\n                                                                                  \n  Exhibit    Document Description                                                 \n  Number                                                                          \n             Form T-1 Statement of Eligibility under the Trust Indenture Act of   \n  25.1       1939 of Deutsche Bank Trust Company Americas under the Senior        \n             Indenture.                                                           \n             Form T-1 Statement of Eligibility under the Trust Indenture Act of   \n  25.2       1939 of U.S. Bank Trust National Association under the Subordinated  \n             Indenture.                                                           \n  107        Filing Fee Table                                                     \n                                                                                  \n                                                                     \n  *  To be filed by amendment or with a Current Report on Form 8-K.  \n                                                                     \nII-6\n\nSIGNATURES\n\nPursuant to the requirements of the Securities Act of 1933, as amended, the\nRegistrant certifies that it has reasonable grounds to believe\nthat it meets all of the requirements for filing this Form S-3 and has duly caused\nthis Registration Statement to be signed on its behalf by the undersigned,\nthereunto duly authorized, in the City of New\nYork, State of New York, on March 4, 2022\n                                                               \n          JPMORGAN CHASE & CO.                                 \n  By:                           /s/    STEPHEN B. GRANT        \n  Name:                         Stephen B. Grant               \n  Title:                        Assistant Corporate Secretary  \n                                                               \nPursuant to the requirements of the Securities Act of 1933, this Registration\nStatement has been signed\non behalf of the Registrant by the following persons in the capacities and on the\ndates indicated.\n                                                                                  \n  Signature              Title                                                    \n  *                      Director, Chairman of the Board and                      \n  James Dimon            Chief Executive Officer (Principal        Date           \n  *                      Executive Officer)                        March 4, 2022  \n  Linda B. Bammann       Director                                  March 4, 2022  \n ──────────────────────────────────────────────────────────────────────────────── \n  *                      Director                                  March 4, 2022  \n  Stephen B. Burke                                                                \n  *                      Director                                  March 4, 2022  \n  Todd A. Combs                                                                   \n  *                      Director                                  March 4, 2022  \n  James S. Crown                                                                  \n  *                      Director                                  March 4, 2022  \n  Timothy P. Flynn                                                                \n  *                      Director                                  March 4, 2022  \n  Mellody Hobson                                                                  \n  *                      Director                                  March 4, 2022  \n  Michael A. Neal                                                                 \n  *                      Director                                  March 4, 2022  \n  Phebe N. Novakovic                                                              \n  *                      Director                                  March 4, 2022  \n  Virginia M. Rometty                                                             \n  *                      Executive Vice President and Chief                       \n  Jeremy Barnum          Financial Officer (Principal Financial    March 4, 2022  \n                         Officer)                                                 \n                                                                                  \nII-7\n                                                                                  \n  Signature          Title                                                        \n  *                  Managing Director and Corporate Controller    Date           \n  Elena Korablina    (Principal Accounting Officer)                March 4, 2022  \n ──────────────────────────────────────────────────────────────────────────────── \n                                                                                  \n                                                                                  \n     Stephen B. Grant hereby signs this Registration Statement on behalf of each  \n     of the indicated persons for whom                                            \n     he is attorney-in-fact on March 4, 2022 pursuant to powers of attorney       \n  *  filed as exhibits to the Registration Statement.                             \n ──────────────────────────────────────────────────────────────────────────────── \n                                                                                  \n                                  \n  By:    /S/    STEPHEN B. GRANT  \n         Stephen B. Grant         \n                                  \nDated: March 4, 2022\n\nII-8\n"
}