{
  "cik": 19617,
  "company_name": "JPMorgan_Chase",
  "ticker": "JPM",
  "form_type": "S-3",
  "filing_date": "2023-02-24",
  "period": "",
  "accession_number": "0000950103-23-002971",
  "file_url": "https://www.sec.gov/Archives/edgar/data/19617/0000950103-23-002971-index.html",
  "text": "                 As filed with the Securities and Exchange Commission on February 24, 2023                  \n                                                                             Registration Nos. 333- and 333-\n                                               UNITED STATES                                                \n                                                                                                            \n                                     SECURITIES AND EXCHANGE COMMISSION                                     \n                                                                                                            \n                                            WASHINGTON, DC 20549                                            \n                                                                                                            \n                                                  FORM S-3                                                  \n                                                                                                            \n                                        REGISTRATION STATEMENT UNDER                                        \n                                         THE SECURITIES ACT OF 1933                                         \n                                                                                                            \n                                            JPMORGAN CHASE & CO.                                            \n                                                                                                            \n                           (Exact name of registrant as specified in its charter)                           \n                                                                                    \n  Delaware                                                   13-2624428             \n  (State or other jurisdiction of                            -IRS Employer          \n  incorporation or organization)                             Identification Number  \n                                   JPMorgan Chase & Co.                             \n                                   383 Madison Avenue                               \n                                   New York, New York 10179                         \n                                   (212) 270-6000                                   \n                                                                                    \n                            (Address, including zip code, and telephone number,                             \n                     including area code, of registrant’s principal executive offices)                      \n                                                                                                            \n                                    JPMORGAN CHASE FINANCIAL COMPANY LLC                                    \n                                                                                                            \n                           (Exact name of registrant as specified in its charter)                           \n                                                                                                \n  Delaware                                                               47-5462128             \n  (State or other jurisdiction of                                        -IRS Employer          \n  incorporation or organization)                                         Identification Number  \n                                   JPMorgan Chase Financial Company LLC                         \n                                   383 Madison Avenue, Floor 5                                  \n                                   New York, New York 10179                                     \n                                   (212) 270-6000                                               \n                                                                                                \n                            (Address, including zip code, and telephone number,                             \n                     including area code, of registrant’s principal executive offices)                      \n                                  \n  John H. Tribolati               \n  Corporate Secretary             \n  JPMorgan Chase & Co.            \n  277 Park Avenue                 \n  New York, New York 10172-10003  \n  (212) 270-6000                  \n                                  \n                             (Name, address, including zip code, and telephone                              \n                             number, including area code, of agent for service)                             \n                                                                                                            \n                                                 Copies to:                                                 \n                                                                                             \n  Lee Meyerson, Esq.              Stephen B. Grant, Esq.                                     \n  Hui Lin, Esq.                   Scott L. Nearing, Esq.          Yan Zhang, Esq.            \n  Benjamin Heriaud, Esq.          JPMorgan Chase & Co.            Davis Polk & Wardwell LLP  \n  Simpson Thacher & Bartlett LLP  277 Park Avenue                 450 Lexington Avenue       \n  425 Lexington Avenue            New York, New York 10172-10003  New York, New York 10017   \n  New York, New York 10017        (212) 270-6000                  (212) 450-4000             \n  (212) 455-2000                                                                             \n                                                                                             \nApproximate date of commencement of proposed sale to the public: From time to time after this Registration\nStatement becomes effective.\n\nIf the only securities being registered on this Form are being offered pursuant to dividend or interest\nreinvestment plans, please check the following box.☐\n\nIf any of the securities being registered on this Form are to be offered on a delayed or continuous basis\npursuant to Rule 415 under the Securities Act of 1933, other than securities offered only in connection with\ndividend or interest reinvestment plans, check the following box.☒\n\nIf this Form is filed to register additional securities for an offering pursuant to Rule 462(b) under the\nSecurities Act, please check the following box and list the Securities Act registration statement number of\nthe earlier effective registration statement for the same offering.☐\n\nIf this Form is a post-effective amendment filed pursuant to Rule 462(c) under the Securities Act, check the\nfollowing box and list the Securities Act registration statement number of the earlier effective\nregistration statement for the same offering.☐\n\nIf this Form is a registration statement pursuant to General Instruction I.D. or a post-effective amendment\nthereto that shall become effective upon filing with the Commission pursuant to Rule 462(e) under the\nSecurities Act, check the following box.☐\n\nIf this Form is a post-effective amendment to a registration statement filed pursuant to General Instruction\nI.D. filed to register additional securities or additional classes of securities pursuant to Rule 413(b)\nunder the Securities Act, check the following box.☐\n\nIndicate by check mark whether the registrant\nis a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller reporting company, or\nan emerging growth company. See\nthe definitions of “large accelerated filer,” “accelerated filer,” “smaller reporting company” and\n“emerging growth company” in Rule 12b-2 of the Exchange Act.\n\n(Check one):\n\nJPMorgan Chase & Co.\n                                                            \n  Large accelerated filer  ☒  Accelerated filer  ☐          \n  Non-accelerated filer  ☐    Smaller reporting company  ☐  \n                              Emerging growth company  ☐    \n                                                            \nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended\ntransition period for complying with any new or revised financial accounting standards provided pursuant to\nSection 7(a)(2)(B) of the Securities Act.☐\n\nTHE REGISTRANTS HEREBY AMEND THIS REGISTRATION STATEMENT ON SUCH DATE\nOR DATES AS MAY BE NECESSARY TO DELAY ITS EFFECTIVE DATE UNTIL THE REGISTRANTS SHALL FILE A FURTHER\nAMENDMENT WHICH SPECIFICALLY STATES\nTHAT THIS REGISTRATION STATEMENT SHALL THEREAFTER BECOME EFFECTIVE IN ACCORDANCE WITH SECTION 8(a) OF THE\nSECURITIES ACT OF 1933, AS AMENDED,\nOR UNTIL THE REGISTRATION STATEMENT SHALL BECOME EFFECTIVE ON SUCH DATE AS THE SECURITIES AND EXCHANGE\nCOMMISSION, ACTING PURSUANT TO\nSAID SECTION 8(a), MAY DETERMINE.\n\nThe information in this prospectus is not complete and may be changed. We may not sell these securities\nuntil the registration statement filed with the Securities and Exchange Commission is effective. This\nprospectus is not an offer to sell these securities and it is not soliciting an offer to buy these\nsecurities in any jurisdiction where the offer or sale is not permitted.\n                               SUBJECT TO COMPLETION, DATED FEBRUARY 24, 2023                               \nProspectus\n                                              $100,000,000,000                                              \n                                                                                                            \n                                            JPMorgan Chase & Co.                                            \n                                                                                                            \n                                              Debt Securities                                               \n                                                                                                            \n                                                  Warrants                                                  \n                                                                                                            \n                                                   Units                                                    \n                                                                                                            \n                                             Purchase Contracts                                             \n                                                                                                            \n                                                 Guarantees                                                 \n                                                                                                            \n                                    JPMorgan Chase Financial Company LLC                                    \n                                                                                                            \n                                              Debt Securities                                               \n                                                                                                            \n                                                  Warrants                                                  \nWe, JPMorgan Chase & Co., may from time to\ntime offer and sell any of our securities listed above, in each case, in one or more series. Our subsidiary,\nJPMorgan Chase\nFinancial Company LLC, which we refer to as “JPMorgan Financial,” also may from time to time offer and sell\nits securities\nlisted above, in each case, in one or more series. We fully and unconditionally guarantee all payments of\nprincipal, interest\nand other amounts payable on any debt securities or warrants JPMorgan Financial issues. Up to\n$100,000,000,000, or the equivalent\nthereof in any other currency, of these securities may be offered from time to time, in amounts, on terms\nand at prices that will be determined\nat the time they are offered for sale. These terms and prices will be described in more detail in one or\nmore supplements to\nthis prospectus.\n\nYou should read this prospectus and the applicable supplement or supplements to this prospectus carefully\nbefore you invest. Investing in these securities involves a number of risks. See the section entitled “Risk\nFactors” in our most recent Annual Report on Form 10-K and any subsequent Quarterly Report on Form 10-Q, and\nany risk factors described in the applicable supplement or supplements to this prospectus, for a discussion\nof risks you should consider in connection with an investment in any of the securities offered under this\nprospectus.\n\nThese securities will not be listed on any securities\nexchange unless otherwise specified in one or more supplements to this prospectus.\n\nNeither the Securities and Exchange Commission\nnor any state securities commission has approved or disapproved of these securities or passed upon the\nadequacy or accuracy of this prospectus\nor any supplement. Any representation to the contrary is a criminal offense.\n\nThese securities are not bank deposits, are not insured by the Federal Deposit Insurance Corporation or any\nother governmental agency and are not obligations of, or guaranteed by, a bank.\n                                         This prospectus is dated ,                                         \n                                                    2023                                                    \n                                                                                                            \n                                           ABOUT THIS PROSPECTUS                                            \nThis prospectus is part of a Registration Statement\nthat we and JPMorgan Financial filed with the Securities and Exchange Commission, which we refer to as the\nSEC, utilizing a “shelf”\nregistration process. Under this shelf registration process, we may, from time to time, sell any combination\nof the relevant\nsecurities described in the prospectus in one or more offerings; and our subsidiary, JPMorgan Financial,\nmay, from time to time, offer\nany combination of the relevant securities described in this prospectus in one or more offerings.\n\nThis prospectus provides you with a general description\nof the securities we or JPMorgan Financial may offer. Each time we or JPMorgan Financial sell securities, we\nor JPMorgan Financial\nwill provide one or more prospectus supplements, together with one or more pricing supplements, underlying\nsupplements, product supplements\nand/or other types of offering documents or supplements (together referred to herein as a “prospectus\nsupplement”) that will\ncontain specific information about the terms of the offering. The prospectus supplement may also add, update\nor change information\ncontained in this prospectus. You should read both this prospectus and the accompanying prospectus\nsupplement together with\nthe additional information described under the heading “Where You Can Find More Information” beginning on\npage 1 of this prospectus.\n\nFollowing the initial distribution of an offering\nof securities, J.P. Morgan Securities LLC and other affiliates of ours and, if applicable, other third-party\nbroker dealers may offer\nand sell those securities in the course of their businesses as broker dealers. J.P. Morgan Securities LLC\nand other affiliates\nof ours and, if applicable, other third-party broker dealers may act as principal or agent in these\ntransactions. This prospectus\nand the accompanying prospectus supplement will also be used in connection with those transactions. Sales in\nany of those transactions\nwill be made at varying prices related to prevailing market prices and other circumstances at the time of\nsale.\n\nWe and JPMorgan Financial have not authorized anyone\nto provide any information other than that contained or incorporated by reference in this prospectus or the\naccompanying prospectus supplement. We\nand JPMorgan Financial take no responsibility for, and can provide no assurance as to the reliability of,\nany other information that others\nmay give you. This prospectus and the accompanying prospectus supplement do not constitute an offer to sell\nor the solicitation\nof an offer to buy any securities other than the securities described in the accompanying prospectus\nsupplement or an offer to sell or\nthe solicitation of an offer to buy such securities in any circumstances in which such offer or solicitation\nis unlawful. Neither\nthe delivery of this prospectus or the accompanying prospectus supplement, nor any sale made hereunder and\nthereunder shall, under any\ncircumstances, create any implication that there has been no change in the affairs of JPMorgan Chase & Co.\nor JPMorgan Financial since\nthe date hereof or that the information contained or incorporated by reference herein or therein is correct\nas of any time subsequent\nto the date of such information.\n\nIn this prospectus, “JPMorgan Chase,”\n“we,” “us” and “our” refer to JPMorgan Chase & Co. and not to any of its subsidiaries, except\nwhere the context otherwise requires or as otherwise indicated. We use “JPMorgan Financial” to refer to\nJPMorgan\nChase Financial Company LLC, our wholly owned subsidiary.\n                                                     i                                                      \n                                                                                                            \n                                             Table of Contents                                              \n                                                          \n  Where You Can Find More Information                  1  \n  JPMorgan Chase & Co.                                 2  \n  JPMorgan Chase Financial Company LLC                 2  \n  Use of Proceeds                                      2  \n  Important Factors That May Affect Future Results     3  \n  Description of Debt Securities of JPMorgan Chase &   5  \n  Co.                                                     \n  Description of Warrants of JPMorgan Chase & Co.     13  \n  Description of Units of JPMorgan Chase & Co.        16  \n  Description of Purchase Contracts of JPMorgan       18  \n  Chase & Co.                                             \n  Description of Debt Securities of JPMorgan Chase    20  \n  Financial Company LLC                                   \n  Description of Warrants of JPMorgan Chase           28  \n  Financial Company LLC                                   \n  Forms of Securities                                 35  \n  Plan of Distribution (Conflicts of Interest)        39  \n  Independent Registered Public Accounting Firm       42  \n  Legal Matters                                       42  \n  Benefit Plan Investor Considerations                42  \n                                                          \n                                                     ii                                                     \n                                                                                                            \n                                             Where You Can Find                                             \n                                              More Information                                              \nWe file annual, quarterly and current reports,\nproxy statements and other information with the SEC. The SEC maintains an Internet website that contains\nreports, proxy and\ninformation statements and other materials that are filed through the Commission’s Electronic Data\nGathering, Analysis and Retrieval\n(EDGAR) System or any successor thereto. This website can currently be accessed at http://www.sec.gov. You\ncan find\ninformation we have filed with the SEC by reference to file number 001-05805. Such documents, reports and\ninformation are also\navailable on our website: http://www.jpmorgan.com. Websites that are cited or referred to in this prospectus\ndo not constitute\npart of, and are not incorporated by reference in, this prospectus or any accompanying prospectus\nsupplement.\n\nThis prospectus is part of a registration statement\nwe and JPMorgan Financial filed with the SEC. This prospectus omits some information contained in the\nregistration statement\nin accordance with SEC rules and regulations. You should review the information and exhibits in the\nregistration statement\nfor further information on us and our consolidated subsidiaries and the securities we and JPMorgan Financial\nare offering. Statements\nin this prospectus concerning any document we and JPMorgan Financial filed as an exhibit to the registration\nstatement or that we otherwise\nfiled with the SEC are not intended to be comprehensive and are qualified by reference to these filings. You\nshould review\nthe complete document to evaluate these statements.\n\nThe SEC allows us to “incorporate by reference”\ninto this prospectus the information in documents we file with it, which means that we can disclose\nimportant information to you by referring\nyou to those documents. The information incorporated by reference is considered to be a part of this\nprospectus, and later\ninformation that we file with the SEC will update and supersede this information.\n\nWe incorporate by reference (i) the documents listed\nbelow and (ii) any future filings we make with the SEC under Section 13(a), 13(c), 14, or 15(d) of the\nSecurities Exchange Act of 1934\nduring the period after the date of the initial registration statement and prior to the effectiveness of the\nregistration statement and\nafter the date of this prospectus until the termination of each offering of securities covered by this\nprospectus is completed, other\nthan, in each case, those documents or the portions of those documents that are furnished and not filed:\n                                                       \n       our Annual Report on Form                       \n  (a)  10-K for the year ended December 31, 2022; and  \n ───────────────────────────────────────────────────── \n                                                       \n                                                         \n       our Current Reports on Form 8-K filed on January  \n       13, 2023, January 17, 2023,                       \n       January 17, 2023 and January                      \n  (b)  19, 2023.                                         \n ─────────────────────────────────────────────────────── \n                                                         \nYou may request, at no cost to you, a copy of these\ndocuments by writing or telephoning us at: Office of the Secretary, JPMorgan Chase & Co., 277 Park Avenue,\nNew York, New York 10172-10003\n(Telephone: (212) 270-6000).\n                                                     1                                                      \n                                                                                                            \n                                              JPMorgan Chase &                                              \n                                                    Co.                                                     \nJPMorgan Chase, a financial holding company incorporated\nunder Delaware law in 1968, is a leading financial services firm based in the United States, with operations\nworldwide. JPMorgan Chase\nhad $3.7 trillion in assets and $292.3 billion in stockholders’ equity as of December 31, 2022. JPMorgan\nChase is a leader in investment\nbanking, financial services for consumers and small businesses, commercial banking, financial transaction\nprocessing and asset management.\nUnder the J.P. Morgan and Chase brands, JPMorgan Chase serves millions of customers, predominantly in the\nUnited States, and many of the\nworld’s most prominent corporate, institutional and government clients globally.\n\nJPMorgan Chase’s principal bank subsidiary\nis JPMorgan Chase Bank, National Association, which we refer to as the “Bank,” a national banking\nassociation with U.S. branches\nin 48 states and Washington, D.C. JPMorgan Chase’s principal non-bank subsidiary is J.P. Morgan Securities\nLLC, a U.S. broker-dealer.\nThe bank and non-bank subsidiaries of JPMorgan Chase operate nationally as well as through overseas branches\nand subsidiaries, representative\noffices and subsidiary foreign banks. JPMorgan Chase’s principal operating subsidiaries outside the United\nStates are J.P. Morgan\nSecurities plc and J.P. Morgan SE, which are subsidiaries of the Bank and are based in the United Kingdom\nand Germany, respectively.\n\nThe principal executive office of JPMorgan Chase\nis located at 383 Madison Avenue, New York, New York 10179, U.S.A., and its telephone number is (212)\n270-6000.\n                                          JPMorgan Chase Financial                                          \n                                                Company LLC                                                 \nJPMorgan Financial is a Delaware limited liability\ncompany and an indirect, wholly owned finance subsidiary of JPMorgan Chase, created for the purpose of\nproviding JPMorgan Chase and/or\nits affiliates with financing for their operations by issuing securities designed to meet investor demand\nfor products that reflect certain\nrisk-return profiles and specific market exposure. Any securities issued by JPMorgan Financial will be fully\nand unconditionally\nguaranteed by JPMorgan Chase. JPMorgan Financial expects to lend the net proceeds from these offerings to\nJPMorgan Chase and/or\nits affiliates.\n\nThe principal executive offices of JPMorgan Financial\nare located at 383 Madison Avenue, Floor 5, New York, New York 10179 and its telephone number is (212)\n270-6000.\n                                              Use of Proceeds                                               \nWe will contribute the net proceeds that we receive\nfrom the sale of our securities offered by this prospectus and the accompanying prospectus supplement to our\n“intermediate holding\ncompany” subsidiary, JPMorgan Chase Holdings LLC, which we refer to as the “IHC,” which will use those net\nproceeds\nfor general corporate purposes, in connection with hedging our obligations under the securities or for any\nother purpose described in\nthe applicable prospectus supplement. General corporate purposes may include investments in our\nsubsidiaries, payments of dividends\nto us, extensions of credit to us or our subsidiaries or the financing of possible acquisitions or business\nexpansion.\n\nNet proceeds may be temporarily invested pending\napplication for their stated purpose. Interest on our debt securities and dividends on our equity\nsecurities, as well as redemptions\nor repurchases of our outstanding securities, will be made using amounts we receive as dividends or\nextensions of credit from IHC or as\ndividends from the Bank.\n\nJPMorgan Financial intends to lend the net proceeds\nfrom the sale of its securities offered by this prospectus and the accompanying prospectus supplement to us\nand/or our affiliates. We\nexpect that we and/or our affiliates will use the proceeds from these loans to provide additional funds for\nour and/or their operations\nand for other general corporate purposes.\n                                                     2                                                      \n                                                                                                            \n                                             Important Factors                                              \n                                       That May Affect Future Results                                       \nFrom time to time, we and JPMorgan Financial have\nmade and will make forward-looking statements. These statements can be identified by the fact that they do\nnot relate strictly\nto historical or current facts. Forward-looking statements often use words such as “anticipate,” “target,”\n“expect,” “estimate,” “intend,” “plan,” “goal,” “believe,” or\nother words of similar meaning. Forward-looking statements provide our current expectations or forecasts of\nfuture events,\ncircumstances, results or aspirations. Our and JPMorgan Financial’s disclosures in this prospectus, any\nprospectus supplement\nand any documents incorporated by reference into this prospectus may contain forward-looking statements\nwithin the meaning of the Private\nSecurities Litigation Reform Act of 1995. We also may make forward-looking statements in our other documents\nfiled or furnished\nwith the SEC. In addition, our senior management may make forward-looking statements orally to investors,\nanalysts, representatives\nof the media and others.\n\nAll forward-looking statements are, by their nature,\nsubject to risks and uncertainties, many of which are beyond our control. Our actual future results may\ndiffer materially from\nthose set forth in our forward-looking statements. While there is no assurance that any list of risks and\nuncertainties or\nrisk factors is complete, below are certain factors that could cause actual results to differ from those in\nthe forward-looking statements:\n                                                                                 \n  ·  local, regional and global business, economic and political conditions and  \n     geopolitical events, including the war in Ukraine;                          \n                                                                                 \n                                                                                                      \n  ·  changes in laws, rules and regulatory requirements, including capital and                        \n     liquidity requirements affecting our businesses, and our ability to address those requirements;  \n                                                                                                      \n                                                                                    \n  ·  heightened regulatory and governmental oversight and scrutiny of our business  \n     practices, including dealings with retail customers;                           \n                                                                                    \n                                                               \n  ·  changes in trade, monetary and fiscal policies and laws;  \n                                                               \n                                         \n  ·  changes in the level of inflation;  \n                                         \n                                                         \n  ·  changes in income tax laws, rules and regulations;  \n                                                         \n                                                                                     \n  ·  securities and capital markets behavior, including changes in market liquidity  \n     and volatility;                                                                 \n                                                                                     \n                                                                              \n  ·  changes in investor sentiment or consumer spending or savings behavior;  \n                                                                              \n                                                                   \n  ·  our ability to manage effectively our capital and liquidity;  \n                                                                   \n                                                                    \n  ·  changes in credit ratings assigned to us or our subsidiaries;  \n                                                                    \n                                \n  ·  damage to our reputation;  \n                                \n                                                                                    \n  ·  our ability to appropriately address social, environmental and sustainability  \n     concerns that may arise, including from our business activities;               \n                                                                                    \n                                                                                             \n  ·  our ability to deal effectively with an economic slowdown or other economic             \n     or market disruption, including, but not limited to, in the interest rate environment;  \n                                                                                             \n                                                                              \n  ·  technology changes instituted by us, our counterparties or competitors;  \n                                                                              \n                                               \n  ·  the effectiveness of our control agenda;  \n                                               \n                                                                                                            \n     our ability to develop or discontinue products and services, and the extent                            \n  ·  to which products or services previously sold by us require us to incur liabilities or absorb losses   \n     not contemplated at their initiation                                                                   \n     or origination;                                                                                        \n                                                                                                            \n                                                     3                                                      \n                                                                                  \n  ·  acceptance of our new and existing products and services by the marketplace  \n     and our ability to innovate and to increase market share;                    \n                                                                                  \n                                                                         \n  ·  our ability to attract and retain qualified and diverse employees;  \n                                                                         \n                                       \n  ·  our ability to control expenses;  \n                                       \n                             \n  ·  competitive pressures;  \n                             \n                                                                                  \n  ·  changes in the credit quality of our clients, customers and counterparties;  \n                                                                                  \n                                                                                    \n  ·  adequacy of our risk management framework, disclosure controls and procedures  \n     and internal control over financial reporting;                                 \n                                                                                    \n                                                  \n  ·  adverse judicial or regulatory proceedings;  \n                                                  \n                                                                                   \n  ·  changes in applicable accounting policies, including the introduction of new  \n     accounting standards;                                                         \n                                                                                   \n                                                                                  \n  ·  our ability to determine accurate values of certain assets and liabilities;  \n                                                                                  \n                                                                                                            \n     occurrence of natural or man-made disasters or calamities, including health                            \n     emergencies, the spread of infectious diseases, epidemics or pandemics, an outbreak or escalation of   \n  ·  hostilities or other geopolitical                                                                      \n     instabilities, the effects of climate change or extraordinary events beyond our control, and our       \n     ability to deal effectively with disruptions                                                           \n     caused by the foregoing;                                                                               \n                                                                                                            \n                                                                                     \n  ·  our ability to maintain the security of our financial, accounting, technology,  \n     data processing and other operational systems and facilities;                   \n                                                                                     \n                                                                                \n  ·  our ability to withstand disruptions that may be caused by any failure of  \n     our operational systems or those of third parties; and                     \n                                                                                \n                                                                                                            \n     our ability to effectively defend ourselves against cyberattacks and other                             \n  ·  attempts by unauthorized parties to access our information or that of our customers or to disrupt our  \n     systems.                                                                                               \n                                                                                                            \nAdditional factors that may cause future results\nto differ materially from forward-looking statements can be found in portions of our periodic and current\nreports filed with the SEC and\nincorporated by reference in this prospectus. These factors include, for example, those discussed under the\ncaption “Risk\nFactors” in our most recent annual and quarterly reports, to which reference is hereby made.\n\nAny forward-looking statements made by or on behalf\nof us and JPMorgan Financial in this prospectus, any applicable prospectus supplement or in a document\nincorporated by reference in this\nprospectus speak only as of the date of this prospectus, the applicable prospectus supplement or the\ndocument incorporated by reference,\nas the case may be. We and JPMorgan Financial do not undertake to update any forward-looking statements,\nexcept as required\nby law. You should, however, consult any further disclosures of a forward-looking nature we may make in any\nsubsequent Annual\nReports on Form 10-K, Quarterly Reports on Form 10-Q or Current Reports on Form 8-K.\n                                                     4                                                      \n                                                                                                            \n                                            Description of Debt                                             \n                                     Securities of JPMorgan Chase & Co.                                     \nGeneral\n\nIn this “Description of Debt Securities of\nJPMorgan Chase & Co.” section, all references to “debt securities” refer only to debt securities issued by\nJPMorgan\nChase & Co. and not to any debt securities issued by JPMorgan Chase Financial Company LLC.\n\nThe following description of the terms of the debt\nsecurities contains certain general terms that may apply to the debt securities. The specific terms of any\ndebt securities\nwill be described in one or more prospectus supplements relating to those debt securities.\n\nThe debt securities will be issued under an Indenture\ndated May 25, 2001, between us and Deutsche Bank Trust Company Americas (formerly Bankers Trust Company), as\ntrustee (as has been and\nas may be further supplemented from time to time, for purposes of this section entitled “Description of Debt\nSecurities of JPMorgan\nChase & Co.,” the “Indenture”).\n\nWe have summarized below the material provisions\nof the Indenture and the debt securities issued under the Indenture or indicated which material provisions\nwill be described in the related\nprospectus supplement. These descriptions are only summaries, and each investor should refer to the\nIndenture, which describes\ncompletely the terms and definitions summarized below and contains additional information regarding the debt\nsecurities issued under it. Where\nappropriate, we use parentheses to refer you to the particular sections of the Indenture. Any reference to\nparticular sections\nor defined terms of the Indenture in any statement under this heading qualifies the entire statement and\nincorporates by reference the\napplicable section or definition into that statement.\n\nThe debt securities will be our direct, unsecured\ngeneral obligations and will have the same rank in liquidation as all of our other unsecured and\nunsubordinated debt.\n\nThe Indenture does not limit the aggregate principal\namount of debt securities that may be issued under it. The Indenture provides that debt securities may be\nissued up to the\nprincipal amount authorized by us from time to time. (Section 2.03) We have previously established the\nSeries E medium-term\nnotes under the Indenture. As of December 31, 2022, we had approximately $5.0 billion aggregate principal\namount of Series\nE medium-term notes outstanding under the Indenture. Our board of directors has authorized the issuance of\nsecurities under\nthe registration statement to which this prospectus relates, including Series E medium-term notes, with an\naggregate initial public offering\nprice not to exceed $150 billion, to be issued on or after February 17, 2023.\n\nThe Indenture allows us to reopen a previous issue\nof a series of debt securities and issue additional debt securities of that issue. We have no obligation to\ntake your interests\ninto account when deciding whether to issue additional debt securities. In addition, we are under no\nobligation to reopen any\nseries of debt securities or to issue any additional debt securities.\n\nWe are a holding company that holds the stock of\nthe Bank and IHC. We conduct substantially all of our operations through subsidiaries, including the Bank\nand the IHC. As\na result, claims of the holders of the debt securities will generally have a junior position to claims of\ncreditors of our subsidiaries. Claims\nof our subsidiaries’ creditors other than JPMorgan Chase & Co. include substantial amounts of deposit\nliabilities, long-term\ndebt and other liabilities. In addition, we are obligated to contribute to the IHC substantially all the net\nproceeds that\nwe receive from the issuance of securities (including any securities offered by use of this prospectus), and\nthe ability of the Bank and\nthe IHC to make payments to us is limited. As a result of these arrangements, our ability to make various\npayments is dependent\non our receiving dividends from the Bank and dividends and extensions of credit from the IHC. These\nlimitations could affect\nour ability to pay interest on our debt securities, redeem or repurchase outstanding securities and fulfill\nour other payment obligations.\n\nWe may issue debt securities from time to time\nin one or more series. (Section 2.03) The debt securities may be denominated and payable in U.S. dollars or\nforeign currencies.\n(Section 2.03) We may also issue debt securities, from time to time, with the principal amount, interest or\nother amounts payable\non any relevant payment date to be determined by reference to one or more currency exchange rates, interest\nrates, swap rates, securities\nor baskets of securities, commodity prices, indices, basket of indices,\n                                                     5                                                      \nor any other financial, economic or other measure\nor instrument, including the occurrence or non-occurrence of any event or circumstance. The debt securities\nmay also be issued\nas original issue discount debt securities, which will bear no interest or bear interest at below market\nrates and will be sold at a discount\nto their stated principal amount. In addition, we may issue debt securities as part of units issued by us,\nas described in\n“— Description of Units” below. All references in this prospectus, or any prospectus supplement to other\namounts will include premium, if any, other cash amounts payable under the Indenture, if any, and the\ndelivery of securities or baskets\nof securities under the terms of the debt securities.\n\nThe debt securities may bear interest at a fixed\nrate, which may be zero, or a floating rate.\n\nThe prospectus supplement relating to a particular\nseries of debt securities being offered will specify the particular terms of, and other information relating\nto, those debt securities.\n\nHolders may present debt securities for exchange\nor transfer, in the manner, at the places and subject to the restrictions stated in the debt securities and\ndescribed in the applicable\nprospectus supplement. We will provide these services without charge except for any tax or other\ngovernmental charge payable\nin connection with these services and subject to any limitations provided in the Indenture. (Section 2.08)\n\nIf any of the securities are held in global form,\nthe procedures for transfer of interests in those securities will depend upon the procedures of the\ndepositary for those global securities. See\n“Forms of Securities.”\n\nWe will generally have no obligation to repurchase,\nredeem, or change the terms of the debt securities upon any event (including a change in control) that might\nhave an adverse effect on\nour credit quality.\n\nEvents of Default and Waivers\n\nAn “Event of Default” with respect\nto a series of debt securities issued under the Indenture is defined in the Indenture as:\n                                                                                   \n  ·  default in the payment of interest on any debt securities of that series and  \n     continuance of such default for 30 days;                                      \n                                                                                   \n                                                                                                            \n     default in the payment of principal or other amounts payable on any debt securities                    \n  ·  of that series when due, at maturity, upon redemption, by declaration or otherwise, and continuance    \n     of such default for 30 days;                                                                           \n                                                                                                            \n                                                                                 \n  ·  specified events of our bankruptcy, insolvency, winding up or liquidation,  \n     whether voluntary or involuntary; or                                        \n                                                                                 \n                                                                                    \n  ·  any other event of default provided in the applicable supplemental indentures  \n     to the Indenture or form of security. (Section 5.01)                           \n                                                                                    \nSenior debt securities issued by us prior to December\n31, 2016 (the “Pre-2017 Senior Debt Securities”) are subject to events of default that are different from\nthose set forth\nabove. In particular:\n                                                                                                            \n     the events of default applicable to the Pre-2017 Senior Debt Securities do                             \n  ·  not provide for a 30-day cure period with respect to any failure by us to pay the principal of those   \n     Pre-2017 Senior Debt Securities;                                                                       \n                                                                                                            \n                                                                                                            \n     most series of Pre-2017 Senior Debt Securities contain an additional event                             \n  ·  of default that is applicable if we fail to perform any of the covenants contained in the terms and    \n     conditions of, or the governing instrument                                                             \n     for, those Pre-2017 Senior Debt Securities and that failure continues for 90 days; and                 \n                                                                                                            \n                                                                                                            \n     the events of default applicable to certain series of Pre-2017 Senior Debt                             \n  ·  Securities provide that specified events of bankruptcy, insolvency or reorganization of the Bank.      \n     would constitute an event of default                                                                   \n     with respect to those Pre-2017 Senior Debt Securities.                                                 \n                                                                                                            \n                                                     6                                                      \nIn addition, certain series of senior debt securities\nthat we assumed in connection with our merger with The Bear Stearns Companies Inc. include additional events\nof default.\n\nAccordingly, if we fail to pay the principal of\nany series of Pre-2017 Senior Debt Securities when due, the holders of those Pre-2017 Senior Debt Securities\nwould be entitled to declare\ntheir Pre-2017 Senior Debt Securities due and payable immediately, whereas holders of the debt securities\nwould not be entitled to accelerate\nthe debt securities until 30 days after our failure to pay the principal of the debt securities. In\naddition, holders of the\ndebt securities will not have the benefit of the additional events of default described above that are\napplicable to the Pre-2017 Senior\nDebt Securities.\n\nIf a default in the payment of principal, interest\nor other amounts payable on the debt securities, or any other Event of Default provided in the applicable\nsupplemental indentures to the\nIndenture or form of security, with respect to one or more (but in the case of a default in a manner\nprovided in a supplemental indenture\nor form of security, less than all) series of debt securities occurs and is continuing, either the trustee\nor the holders of not less\nthan 25% in aggregate principal amount of the debt securities of such series then outstanding, treated as\none class, by written notice,\nmay declare the principal of all outstanding debt securities of such series and any interest accrued\nthereon, to be due and payable immediately. For\nthis purpose, the debt securities will be deemed not to be in the same series as debt securities issued\nunder the Indenture prior to January\n13, 2017. If a default in a manner provided in a supplemental indenture or form of security with respect to\nall series of debt\nsecurities, or due to specified events of our bankruptcy, insolvency, winding up or liquidation, occurs and\nis continuing, either the\ntrustee or the holders of not less than 25% in aggregate principal amount of all debt securities then\noutstanding, treated as one class,\nby written notice, may declare the principal of all outstanding debt securities and any interest accrued\nthereon, to be due and payable\nimmediately. Subject to certain conditions such declarations may be annulled and past defaults may be waived\nby the holders\nof a majority in aggregate principal amount of the outstanding debt securities of the series affected.\n(Sections 5.01 and 5.10)\n\nAn Event of Default with respect to one series\nof debt securities does not necessarily constitute an Event of Default with respect to any other series of\ndebt securities. The\nIndenture requires the trustee to provide notice of default with respect to the debt securities within 90\ndays, unless the default is\ncured, but provides that the trustee may withhold notice to the holders of the debt securities of any\ndefault if the board of directors,\nthe executive committee, or a trust committee of directors or trustees and/or responsible officers of the\ntrustee determines in good faith\nthat it is in the interest of the holders of the debt securities of the applicable series to do so. The\ntrustee may not withhold\nnotice of a default in the payment of principal of, interest on or any other amounts due under, such debt\nsecurities. (Section 5.11)\n\nThe Indenture provides that the holders of a majority\nin aggregate principal amount of outstanding debt securities of each series affected, with all such series\nvoting as a single class, may\ndirect the time, method, and place of conducting any proceeding for any remedy available to the trustee, or\nexercising any trust or power\nconferred on the trustee. The trustee may decline to act if the direction is contrary to law and in certain\nother circumstances\nset forth in the Indenture. (Section 5.09) The trustee is not obligated to exercise any of its rights or\npowers under the Indenture\nat the request or direction of the holders of debt securities unless the holders offer the trustee security\nor indemnity satisfactory\nto it against the costs, expenses and liabilities incurred therein or thereby. (Section 6.02(d))\n\nNo holder of any debt security of any affected\nseries has the right to institute any action for remedy unless such holder has previously given to the\ntrustee written notice of default,\nthe trustee has failed to take action for 60 days after the holders of not less than 25% in aggregate\nprincipal amount of the debt securities\nof each affected series make written request upon the trustee to institute such action and have offered\nreasonable indemnity in connection\nwith the same and the holders of a majority in aggregate principal amount of the debt securities of each\naffected series (voting as a\nsingle class) have not given direction to the trustee that is inconsistent with the written request referred\nto above. (Section 5.06)\n\nHowever, the right of any holder of a debt security\nor coupon to receive payment of the principal of and interest on that debt security or coupon on or after\nits due date, or to institute\nsuit for the enforcement of any such payment, may not be impaired or affected without the consent of that\nholder. (Section 5.07)\n\nThe Indenture requires us to file annually with\nthe trustee a written statement as to whether or not we have knowledge of a default. (Section 3.05)\n                                                     7                                                      \nCovenant Breach\n\nUnder the Indenture, a “Covenant Breach”\nwould occur with respect to a series of debt securities if we fail to perform or breach any of the covenants\ncontained in the Indenture\n(other than a failure to pay principal or interest on the debt securities) and that failure or breach\ncontinues for 90 days after the\ntrustee or the holders of at least 25% in aggregate principal amount of the outstanding debt securities give\nwritten notice of that failure\nor breach. Neither the trustee nor the holders of the debt securities will be entitled to accelerate the\nmaturity of the debt\nsecurities as a result of any Covenant Breach.\n\nIf a Covenant Breach or Event of Default with respect\nto the debt securities occurs and is continuing, the trustee may in its discretion proceed to protect and\nenforce its rights and the rights\nof the holders of the debt securities by such appropriate judicial proceedings as the trustee deems most\neffectual to protect and enforce\nany such rights, whether for the specific enforcement of any covenant or agreement in the Indenture or in\naid of the exercise of any power\ngranted in the Indenture, or to enforce any other proper remedy.\n\nDischarge, Defeasance and Covenant Defeasance\n\nDischarge of Indenture. The Indenture\nwill cease to be of further effect with respect to debt securities of any series, except as to rights of\nregistration of transfer and\nexchange, substitution of mutilated, defaced, lost or stolen debt securities, rights of holders to receive\nprincipal, interest or other\namounts payable under the debt securities on the due date thereof (but not upon acceleration), rights and\nimmunities of the trustee and\nrights of holders with respect to property deposited pursuant to the following provisions, and our\nobligation to maintain an office for\npayments, if at any time:\n                                                                                   \n  ·  we have paid the principal, interest and any other amounts payable under the  \n     debt securities of such series as and when due;                               \n                                                                                   \n                                                                                       \n  ·  we have delivered to the trustee or the applicable paying agent for cancellation  \n     all debt securities of such series; or                                            \n                                                                                       \n                                                                                                            \n     the debt securities of such series not delivered to the trustee or the applicable                      \n     paying agent for cancellation have become due and payable, or will become due and payable within one   \n     year, or are to be called for redemption                                                               \n     within one year under arrangements satisfactory to the trustee or the applicable paying agent for the  \n     giving of notice of redemption,                                                                        \n     and we have irrevocably deposited with the trustee or the applicable paying agent as trust funds the   \n  ·  entire amount in cash or, in the                                                                       \n     case of securities payable in dollars, U.S. government obligations sufficient to pay all amounts due   \n     with respect to such debt securities                                                                   \n     on or after the date of such deposit, including at maturity or upon redemption of all such debt        \n     securities, including principal, interest                                                              \n     and other amounts, and any mandatory sinking fund payments, on the dates on which such payments are    \n     due and payable. (Section 10.01)                                                                       \n                                                                                                            \nThe trustee, on our demand accompanied by an officers’\ncertificate and an opinion of counsel and at our cost and expense, will execute proper instruments\nacknowledging such satisfaction of\nand discharging the Indenture with respect to such series.\n\nDefeasance of a Series of Securities at Any Time. We may also discharge all of our obligations, other than\nthose obligations that survive as referred to under “—\nDischarge of Indenture” above, under any series of debt securities at any time, which we refer to as\n“defeasance.”\n\nWe may be released with respect to any outstanding\nseries of debt securities from the obligations imposed by Article 9 of the Indenture, which contains the\ncovenant described below limiting\nconsolidations, mergers and asset sales, and elect not to comply with that provision without creating an\nEvent of Default or Covenant\nBreach. Discharge under these procedures is called “covenant defeasance.”\n\nDefeasance or covenant defeasance may be effected\nonly if, among other things:\n                                                                                                            \n     we irrevocably deposit with the trustee or the applicable paying agent cash                            \n  ·  or, in the case of debt securities payable only in U.S. dollars, U.S. government obligations, as       \n     trust funds in an amount                                                                               \n                                                                                                            \n                                                     8                                                      \ncertified to be sufficient to pay on each date that they become\ndue and payable, the principal of, interest on, other amounts due under, and any mandatory sinking fund\npayments for, all outstanding\ndebt securities of the series being defeased; and\n                                                                                                            \n     we deliver to the trustee an opinion of counsel to the effect that the holders                         \n     of the series of debt securities being defeased will not recognize income, gain or loss for United     \n     States federal income tax purposes                                                                     \n     as a result of the defeasance or covenant defeasance and will be subject to United States federal      \n  ·  income tax on the same amount and in                                                                   \n     the same manner and at the same times as would have been the case if such deposit and defeasance or    \n     covenant defeasance, as the case may                                                                   \n     be, had not occurred (in the case of a defeasance, the opinion of counsel must be based on a ruling    \n     of the Internal Revenue Service or                                                                     \n     a change in United States federal income tax law); and                                                 \n                                                                                                            \n                                                                                                            \n     in the case of a covenant defeasance, no Event of Default or Covenant Breach                           \n     or event which with notice or lapse of time or both would become an Event of Default or a Covenant     \n  ·  Breach has occurred and is continuing                                                                  \n     on the date of our deposit with the trustee of cash or U.S. government obligations, as applicable,     \n     or, with respect to certain Events                                                                     \n     of Default, at any time during the period ending on the 91st day after the date of such deposit; and   \n                                                                                                            \n                                                                                                            \n     in the case of a covenant defeasance, the covenant defeasance will not cause                           \n  ·  the trustee to have a conflicting interest for purposes of the Trust Indenture Act of 1939 with        \n     respect to any of our debt securities;                                                                 \n     and                                                                                                    \n                                                                                                            \n                                                                                            \n  ·  in the case of a covenant defeasance, the covenant defeasance will not cause           \n     any debt securities then listed on a national securities exchange to be delisted; and  \n                                                                                            \n                                                                                                            \n     the defeasance or covenant defeasance will not result in a breach or violation                         \n  ·  of, or constitute a default under, the Indenture or any other agreement or instrument to which we are  \n     a party or by which we are bound.                                                                      \n     (Section 10.01)                                                                                        \n                                                                                                            \nModification of the Indenture\n\nThe Indenture contains provisions permitting us\nand the trustee to modify the Indenture or the rights of the holders of debt securities with the consent of\nthe holders of not less than\na majority in aggregate principal amount of each outstanding series of debt securities affected by the\nmodification. Each holder\nof an affected debt security must consent to a modification that would:\n                                                                                 \n  ·  extend the final maturity date of the principal of, or of any interest on,  \n     or other amounts payable under any debt security;                           \n                                                                                 \n                                                                                \n  ·  reduce the principal amount of, rate of interest on, or any other amounts  \n     due under any debt security;                                               \n                                                                                \n                                                                                       \n  ·  change the currency or currency unit of payment of any debt security or certain   \n     provisions of the Indenture applicable to debt securities in foreign currencies;  \n                                                                                       \n                                                                                     \n  ·  change the method in which amounts of payments of principal, interest or other  \n     amounts are determined on any debt security;                                    \n                                                                                     \n                                                                      \n  ·  reduce any amount payable upon redemption of any debt security;  \n                                                                      \n                                                                                                            \n     adversely affect the terms on which debt securities are convertible into or                            \n  ·  exchangeable or payable in other securities, instruments, contracts, currencies, commodities or other  \n     forms of property;                                                                                     \n                                                                                                            \n                                                                                                            \n     impair the right of a holder to institute suit for the payment of a debt security                      \n  ·  or, if the debt securities provide, any right of repurchase at the option of the holder of a debt      \n     security; or                                                                                           \n                                                                                                            \n                                                                                 \n  ·  reduce the percentage of debt securities of any series, the consent of the  \n     holders of which is required for any modification. (Section 8.02)           \n                                                                                 \n                                                     9                                                      \nThe Indenture also permits us and the trustee to amend the Indenture in certain circumstances without the\nconsent of the holders of debt securities to evidence our merger or the replacement of the trustee, to cure\nany ambiguity or to correct or supplement any defective or inconsistent provision,to make any change to the\nIndenture or our debt securities that we deem necessary or desirable and that does not materially\nand adversely affect the interests of holders of the debt securities and for certain other purposes.\n(Section 8.01)\n\nConsolidations, Mergers and Sales of Assets\n\nWe may not merge or consolidate with any other\nentity or sell, convey or transfer all or substantially all of our assets to any other entity (other than\nthe sale, conveyance or transfer\nof all or substantially all of our assets to one or more of our direct or indirect subsidiaries), unless:\n                                                                                                            \n     either we are the continuing corporation or the successor entity or the entity                         \n     to whom those assets are sold, conveyed or transferred is a United States corporation or limited       \n     liability company that expressly assumes                                                               \n  ·  the due and punctual payment of the principal of, any interest on, or any other amounts due under the  \n     debt securities issued under the                                                                       \n     Indenture and the due and punctual performance and observance of all the covenants and conditions of   \n     the Indenture binding upon us, and                                                                     \n                                                                                                            \n                                                                                                            \n     we or the successor entity will not, immediately after the merger or consolidation,                    \n  ·  sale, conveyance or transfer, be in default in the performance of any covenant or condition of the     \n     Indenture binding on us. (Section 9.01)                                                                \n                                                                                                            \nThere are no covenants or other provisions in the\nIndenture that would afford holders of debt securities additional protection in the event of a\nrecapitalization transaction, a change\nof control of JPMorgan Chase & Co. or a highly leveraged transaction. The merger covenant described above\nwould apply only\nif the recapitalization transaction, change of control or highly leveraged transaction were structured to\ninclude a merger or consolidation\nof JPMorgan Chase & Co. or a sale or conveyance of all or substantially all of our assets. However, we may\nprovide specific\nprotections, such as a put right or increased interest, for particular debt securities, which we would\ndescribe in the applicable prospectus\nsupplement.\n\nConcerning the Trustee, Paying Agent, Registrar and Transfer Agent\n\nOur subsidiaries and we have a wide range of banking\nrelationships with Deutsche Bank Trust Company Americas, The Bank of New York Mellon and The Bank of New\nYork Mellon, London Branch. The\nBank of New York Mellon and, for debt securities settled through Euroclear Bank SA/NV or Clearstream\nBanking, S.A., Luxembourg, The Bank\nof New York Mellon, London Branch, will be the paying agents, registrars, authenticating agents and transfer\nagents for debt securities\nissued under the Indenture.\n\nDeutsche Bank Trust Company Americas is initially\nserving as the trustee for other securities issued by us or JPMorgan Financial, including the debt\nsecurities issued under our Indenture,\nthe debt securities issued under JPMorgan Financial’s indenture for debt securities, to which we are a\nguarantor, and the warrants\nissued under JPMorgan Financial’s warrant indenture, to which we are a guarantor. Consequently, if an actual\nor potential\nevent of default occurs with respect to any of these securities, the trustee may be considered to have a\nconflicting interest for purposes\nof the Trust Indenture Act of 1939, as amended. In that case, the trustee may be required to resign under\nthe Indenture, and\nwe would be required to appoint a successor trustee. For this purpose, a “potential” event of default means\nan\nevent that would be an event of default if the requirements for giving us default notice or for the default\nhaving to exist for a specific\nperiod of time were disregarded.\n\nDebt Securities in Foreign Currencies\n\nWhenever the Indenture provides for an action by,\nor the determination of, any of the rights of, or any distribution to, holders of debt securities, in the\nabsence of any provision to\nthe contrary, any amount in respect of any debt security denominated in a currency or currency unit other\nthan U.S. dollars may be treated\nfor purposes of taking any such action or distribution as the amount of U.S. dollars that could reasonably\nbe exchanged for such non-U.S.\ndollar amount. This amount will be calculated as of a date\n                                                     10                                                     \nthat we specify to the paying agent or, if we fail\nto specify a date, on a date that the paying agent may determine. (Section 11.11)\n\nReplacement of Debt Securities\n\nAt the expense of the holder, we may, in our discretion,\nreplace any debt security that has been mutilated, destroyed, lost or stolen or that is apparently\ndestroyed, lost or stolen. The\nmutilated debt security must be delivered to the paying agent and the registrar or satisfactory evidence of\nthe destruction, loss or theft\nof the debt security must be delivered to us, the paying agent, the registrar and the trustee. At the\nexpense of the holder,\nan indemnity that is satisfactory to us, the paying agent, the registrar and the trustee may be required\nbefore a replacement debt security\nwill be issued. (Section 2.09)\n\nGoverning Law and Judgments\n\nThe debt securities and the Indenture will be governed\nby, and construed in accordance with, the laws of the State of New York. (Section 11.08) A judgment for\nmoney in\nan action based on debt securities payable in foreign currencies in a federal or state court in the United\nStates ordinarily would be\nenforced in the United States only in U.S. dollars. The date used to determine the rate of conversion of the\nforeign currency\nin which a particular debt security is payable into U.S. dollars will depend upon various factors, including\nwhich court renders the judgment. However,\nif a judgment for money in an action based on the debt securities and the Indenture were entered by a New\nYork court applying New York\nlaw, the court would render a judgment in that foreign currency, and the judgment would be converted into\nU.S. dollars at the rate of\nexchange prevailing on the date of entry of the judgment.\n\nInsolvency and Resolution Considerations\n\nCertain of the debt securities may constitute “loss-absorbing\ncapacity” within the meaning of the rules issued by the Board of Governors of the Federal Reserve System\n(the “Federal Reserve”). Federal\nReserve rules require that certain U.S. bank holding companies, including JPMorgan Chase & Co. (the “Parent\nCompany”),\nmaintain minimum levels of unsecured external long-term debt and other loss-absorbing capacity. Such debt\nmust satisfy certain\neligibility criteria under the Federal Reserve’s rules. Holders of the debt securities offered by use of\nthis prospectus\nand other debt and equity securities of the Parent Company will absorb the losses of the Parent Company and\nits subsidiaries if the Parent\nCompany were to enter into a resolution either:\n                                                                                  \n  ·  in a bankruptcy proceeding under Chapter 11 of the U.S. Bankruptcy Code, or  \n                                                                                  \n                                                                                  \n  ·  in a receivership administered by the Federal Deposit Insurance Corporation  \n     (“FDIC”) under Title II of the Dodd-Frank Act (“Title II”).                  \n                                                                                  \nThe preferred “single point of entry”\nstrategy under JPMorgan Chase & Co.’s resolution plan contemplates that only the Parent Company would enter\nbankruptcy proceedings. JPMorgan\nChase’s subsidiaries would be recapitalized, as needed, so that they could continue normal operations or\nsubsequently be divested\nor wound down in an orderly manner. As a result, the Parent Company’s losses and any losses incurred by its\nsubsidiaries\nwould be imposed first on holders of the Parent Company’s equity securities and thereafter on its unsecured\ncreditors, including\nholders of the debt securities and other debt securities of the Parent Company. Claims of holders of those\nsecurities would\nhave a junior position to the claims of creditors of JPMorgan Chase’s subsidiaries and to the claims of\npriority (as determined\nby statute) and secured creditors of the Parent Company.\n\nAccordingly, in a resolution of the Parent Company\nin bankruptcy, holders of the debt securities offered by use of this prospectus and other debt securities of\nthe Parent Company would\nrealize value only to the extent available to the Parent Company as a shareholder of JPMorgan Chase Bank,\nN.A. and its other subsidiaries,\nand only after any claims of priority and secured creditors of the Parent Company have been fully repaid.\n\nThe FDIC has similarly indicated that a single-point-of-entry\nrecapitalization model could be a desirable strategy to resolve a systemically important financial\ninstitution, such as the Parent Company,\n                                                     11                                                     \nunder Title II. However, the FDIC has not\nformally adopted any specific resolution strategy in connection with its Title II authority.\n\nIf the Parent Company were to approach, or enter\ninto, a resolution, none of the Parent Company, the Federal Reserve or the FDIC is obligated to follow\nJPMorgan Chase’s preferred\nresolution strategy, and losses to holders of the debt securities offered by use of this prospectus and\nother debt and equity securities\nof the Parent Company, under whatever strategy is ultimately followed, could be greater than they might have\nbeen under JPMorgan Chase’s\npreferred strategy.\n                                                     12                                                     \n                                                                                                            \n                                          Description of Warrants                                           \n                                          of JPMorgan Chase & Co.                                           \nOffered Warrants\n\nIn this “Description of Warrants of JPMorgan\nChase & Co.” section, all references to “warrants” refer only to warrants issued by JPMorgan Chase & Co. and\nnot to any warrants issued by JPMorgan Chase Financial Company LLC.\n\nThe warrants are options that are securities within\nthe meaning of Section 2(a)(1) of the Securities Act of 1933, as amended.\n\nWe may issue warrants that are debt warrants, index\nwarrants or universal warrants. We may offer any of these warrants separately or together with one or more\nother types of these\nwarrants or purchase contracts, debt securities issued by us, debt obligations or other securities of an\nentity affiliated or not affiliated\nwith us, other property or any combination of those securities in the form of units, as described in the\napplicable prospectus supplement. If\nwe issue warrants as part of a unit, the accompanying prospectus supplement will specify whether those\nwarrants may be separated from\nthe other securities in the unit prior to the warrants’ expiration date. Universal warrants issued in the\nUnited States\nmay not be so separated prior to the 91st day after the issuance of the unit, unless otherwise specified in\nthe applicable prospectus\nsupplement.\n\nDebt Warrants. We may issue,\ntogether with debt securities or separately, warrants for the purchase of debt securities on terms to be\ndetermined at the time of sale. We\nrefer to this type of warrant as a “debt warrant.”\n\nIndex Warrants. We may issue\nwarrants entitling the holders thereof to receive from us, upon exercise, an amount in cash determined by\nreference to decreases or increases\nin the level of a specific index or in the levels (or relative levels) of two or more indices or\ncombinations of indices, which index\nor indices may be based on one or more stocks, bonds or other securities, one or more currencies or currency\nunits, or any combination\nof the foregoing, provided that any warrants that are based, in whole or in part, on one or more currency\nindices will be listed\non a national securities exchange. We refer to this type of warrant as an “index warrant.”\n\nUniversal Warrants. We may also\nissue warrants to purchase or sell securities issued by us or another entity (other than our common stock),\nsecurities based on the performance\nof such entity, securities based on the performance of such entity but excluding the performance of a\nparticular subsidiary or subsidiaries\nof such entity, a basket of securities, or any combination of the above.\n\nWe refer to the property in the above clauses as\n“warrant property.” We refer to this type of warrant as a “universal warrant.” We may satisfy\nour obligations, if any, with respect to any universal warrants by delivering the warrant property or the\ncash value of the securities,\nas described in the applicable prospectus supplement.\n\nThe prospectus supplement relating to the warrants\nbeing offered will specify the particular terms of, and other information relating to, those warrants.\n\nSignificant Provisions of the Warrant Agreements\n\nWe will issue the warrants under one or more warrant\nagreements to be entered into between us and a bank or trust company, as warrant agent, in one or more\nseries, which will be described\nin the prospectus supplement for the warrants. The forms of warrant agreements are filed as exhibits to the\nregistration statement. The\nfollowing summarizes the significant provisions of the warrant agreements and the warrants and is not\nintended to be comprehensive. Holders\nof the warrants should review the detailed provisions of the relevant warrant agreement for a full\ndescription and for other information\nregarding the warrants. In addition, we will describe the specific terms that will apply to the warrants in\nan accompanying\nprospectus supplement, which will supplement and, if applicable, may modify or replace the general terms of\nthe warrants described in\nthe following section. If there are any differences between the accompanying prospectus supplement and this\nprospectus, the\nprospectus supplement will control.\n                                                     13                                                     \nModifications without Consent of Warrantholders.We\nand the warrant agent may amend the terms of the warrants and the warrant certificates without the consent\nof the holders to:\n                          \n  ·  cure any ambiguity,  \n                          \n                                                                              \n  ·  cure, correct or supplement any defective or inconsistent provision, or  \n                                                                              \n                                                                                        \n  ·  amend the terms in any other manner which will not adversely affect the interests  \n     of the holders in any material respect.                                            \n                                                                                        \nModifications with Consent of Warrantholders.We\nand the warrant agent, with the consent of the holders of not less than a majority in number of the then\noutstanding warrants affected,\nmay modify or amend the warrant agreement. However, we and the warrant agent may not, without the consent of\neach affected\nwarrantholder:\n                                                 \n  ·  change the exercise price of the warrants;  \n                                                 \n                                                                                                            \n     reduce the amount receivable upon exercise, cancellation or expiration of                              \n  ·  the warrants other than in accordance with adjustment provisions included in the terms of the          \n     warrants;                                                                                              \n                                                                                                            \n                                                                             \n  ·  shorten the period of time during which the warrants may be exercised;  \n                                                                             \n                                                                                         \n  ·  materially and adversely affect the exercise rights of the owners of the warrants;  \n     or                                                                                  \n                                                                                         \n                                                                                \n  ·  reduce the percentage of outstanding warrants the consent of whose owners  \n     is required for the modification of the applicable warrant agreement.      \n                                                                                \nMerger, Consolidation, Sale or Other Disposition. If\nat any time there we merge or consolidate or transfer substantially all of our assets, the successor\ncorporation will succeed to and assume\nall of our obligations under each warrant agreement and the warrant certificates. We will then be relieved\nof any further obligation\nunder each of those warrant agreements and the warrants issued under those warrant agreements. See\n“Description of Debt\nSecurities — Consolidations, Mergers and Sales of Assets.”\n\nEnforceability of Rights of Warrantholders.The\nwarrant agent will act solely as our agent in connection with the warrant certificates and will not assume\nany obligation or relationship\nof agency or trust for or with any holders of warrant certificates or beneficial owners of warrants. Any\nholder of warrant\ncertificates and any beneficial owner of warrants may, without the consent of any other person, enforce its\nright, and may institute any\nproceeding, on its own behalf, to exercise the warrants evidenced by the warrant certificates in the manner\nprovided for in that series\nof warrants or pursuant to the applicable warrant agreement. Prior to exercise, no holder of any warrant\ncertificate or beneficial\nowner of any warrants will be entitled to any of the rights of a holder of the debt securities or any other\nwarrant property that may\nbe purchased upon exercise of the warrants, including, without limitation, the right to receive the payments\non those debt securities\nor other warrant property or to enforce any of the covenants or rights in the Indenture or any other similar\nagreement.\n\nRegistration and Transfer of Warrants.Subject\nto the terms of the applicable warrant agreement, warrants in definitive form may be presented for exchange\nand for registration of transfer,\nat the corporate trust office of the warrant agent for that series of warrants, or at any other office\nindicated in the prospectus supplement\nrelating to that series of warrants, without service charge. However, the holder will be required to pay any\ntaxes and other\ngovernmental charges as described in the warrant agreement. The transfer or exchange will be effected only\nif the warrant agent\nfor the series of warrants is satisfied with the documents of title and identity of the person making the\nrequest. See “Forms\nof Securities — Global Securities” for information regarding warrants in global form.\n\nReplacement of Warrants. We will\nreplace any mutilated certificate evidencing a definitive warrant at the expense of the holder upon\nsurrender of that certificate to the\nwarrant agent. We will replace certificates that have been destroyed, lost or stolen at the expense of the\nholder upon delivery\nto us and the warrant agent of evidence satisfactory to us and the warrant agent of the destruction, loss or\ntheft of the certificates. In\nthe case of a destroyed, lost or stolen certificate, an indemnity satisfactory to the\n                                                     14                                                     \nwarrant agent and to us may be required at the expense\nof the holder of the warrant evidenced by that certificate before a replacement will be issued.\n\nNew York Law to Govern.The warrants\nand each warrant agreement will be governed by, and construed in accordance with, the laws of the State of\nNew York.\n                                                     15                                                     \n                                                                                                            \n                                            Description of Units                                            \n                                          of JPMorgan Chase & Co.                                           \nGeneral\n\nUnits will consist of any combination of warrants,\npurchase contracts, debt securities issued by us, debt obligations or other securities of an entity\naffiliated or not affiliated with\nus or any other property (which we refer collectively as the “unit property”). The units or units property\nmay\nimpose obligations on the holder, which may be secured by other items of unit property or other assets or\nsecurity. The applicable\nprospectus supplement will also describe:\n                                                                                 \n  ·  the designation and the terms of the units and unit property may be traded  \n     separately or as other kinds of units;                                      \n                                                                                 \n                                                                                                            \n     whether holders of the units will be required to pledge any items to secure                            \n  ·  performance thereof, such as described in “— Description of Purchase Contracts of JPMorgan Chase &     \n     Co. —Purchase                                                                                          \n     Contracts Issued as Part of Units — Pledge by Purchase Contract Holders to Secure Performance” below;  \n                                                                                                            \n                                                             \n  ·  any additional terms of the applicable unit agreement;  \n                                                             \n                                                                                   \n  ·  any additional provisions for the issuance, payment, settlement, transfer     \n     or exchange of the units or of the unit property constituting the units; and  \n                                                                                   \n                                                                    \n  ·  any applicable United States federal income tax consequences.  \n                                                                    \nThe terms and conditions described under “—\nDescription of Debt Securities of JPMorgan Chase & Co.,” “— Description of Warrants of JPMorgan Chase &\nCo.,”\n“— Description of Purchase Contracts of JPMorgan Chase & Co.,” and those described below under “—\nSignificant\nProvisions of the Unit Agreement,” will apply to each unit and to any unit property consisting of warrants,\npurchase contracts,\ndebt securities issued by us, debt obligations or other securities of an entity affiliated or not affiliated\nwith us or other property,\nas applicable, unless otherwise specified in the applicable prospectus supplement.\n\nSignificant Provisions of the Unit Agreement\n\nWe will issue the units under one or more unit\nagreements, each referred to as a unit agreement, to be entered into between us and a bank or trust company,\nas unit agent. We\nmay issue units in one or more series, which will be described in the applicable prospectus supplement for\nthe units. The form\nof unit agreement is incorporated by reference as an exhibit to the registration statement. The following\nsummarizes the significant\nprovisions of the unit agreements and the units and is not intended to be comprehensive. Holders of the\nunits should review\nthe detailed provisions of the relevant unit agreement for a full description and for other information\nregarding the units. In\naddition, we will describe the specific terms that will apply to the units in an accompanying prospectus\nsupplement, which will supplement\nand, if applicable, may modify or replace the general terms of the units described in the following section.\nIf there are\nany differences between the accompanying prospectus supplement and this prospectus, the prospectus\nsupplement will control.\n\nRemedies. The unit agent will\nact solely as our agent in connection with the units governed by the unit agreement and will not assume any\nobligation or relationship\nof agency or trust for or with any holders of units or interests in those units. Any holder of units or\ninterests in those\nunits may, without the consent of the unit agent or any other holder or beneficial owner of units, enforce,\nand may institute any proceeding\nagainst us, on its own behalf, its rights under the unit agreement. However, the holders of units or\ninterests in those units\nmay only enforce their rights under the unit property underlying those units and the applicable purchase\ncontract agreement in accordance\nwith the terms of the Indenture, the applicable warrant agreement and the applicable purchase contract\nagreement.\n\nModification without Consent of Holders. We\nand the unit agent may amend or supplement the unit agreement and the terms of the purchase contracts and\nthe purchase contract certificates\nwithout the consent of the holders to:\n                                                     16                                                     \n                          \n  ·  cure any ambiguity;  \n                          \n                                                                                 \n  ·  cure, correct or supplement any defective or inconsistent provision in the  \n     agreement; or                                                               \n                                                                                 \n                                                                                                            \n     amend the terms in any other manner which we may deem necessary or desirable                           \n  ·  and which will not adversely affect the interest of the affected holders of units in any material      \n     respect.                                                                                               \n                                                                                                            \nModification with Consent of Holders. We\nand the unit agent, with the consent of the holders of not less than a majority of units at the time\noutstanding, may modify or amend\nthe rights of the affected holders of the affected units and the terms of the unit agreement. However, we\nand the unit agent\nmay not, without the consent of each affected holder of units, make any modifications or amendments that\nwould:\n                                                                                   \n  ·  materially and adversely affect the exercise rights of the affected holders,  \n     or                                                                            \n                                                                                   \n                                                                                \n  ·  reduce the percentage of outstanding units the consent of whose owners is  \n     required to consent to a modification or amendment of the unit agreement.  \n                                                                                \nModifications of any debt securities issued pursuant\nto the Indenture and included in units may only be made in accordance with the Indenture, as described under\n“— Description\nof Debt Securities of JPMorgan Chase & Co. — Modification of the Indenture” Modifications of any warrants\nincluded in\nunits may only be made in accordance with the terms of the applicable warrant agreement as described under\n“— Description\nof Warrants of JPMorgan Chase & Co. — Significant Provisions of the Warrant Agreement.”\n\nMerger, Consolidation, Sale or Conveyance. The\nunit agreement provides that we will not merge or consolidate with any other person and will not sell or\nconvey all or substantially all\nof our assets to any person unless:\n                                                                                    \n  ·  we will be the continuing corporation, or the successor corporation or person  \n     that acquires all or substantially all of our assets:                          \n                                                                                    \n                                                                                          \n  ·  will be a corporation organized under the laws                                       \n     of the United States, a state of the United States or the District of Columbia; and  \n                                                                                          \n                                                       \n  ·  will assume due and punctual performance of all   \n     of our obligations under the unit agreement; and  \n                                                       \n                                                                                                            \n     immediately after the merger, consolidation, sale or conveyance, we, that                              \n  ·  person or that successor corporation will not be in default in the performance of the covenants and    \n     conditions of the unit agreement applicable                                                            \n     to us.                                                                                                 \n                                                                                                            \nReplacement of Unit Certificates. We\nwill replace any mutilated certificate evidencing a definitive unit at the expense of the holder upon\nsurrender of that certificate to\nthe unit agent. We will replace certificates that have been destroyed, lost or stolen at the expense of the\nholder upon delivery\nto us and the unit agent of evidence satisfactory to us and the unit agent of the destruction, loss or theft\nof the certificates. In\nthe case of a destroyed, lost or stolen certificate, an indemnity satisfactory to the unit agent and to us\nmay be required at the expense\nof the holder of the units evidenced by that certificate before a replacement will be issued.\n\nTitle. We, the unit agent, the\ntrustee, the warrant agent and any of their agents will treat the registered holder of any unit as its\nowner, notwithstanding any notice\nto the contrary, for all purposes.\n\nNew York Law to Govern. The unit\nagreement and the units will be governed by, and construed in accordance with, the laws of the State of New\nYork.\n                                                     17                                                     \n                                                                                                            \n                                          Description of Purchase                                           \n                                     Contracts of JPMorgan Chase & Co.                                      \nWe may issue purchase contracts, including purchase\ncontracts issued as part of a unit with one or more items of unit property for the purchase or sale of, or\nsettlement in cash based on\nthe value of:\n                                                                                                            \n     securities issued by us or by an entity affiliated or not affiliated with                              \n  ·  us, a basket of those securities, an index or indices of those securities or any combination of the    \n     above;                                                                                                 \n                                                                                                            \n                  \n  ·  currencies;  \n                  \n                      \n  ·  commodities; or  \n                      \n                      \n  ·  other property.  \n                      \nWe refer to the property in the above clauses as\n“purchase contract property.”\n\nEach purchase contract will obligate the holder\nto purchase or sell, and obligate us to sell or purchase, on a specified date or dates, the purchase\ncontract property at a specified\nprice or prices, or cash in lieu of such purchase contract property, all as described in the applicable\nprospectus supplement. The\napplicable prospectus supplement will also specify the methods by which the holders may purchase or sell the\npurchase contract property\nand any acceleration, cancellation or termination provisions or other provisions relating to the settlement\nof a purchase contract.\n\nPurchase Contracts Issued as Parts of Units\n\nPurchase contracts issued as parts of units will\nbe governed by the terms and provisions of a unit agreement. See “— Description of Units of JPMorgan Chase &\nCo. — Significant Provisions of the Unit Agreement.” The accompanying prospectus supplement will specify the\nfollowing:\n                                                                                 \n  ·  whether the purchase contract obligates the holder to purchase or sell the  \n     purchase contract property;                                                 \n                                                                                 \n                                                                                                            \n     whether and when a purchase contract issued as part of a unit may be separated                         \n  ·  from the other securities constituting part of that unit prior to the purchase contract’s settlement   \n     date;                                                                                                  \n                                                                                                            \n                                                                                  \n  ·  the methods by which the holders may purchase or sell the purchase contract  \n     property;                                                                    \n                                                                                  \n                                                                                   \n  ·  any acceleration, cancellation or termination provisions or other provisions  \n     relating to the settlement of a purchase contract;                            \n                                                                                   \n                                                                                                            \n     whether the purchase contracts will be issued in definitive or global form,                            \n  ·  although, in any case, the form of a purchase contract included in a unit will correspond to the form  \n     of the unit and of any debt security,                                                                  \n     warrant or other security included in that unit; and                                                   \n                                                                                                            \n                                                                    \n  ·  any applicable United States federal income tax consequences.  \n                                                                    \nHolders of the purchase contracts should review\nthe detailed provisions of the relevant unit agreement for a full description and for other information\nregarding the purchase contracts. In\naddition, we will describe the specific terms that will apply to the purchase contracts in an accompanying\nprospectus supplement, which\nwill supplement and, if applicable, may modify or replace the general terms of the purchase contracts\ndescribed in the following section.\nIf there are any differences between the accompanying prospectus supplement and this prospectus, the\nprospectus supplement will control.\n\nSettlement of Purchase Contracts. Where\npurchase contracts issued together with debt securities or debt obligations as part of a unit require the\nholders to buy purchase contract\nproperty, the unit agent may apply principal payments from the debt securities or debt obligations in\nsatisfaction of the holders obligations\nunder the related purchase contract as specified in the prospectus supplement. The unit agent will not so\napply the principal\npayments if the holder has delivered cash to meet its obligations under the purchase contract. To settle the\npurchase contract\nand receive the purchase contract property, the holder must present and surrender the unit certificates at\nthe office of the unit agent. If\na holder settles its obligations under a purchase contract that is part of a unit in cash rather than by\ndelivering the\n                                                     18                                                     \ndebt security\nor debt obligation that is part of the unit, that debt security or debt obligation will remain outstanding,\nif the maturity extends beyond\nthe relevant settlement date and, as more fully described in the applicable prospectus supplement, the\nholder will receive that debt\nsecurity or debt obligation or an interest in the relevant global debt security.\n\nPledge by Purchase Contract Holders to Secure Performance. To secure the obligations of the purchase\ncontract holders contained in the unit agreement and in the purchase\ncontracts, the holders, acting through the unit agent, as their attorney-in-fact, will assign and pledge the\nitems in the following sentence,\nwhich we refer to as the “pledge,” to JPMorgan Chase Bank, National Association, in its capacity as\ncollateral agent, for\nour benefit. Except as otherwise described in the applicable prospectus supplement, the pledge is a security\ninterest in, and\na lien upon and right of set-off against, all of the holders’ right, title and interest in and to:\n                                                                                                            \n     all or any portion of the debt securities, debt obligations or other securities                        \n  ·  that are, or become, part of units that include the purchase contracts, or other property as may be    \n     specified in the applicable prospectus                                                                 \n     supplement, which we refer to as the “pledged items”;                                                  \n                                                                                                            \n                                                                                      \n  ·  all additions to and substitutions for the pledged items as may be permissible,  \n     if so specified in the applicable prospectus supplement;                         \n                                                                                      \n                                                                                                            \n     all income, proceeds and collections received or to be received, or derived                            \n  ·  or to be derived, at any time from or in connection with the pledged items described in the two        \n     immediately preceding clauses above; and                                                               \n                                                                                                            \n                                                                                  \n  ·  all powers and rights owned or thereafter acquired under or with respect to  \n     the pledged items.                                                           \n                                                                                  \nThe pledge constitutes collateral security for\nthe performance when due by each holder of its obligations under the unit agreement and the applicable\npurchase contract. Except\nas otherwise described in the applicable prospectus supplement, the collateral agent will forward all\npayments from the pledged items\nto us, unless the payments have been released from the pledge in accordance with the unit agreement. If the\nterms of the unit\nso provide, we will use the payments received from the pledged items to satisfy the obligations of the\nholder of the unit under the related\npurchase contract.\n\nProperty Held in Trust by Unit Agent. If\na holder fails to settle its obligations under a purchase contract that is part of a unit and fails to\npresent and surrender its unit\ncertificate to the unit agent when required, that holder will not receive the purchase contract property.\nInstead, the unit\nagent will hold that holder’s purchase contract property, together with any distributions, as the registered\nowner in trust for\nthe benefit of the holder until the holder presents and surrenders the certificate or provides satisfactory\nevidence that the certificate\nhas been destroyed, lost or stolen. The unit agent or JPMorgan Chase & Co. may require an indemnity from the\nholder for\nliabilities related to any destroyed, lost or stolen certificate. If the holder does not present the unit\ncertificate, or provide\nthe necessary evidence of destruction or loss and indemnity, on or before the second anniversary of the\nsettlement date of the related\npurchase contract, the unit agent will pay to us the amounts it received in trust for that holder.\nThereafter, the holder may\nrecover those amounts only from us and not the unit agent. The unit agent will have no obligation to invest\nor to pay interest\non any amount it holds in trust pending distribution.\n                                                     19                                                     \n                                                                                                            \n                                            Description of Debt                                             \n                             Securities of JPMorgan Chase Financial Company LLC                             \nGeneral\n\nIn this “Description of Debt Securities of\nJPMorgan Chase Financial Company LLC” section, “we,” “us” and “our” refer only to JPMorgan Chase\nFinancial Company LLC and not to any of its affiliates, including JPMorgan Chase & Co., references to the\n“Guarantor”\nrefer only to JPMorgan Chase & Co. and not to any of its subsidiaries or affiliates, and all references to\n“debt securities”\nrefer only to debt securities issued by JPMorgan Chase Financial Company LLC and not to any debt securities\nissued by JPMorgan Chase &\nCo.\n\nThe following description of the terms of the debt\nsecurities contains certain general terms that may apply to the debt securities. The specific terms of any\ndebt securities\nwill be described in one or more prospectus supplements relating to those debt securities.\n\nThe debt securities will be issued under an Indenture\namong JPMorgan Chase Financial Company LLC, as issuer, JPMorgan Chase & Co., as guarantor, and Deutsche Bank\nTrust Company Americas,\nas trustee (as has been and as may be further supplemented from time to time, for purposes of this section\nentitled “Description\nof Debt Securities of JPMorgan Chase Financial Company LLC,” the “Indenture”).\n\nWe have summarized below the material provisions\nof the Indenture and the debt securities and guarantees issued under the Indenture or indicated which\nmaterial provisions will be described\nin the related prospectus supplement.\n\nThese descriptions are only summaries, and each\ninvestor should refer to the Indenture, which describes completely the terms and definitions summarized\nbelow and contains additional\ninformation regarding the debt securities issued under it. Where appropriate, we use parentheses to refer\nyou to the particular\nsections of the Indenture. Any reference to particular sections or defined terms of the Indenture in any\nstatement under this\nheading qualifies the entire statement and incorporates by reference the applicable section or definition\ninto that statement.\n\nThe debt securities will be our direct, unsecured\ngeneral obligations, the payment on which is fully and unconditionally guaranteed by the Guarantor, and will\nhave the same rank in liquidation\nas all of our other unsecured and unsubordinated debt.\n\nThe Indenture does not limit the aggregate principal\namount of debt securities that may be issued under it. The Indenture provides that debt securities may be\nissued up to the\nprincipal amount authorized by us from time to time. (Section 2.03) We have previously established the\nSeries A medium-term\nnotes under the Indenture. As of December 31, 2022, we had approximately $25.9 billion aggregate principal\namount of Series\nA medium-term notes outstanding under the Indenture. Our board of managers has authorized the issuance of\nsecurities under\nthe registration statement to which this prospectus relates, including Series A medium-term notes, with an\naggregate initial public offering\nprice not to exceed $130 billion, to be issued on or after February 17, 2023.\n\nThe Indenture allows us to reopen a previous issue\nof a series of debt securities and issue additional debt securities of that issue. We have no obligation to\ntake your interests\ninto account when deciding whether to issue additional debt securities. In addition, we are under no\nobligation to reopen any\nseries of debt securities or to issue any additional debt securities.\n\nThe Guarantor is a holding company that holds the\nstock of the Bank and IHC. The Guarantor conducts substantially all of its operations through subsidiaries,\nincluding the Bank\nand the IHC. As a result, claims of the holders of the debt securities against the Guarantor under the\nguarantee will generally\nhave a junior position to claims of creditors of the Guarantor’s subsidiaries. Claims of the Guarantor’s\nsubsidiaries’\ncreditors other than the Guarantor include substantial amounts of deposit liabilities, long-term debt and\nother liabilities. In\naddition, the Guarantor is obligated to contribute to the IHC substantially all the net proceeds that the\nGuarantor receives from the\nissuance of securities (including any securities offered by use of this prospectus), and the ability of the\nBank and the IHC to make payments\nto the Guarantor is limited. As a result of these arrangements, the Guarantor’s ability to make various\npayments is dependent\non its receiving dividends from the Bank and dividends and extensions of credit from the IHC. These\nlimitations could affect\nthe Guarantor’s ability to pay interest on\n                                                     20                                                     \nits debt securities, redeem or repurchase outstanding\nsecurities and fulfill its other payment obligations, including payment obligations under the guarantees of\nour debt securities.\n\nWe may issue debt securities from time to time\nin one or more series. (Section 2.03) The debt securities may be denominated and payable in U.S. dollars or\nforeign currencies.\n(Section 2.03) We may also issue debt securities, from time to time, with the principal amount, interest or\nother amounts payable\non any relevant payment date to be determined by reference to one or more currency exchange rates, interest\nrates, swap rates, securities\nor baskets of securities, commodity prices, indices, basket of indices, or any other financial, economic or\nother measure or instrument,\nincluding the occurrence or non-occurrence of any event or circumstance. The debt securities may also be\nissued as original\nissue discount debt securities, which will bear no interest or bear interest at below market rates and will\nbe sold at a discount to their\nstated principal amount. All references in this prospectus, or any prospectus supplement to other amounts\nwill include premium,\nif any, and other cash amounts payable under the Indenture, if any.\n\nThe debt securities may bear interest at a fixed\nrate, which may be zero, or a floating rate.\n\nThe prospectus supplement relating to a particular\nseries of debt securities being offered will specify the particular terms of, and other information relating\nto, those debt securities.\n\nHolders may present debt securities for exchange\nor transfer, in the manner, at the places and subject to the restrictions stated in the debt securities and\ndescribed in the applicable\nprospectus supplement. We will provide these services without charge except for any tax or other\ngovernmental charge payable\nin connection with these services and subject to any limitations provided in the Indenture. (Section 2.08)\n\nIf any of the securities are held in global form,\nthe procedures for transfer of interests in those securities will depend upon the procedures of the\ndepositary for those global securities. See\n“Forms of Securities.”\n\nWe will generally have no obligation to repurchase,\nredeem, or change the terms of the debt securities upon any event (including a change in control of us or\nthe Guarantor) that might have\nan adverse effect on our or the Guarantor’s credit quality.\n\nEvents of Default and Waivers\n\nUnless otherwise specified in the applicable prospectus\nsupplement, an “Event of Default” with respect to a series of debt securities issued under the Indenture is\ndefined in the\nIndenture as:\n                                                                                   \n  ·  default in the payment of interest on any debt securities of that series and  \n     continuance of such default for 30 days;                                      \n                                                                                   \n                                                                                           \n  ·  default in the payment of principal or other amounts payable on any debt securities   \n     of that series when due, at maturity, upon redemption, by declaration, or otherwise;  \n                                                                                           \n                                                                                                            \n     default in the performance, or breach, of any other covenants or warranties                            \n     applicable to us contained in the Indenture applicable to that series, and continuation of such        \n  ·  default or breach for 90 days after written                                                            \n     notice has been given by the trustee to us and the Guarantor or given by holders of at least 25% in    \n     aggregate principal amount of the                                                                      \n     outstanding securities of all series affected thereby to us, the Guarantor and the trustee;            \n                                                                                                            \n                                                                                \n  ·  certain events of our bankruptcy, insolvency, receivership, winding up or  \n     liquidation, whether voluntary or involuntary;                             \n                                                                                \n                                                                                                            \n     the guarantee ceases to be in full force and effect, other than in accordance                          \n     with the Indenture, or the Guarantor denies or disaffirms its obligations under the guarantee,         \n     provided that no Event of Default                                                                      \n     with respect to the guarantee will occur as a result of, or because it is related directly or          \n  ·  indirectly to, the insolvency of the Guarantor                                                         \n     or the commencement of proceedings under Title 11 of the United States Code, or the appointment of a   \n     receiver for the Guarantor under                                                                       \n     Title II of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, or the Federal      \n     Deposit                                                                                                \n                                                                                                            \n                                                     21                                                     \nInsurance Corporation having separately repudiated the Guarantee\nin receivership, or the commencement of or certain other events of the Guarantor’s bankruptcy, insolvency,\nresolution, receivership,\nwinding up or liquidation; or\n                                                                                    \n  ·  any other event of default provided in the applicable supplemental indentures  \n     to the Indenture or form of security. (Section 5.01)                           \n                                                                                    \nUnless otherwise specified in the applicable prospectus\nsupplement, if an Event of Default occurs and is continuing because of a default in the payment of\nprincipal, interest or other amounts\npayable on the debt securities, a failure in the performance, or breach, of any covenant or agreement\napplicable to us, the guarantee\nceasing to be in full force and effect, or any other event of default provided in the applicable\nsupplemental indentures to the Indenture\nor form of security, either the trustee or the holders of not less than 25% in aggregate principal amount of\nthe debt securities of such\nseries then outstanding, treated as one class, by written notice to us and the Guarantor, may declare the\nprincipal of all outstanding\ndebt securities of such series and any interest accrued thereon, to be due and payable immediately. Unless\notherwise specified\nin the applicable prospectus supplement, if a default due to specified events of our bankruptcy, insolvency,\nreceivership, winding up\nor liquidation, occurs and is continuing, the principal of all outstanding debt securities and any interest\naccrued thereon will automatically,\nand without any declaration or other action on the part of the trustee or any holder, become immediately due\nand payable. Subject\nto certain conditions such declarations may be annulled and past defaults may be waived by the holders of a\nmajority in aggregate principal\namount of the outstanding debt securities of the series affected. (Sections 5.01 and 5.10)\n\nEvents of bankruptcy, insolvency, resolution, receivership,\nwinding up or liquidation relating to the Guarantor will not constitute an Event of Default with respect to\nany series of debt securities. In\naddition, failure by the Guarantor to perform any of its covenants or warranties (other than a payment\ndefault) will not constitute an\nEvent of Default with respect to any series of debt securities. Therefore, events of bankruptcy, resolution,\nreceivership,\ninsolvency, winding up or liquidation relating to the Guarantor (in the absence of any such event occurring\nwith respect to us) will not\npermit any of the debt securities to be declared due and payable and the trustee is not authorized to\nexercise any remedy against us or\nthe Guarantor upon the occurrence or continuation of these events with respect to the Guarantor. Instead,\neven if an event\nof bankruptcy, insolvency, resolution, receivership, winding up or liquidation relating to the Guarantor has\noccurred, the trustee and\nthe holders of debt securities of a series will not be able to declare the relevant debt securities to be\nimmediately due and payable\nunless there is an Event of Default with respect to that series as described above, such as our bankruptcy,\ninsolvency, receivership,\nwinding up or liquidation or a payment default by us or the Guarantor on the relevant debt securities. The\nvalue you receive on any series of debt securities may be significantly less than what you would have\notherwise received had our debt securities been declared due and payable immediately or the trustee been\nauthorized to exercise any remedy against us or the Guarantor upon the occurrence or continuation of these\nevents with respect to the Guarantor.\n\nAn Event of Default with respect to one series\nof debt securities does not necessarily constitute an Event of Default with respect to any other series of\ndebt securities. The\nIndenture requires the trustee to provide notice of default with respect to the debt securities within 90\ndays, unless the default is\ncured, but provides that the trustee may withhold notice to the holders of the debt securities of any\ndefault if the board of directors,\nthe executive committee, or a trust committee of directors or trustees and/or responsible officers of the\ntrustee determines in good faith\nthat it is in the interest of the holders of the debt securities of the applicable series to do so. The\ntrustee may not withhold\nnotice of a default in the payment of principal of, interest on or any other amounts due under, such debt\nsecurities. (Section 5.11)\n\nThe Indenture provides that the holders of a majority\nin aggregate principal amount of outstanding debt securities of each series affected, with all such series\nvoting as a single class, may\ndirect the time, method, and place of conducting any proceeding for any remedy available to the trustee, or\nexercising any trust or power\nconferred on the trustee. The trustee may decline to act if the direction is contrary to law and in certain\nother circumstances\nset forth in the Indenture. (Section 5.09) The trustee is not obligated to exercise any of its rights or\npowers under the Indenture\nat the request or direction of the holders of debt securities unless the holders offer the trustee security\nor indemnity satisfactory\nto it against the costs, expenses and liabilities incurred therein or thereby. (Section 6.02(d))\n                                                     22                                                     \nNo holder of any debt security of any affected\nseries has the right to institute any action for remedy unless such holder has previously given to the\ntrustee written notice of default,\nthe trustee has failed to take action for 60 days after the holders of not less than 25% in aggregate\nprincipal amount of the debt securities\nof each affected series make written request upon the trustee to institute such action and have offered\nreasonable indemnity in connection\nwith the same and the holders of a majority in aggregate principal amount of the debt securities of each\naffected series (voting as a\nsingle class) have not given direction to the trustee that is inconsistent with the written request referred\nto above. (Section 5.06)\n\nHowever, the right of any holder of a debt security\nor coupon to receive payment of the principal of and interest on that debt security or coupon on or after\nits due date, or to institute\nsuit for the enforcement of any such payment, may not be impaired or affected without the consent of that\nholder. (Section 5.07)\n\nThe Indenture requires us and the Guarantor to\nfile annually with the trustee a written statement as to whether or not we or the Guarantor, as the case may\nbe, have knowledge of a default.\n(Section 3.05)\n\nDischarge, Defeasance and Covenant Defeasance\n\nDischarge of Indenture. The Indenture\nwill cease to be of further effect with respect to debt securities of any series and the guarantee as it\nrelates to debt securities of\nthat series, except as to rights of registration of transfer and exchange, substitution of mutilated,\ndefaced, lost or stolen debt securities,\nrights of holders to receive principal, interest or other amounts payable under the debt securities on the\ndue date thereof (but not upon\nacceleration), rights and immunities of the trustee and rights of holders with respect to property deposited\npursuant to the following\nprovisions, and our obligation to maintain an office for payments, if at any time:\n                                                                                  \n  ·  we or the Guarantor have paid the principal, interest and any other amounts  \n     payable under the debt securities of such series as and when due;            \n                                                                                  \n                                                                                       \n  ·  we have delivered to the trustee or the applicable paying agent for cancellation  \n     all debt securities of such series; or                                            \n                                                                                       \n                                                                                                            \n     the debt securities of such series not delivered to the trustee or the applicable                      \n     paying agent for cancellation have become due and payable, or will become due and payable within one   \n     year, or are to be called for redemption                                                               \n     within one year under arrangements satisfactory to the trustee or the applicable paying agent for the  \n     giving of notice of redemption,                                                                        \n     and we or the Guarantor has irrevocably deposited with the trustee or the applicable paying agent as   \n  ·  trust funds the entire amount in                                                                       \n     cash or, in the case of securities payable in dollars, U.S. government obligations sufficient to pay   \n     all amounts due with respect to such                                                                   \n     debt securities on or after the date of such deposit, including at maturity or upon redemption of all  \n     such debt securities, including                                                                        \n     principal, interest and other amounts, and any mandatory sinking fund payments, on the dates on which  \n     such payments are due and payable.                                                                     \n     (Section 10.01)                                                                                        \n                                                                                                            \nThe trustee, on our or the Guarantor’s demand,\naccompanied by an officers’ certificate of ours or the Guarantor’s, and an opinion of counsel and at our or\nthe Guarantor’s\ncost and expense, will execute proper instruments acknowledging such satisfaction of and discharging the\nIndenture with respect to such\nseries.\n\nDefeasance of a Series of Securities at Any Time. We and the Guarantor may also discharge all of our and the\nGuarantor’s obligations, other than those obligations\nthat survive as referred to under “—Discharge of Indenture” above, under any series of debt securities at\nany time,\nwhich we refer to as “defeasance.”\n\nWe and the Guarantor may be released with respect\nto any outstanding series of debt securities from the obligations imposed by Article 9 of the Indenture,\nwhich contains the covenant described\nbelow limiting consolidations, mergers and asset sales, and any other obligations described in a prospectus\nsupplement, and elect not\nto comply with those provisions without creating an Event of Default. Discharge under these procedures is\ncalled “covenant\ndefeasance.”\n\nDefeasance or covenant defeasance may be effected\nonly if, among other things:\n                                                     23                                                     \n                                                                                                            \n     we or the Guarantor irrevocably deposits with the trustee or the applicable                            \n     paying agent cash or, in the case of debt securities payable only in U.S. dollars, U.S. government     \n     obligations, as trust funds in an amount                                                               \n  ·  certified to be sufficient to pay on each date that they become due and payable, the principal of,     \n     interest on, other amounts due under,                                                                  \n     and any mandatory sinking fund payments for, all outstanding debt securities of the series being       \n     defeased; and                                                                                          \n                                                                                                            \n                                                                                                            \n     we or the Guarantor delivers to the trustee an opinion of counsel to the effect                        \n     that the beneficial owners of the series of debt securities being defeased will not recognize income,  \n     gain or loss for United States federal                                                                 \n     income tax purposes as a result of the defeasance or covenant defeasance and will be subject to        \n  ·  United States federal income tax on the                                                                \n     same amount and in the same manner and at the same times as would have been the case if such deposit   \n     and defeasance or covenant defeasance,                                                                 \n     as the case may be, had not occurred (in the case of a defeasance, the opinion of counsel must be      \n     based on a ruling of the Internal Revenue                                                              \n     Service or a change in United States federal income tax law); and                                      \n                                                                                                            \n                                                                                                            \n     in the case of a covenant defeasance, no Event of Default or event which with                          \n     notice or lapse of time or both would become an Event of Default has occurred and is continuing on     \n  ·  the date of our deposit with the trustee                                                               \n     of cash or U.S. government obligations, as applicable, or, with respect to certain Events of Default,  \n     at any time during the period ending                                                                   \n     on the 91st day after the date of such deposit; and                                                    \n                                                                                                            \n                                                                                                            \n     in the case of a covenant defeasance, the covenant defeasance will not cause                           \n  ·  the trustee to have a conflicting interest for purposes of the Trust Indenture Act of 1939 with        \n     respect to any of our or the Guarantor’s                                                               \n     debt securities; and                                                                                   \n                                                                                                            \n                                                                                            \n  ·  in the case of a covenant defeasance, the covenant defeasance will not cause           \n     any debt securities then listed on a national securities exchange to be delisted; and  \n                                                                                            \n                                                                                                            \n     the defeasance or covenant defeasance will not result in a breach or violation                         \n  ·  of, or constitute a default under, the Indenture or any other agreement or instrument to which we or   \n     the Guarantor is a party or by which                                                                   \n     we or the Guarantor are bound. (Section 10.01)                                                         \n                                                                                                            \nModification of the Indenture\n\nThe Indenture contains provisions permitting us,\nthe Guarantor and the trustee to modify the Indenture or the rights of the holders of debt securities with\nthe consent of the holders\nof not less than a majority in aggregate principal amount of each outstanding series of debt securities\naffected by the modification. Each\nholder of an affected debt security must consent to a modification that would:\n                                                                                 \n  ·  extend the final maturity date of the principal of, or of any interest on,  \n     or other amounts payable under any debt security;                           \n                                                                                 \n                                                                                \n  ·  reduce the principal amount of, rate of interest on, or any other amounts  \n     due under any debt security;                                               \n                                                                                \n                                                                                       \n  ·  change the currency or currency unit of payment of any debt security or certain   \n     provisions of the Indenture applicable to debt securities in foreign currencies;  \n                                                                                       \n                                                                                     \n  ·  change the method in which amounts of payments of principal, interest or other  \n     amounts are determined on any debt security;                                    \n                                                                                     \n                                                                      \n  ·  reduce any amount payable upon redemption of any debt security;  \n                                                                      \n                                                                                                            \n     impair the right of a holder to institute suit for the payment of a debt security                      \n  ·  or, if the debt securities provide, any right of repurchase at the option of the holder of a debt      \n     security;                                                                                              \n                                                                                                            \n                                                                                 \n  ·  reduce the percentage of debt securities of any series, the consent of the  \n     holders of which is required for any modification; or                       \n                                                                                 \n                                                     24                                                     \n                                                                                                            \n     make any change in the guarantee that would adversely affect the holders of                            \n  ·  the debt securities of such series or release the Guarantor from the guarantee other than pursuant to  \n     the terms of the Indenture. (Section                                                                   \n     8.02)                                                                                                  \n                                                                                                            \nThe Indenture also permits us, the Guarantor and the trustee to amend the Indenture in certain circumstances\nwithout the consent of the holders of debt securities to evidence our or the Guarantor’s merger or the\nreplacement of the trustee, to cure any ambiguity or to correct or supplement any defective or inconsistent\nprovision,to make any change to the Indenture or our debt securities that we deem\nnecessary or desirable and that does not materially and adversely affect the interests of holders of the\ndebt securities and for certain other purposes. (Section 8.01)\n\nConsolidations, Mergers, Sales and Transfers of Assets\n\nNeither we nor the Guarantor may merge or consolidate\nwith any other entity or sell, convey or transfer all or substantially all of their respective assets to any\nother entity, unless:\n                          \n  ·  with respect to us:  \n                          \n                                                                                                            \n     either we are the continuing company in the case of a merger or consolidation                          \n     or the successor entity in the case of a merger or consolidation (including an affiliate of the        \n     Guarantor) or the entity to whom those                                                                 \n     assets are sold, conveyed or transferred in the case of a sale, conveyance or transfer is a United     \n  ·  States corporation or limited liability                                                                \n     company that expressly assumes the due and punctual payment of the principal of, any interest on, or   \n     any other amounts due under the debt                                                                   \n     securities and the due and punctual performance and observance of all the covenants and conditions of  \n     the Indenture binding upon us, and                                                                     \n                                                                                                            \n                                                                                                            \n     no Event of Default and no event which, with notice or lapse of time or both,                          \n  ·  would become an Event of Default has occurred or would be continuing, immediately after the merger or  \n     consolidation, or the sale, conveyance                                                                 \n     or transfer, and                                                                                       \n                                                                                                            \n                                     \n  ·  with respect to the Guarantor:  \n                                     \n                                                                                                            \n     either the Guarantor is the continuing corporation in the case of a merger                             \n     or consolidation or the successor corporation in the case of a merger or consolidation or the entity   \n     to whom those assets are sold, conveyed                                                                \n     or transferred in the case of a sale, conveyance or transfer is a United States corporation that       \n  ·  expressly assumes the full and unconditional                                                           \n     guarantee of the full and punctual payment of the principal of, any interest on, or any other amounts  \n     due under the debt securities and                                                                      \n     the due and punctual performance and observance of all the covenants and conditions of the Indenture   \n     binding upon the Guarantor, and                                                                        \n                                                                                                            \n                                                                                                            \n     no Event of Default and no event which, with notice or lapse of time or both,                          \n  ·  would become an Event of Default has occurred or would be continuing, immediately after the merger or  \n     consolidation, or the sale, conveyance                                                                 \n     or transfer. (Sections 9.01 and 9.02)                                                                  \n                                                                                                            \nAny transfer of material assets of the Guarantor\nto any other entity that occurs as a result of, or because it is related directly or indirectly to, any\nproceedings relative to the Guarantor\nunder Title 11 of the United States Code or under a receivership under Title II of the Dodd-Frank Wall\nStreet Reform and Consumer Protection\nAct of 2010 or under any other applicable federal or state bankruptcy, insolvency, resolution or other\nsimilar law will be deemed to be\na sale, conveyance or transfer of all or substantially all of the Guarantor’s assets.\n\nThere are no covenants or other provisions in the\nIndenture that would afford holders of debt securities additional protection in the event of a\nrecapitalization transaction involving\nus or the Guarantor, a change of control of us or the Guarantor or a highly leveraged transaction involving\nus or the Guarantor. The\nmerger covenant described above would apply only if the recapitalization transaction, change of control or\nhighly leveraged transaction\nwere structured to include a merger or consolidation of us or the Guarantor or a sale or conveyance of all\nor substantially all of our\nor the Guarantor’s assets. However,\n                                                     25                                                     \nwe may provide specific protections, such as a put\nright or increased interest, for particular debt securities, which we would describe in the applicable\nprospectus supplement.\n\nJPMorgan Chase & Co. Guarantee\n\nThe Guarantor will fully and unconditionally guarantee\nthe full and punctual payment of the principal of, interest on, and all other amounts payable under the debt\nsecurities when the same\nbecomes due and payable, whether at maturity, upon redemption, repurchase at the option of the holders of\nthe applicable debt securities\nor upon acceleration. If for any reason we do not make any required payment in respect of our debt\nsecurities when due, the\nGuarantor will on demand pay the unpaid amount at the same place and in the same manner that applies to\npayments made by us under the\nIndenture. The guarantee is of payment and not of collection. (Section 14.01)\n\nThe Guarantor’s obligations under the guarantee\nare unconditional and absolute. However, (1) the Guarantor will not be liable for any amount of payment that\nwe are excused\nfrom making or any amount in excess of the amount actually due and owing by us, and (2) any defense or\ncounterclaims available to us (except\nthose resulting solely from, or on account of, our insolvency or our status as debtor or subject of a\nbankruptcy or insolvency proceeding)\nwill also be available to the Guarantor to the same extent as these defense or counterclaims are available\nto us, whether or not asserted\nby us. (Section 14.02)\n\nConcerning the Trustee, Paying Agent, Registrar and Transfer Agent\n\nWe, the Guarantor and certain of their affiliates\nhave a wide range of banking relationships with Deutsche Bank Trust Company Americas, The Bank of New York\nMellon and The Bank of New\nYork Mellon, London Branch. The Bank of New York Mellon and, for debt securities settled through Euroclear\nBank SA/NV or Clearstream\nBanking, S.A., Luxembourg, The Bank of New York Mellon, London Branch, will be the paying agents,\nauthenticating agents, registrars and\ntransfer agents for debt securities issued under the Indenture.\n\nDeutsche Bank Trust Company Americas is initially\nserving as the trustee for the debt securities issued under our Indenture, to which JPMorgan Chase & Co.\nacts as a guarantor, the\nwarrants issued under our warrant indenture, to which JPMorgan Chase & Co. acts as a guarantor, and the debt\nsecurities issued under\nJPMorgan Chase & Co.’s indenture. Consequently, if an actual or potential event of default occurs with\nrespect to\nany of these securities, the trustee may be considered to have a conflicting interest for purposes of the\nTrust Indenture Act of 1939,\nas amended. In that case, the trustee may be required to resign under the Indenture, and we would be\nrequired to appoint a\nsuccessor trustee. For this purpose, a “potential” event of default means an event that would be an event of\ndefault\nif the requirements for giving us default notice or for the default having to exist for a specific period of\ntime were disregarded.\n\nDebt Securities in Foreign Currencies\n\nWhenever the Indenture provides for an action by,\nor the determination of, any of the rights of, or any distribution to, holders of debt securities, in the\nabsence of any provision to\nthe contrary, any amount in respect of any debt security denominated in a currency or currency unit other\nthan U.S. dollars may be treated\nfor purposes of taking any such action or distribution as the amount of U.S. dollars that could reasonably\nbe exchanged for such non-U.S.\ndollar amount. This amount will be calculated as of a date that we specify to the trustee or, if we fail to\nspecify a date,\non a date that the trustee may determine. (Section 11.11)\n\nReplacement of Debt Securities\n\nAt the expense of the holder, we may, in our discretion,\nreplace any debt security that has been mutilated, destroyed, lost or stolen or that is apparently\ndestroyed, lost or stolen. The\nmutilated debt security must be delivered to the paying agent and the registrar or satisfactory evidence of\nthe destruction, loss or theft\nof the debt security must be delivered to us, the paying agent, the registrar and the trustee. At the\nexpense of the holder,\nan indemnity that is satisfactory to us, the Guarantor, the paying agent, the registrar and the trustee may\nbe required before a replacement\ndebt security will be issued. (Section 2.09)\n                                                     26                                                     \nGoverning Law and Judgments\n\nThe debt securities and the Indenture, including\nthe guarantee, will be governed by, and construed in accordance with, the laws of the State of New York.\n(Section 11.08) A\njudgment for money in an action based on debt securities payable in foreign currencies in a federal or state\ncourt in the United States\nordinarily would be enforced in the United States only in U.S. dollars. The date used to determine the rate\nof conversion of\nthe foreign currency in which a particular debt security is payable into U.S. dollars will depend upon\nvarious factors, including which\ncourt renders the judgment. However, if a judgment for money in an action based on the debt securities and\nthe Indenture were\nentered by a New York court applying New York law, the court would render a judgment in that foreign\ncurrency, and the judgment would\nbe converted into U.S. dollars at the rate of exchange prevailing on the date of entry of the judgment.\n                                                     27                                                     \n                                                                                                            \n                                          Description of Warrants                                           \n                                  of JPMorgan Chase Financial Company LLC                                   \nGeneral\n\nIn this “Description of Warrants of JPMorgan\nChase Financial Company LLC” section, “we,” us” and “our” refer only to JPMorgan Chase Financial Company\nLLC and not to any of its affiliates, including JPMorgan Chase & Co., references to the “Guarantor” refer\nonly to JPMorgan\nChase & Co. and not to any of its subsidiaries or affiliates, and all references to “warrants” refer only to\nwarrants\nissued by JPMorgan Chase Financial Company LLC and not to any warrants issued by JPMorgan Chase & Co.\n\nThe warrants are options that are securities within\nthe meaning of Section 2(a)(1) of the Securities Act of 1933, as amended.\n\nThe following description of the terms of the warrants\ncontains certain general terms that may apply to the warrants. The specific terms of any warrants will be\ndescribed in one\nor more prospectus supplements relating to those warrants.\n\nThe warrants will be issued under a Warrant Indenture\namong JPMorgan Chase Financial Company LLC, as issuer, JPMorgan Chase & Co., as guarantor, and Deutsche Bank\nTrust Company Americas,\nas trustee (as has been and as may be further supplemented from time to time, for purposes of this section\nentitled “Description\nof Warrants of JPMorgan Chase Financial Company LLC,” the “Indenture”).\n\nWe have summarized below the material provisions\nof the Indenture and the warrants and guarantees issued under the Indenture or indicated which material\nprovisions will be described in\nthe related prospectus supplement.\n\nThese descriptions are only summaries, and each\ninvestor should refer to the Indenture, which describes completely the terms and definitions summarized\nbelow and contains additional\ninformation regarding the warrants issued under it. Where appropriate, we use parentheses to refer you to\nthe particular sections\nof the Indenture. Any reference to particular sections or defined terms of the Indenture in any statement\nunder this heading\nqualifies the entire statement and incorporates by reference the applicable section or definition into that\nstatement.\n\nThe warrants will be our unsecured contractual\nobligations, the payment on which is fully and unconditionally guaranteed by the Guarantor, and will have\nthe same rank in liquidation\nas all of our other unsecured contractual obligations and all our other unsecured and unsubordinated debt.\n\nThe warrants entitle the holders thereof to receive\nfrom us, upon exercise (including automatic or deemed exercise), an amount in cash, if any, determined by\nreference to one or more securities,\ncurrencies, currency units, composite currencies or one or more baskets, indices or other combinations of\nany of the foregoing, provided\nthat any warrants based, in whole or in part, on one or more currencies, currency units or composite\ncurrencies will be listed on a national\nsecurities exchange.\n\nWe intend to issue warrants only to the extent\npermitted under Rule 3a-5 of the Investment Company Act of 1940, as amended, or pursuant to another\navailable exemption from registration\nas an “investment company” under the Investment Company Act of 1940, as amended.\n\nThe Indenture does not limit the aggregate number\nof warrants that may be issued under it. The Indenture provides that warrants may be issued up to the number\nauthorized by\nus from time to time. (Section 2.03) As of the date of this prospectus, we have not issued any warrants. Our\nboard\nof managers has authorized the issuance of securities under the registration statement to which this\nprospectus relates, including warrants,\nwith an aggregate initial public offering price not to exceed $130 billion, to be issued on or after\nFebruary 17, 2023.\n\nThe Indenture allows us to reopen a previous issue\nof a series of warrants and issue additional warrants of that issue. We have no obligation to take your\ninterests into account\nwhen deciding whether to issue additional warrants. In addition, we are under no obligation to reopen any\nseries of warrants\nor to issue any additional warrants.\n                                                     28                                                     \nThe Guarantor is a holding company that holds the\nstock of the Bank and IHC. The Guarantor conducts substantially all of its operations through subsidiaries,\nincluding the Bank\nand the IHC. As a result, claims of the holders of the warrants against the Guarantor under the guarantee\nwill generally have\na junior position to claims of creditors of the Guarantor’s subsidiaries. Claims of the Guarantor’s\nsubsidiaries’\ncreditors other than the Guarantor include substantial amounts of deposit liabilities, long-term debt and\nother liabilities. In\naddition, the Guarantor is obligated to contribute to the IHC substantially all the net proceeds that the\nGuarantor receives from the\nissuance of securities (including any securities offered by use of this prospectus), and the ability of the\nBank and the IHC to make payments\nto the Guarantor is limited. As a result of these arrangements, the Guarantor’s ability to make various\npayments is dependent\non its receiving dividends from the Bank and dividends and extensions of credit from the IHC. These\nlimitations could affect\nthe Guarantor’s ability to pay interest on its debt securities, redeem or repurchase outstanding securities\nand fulfill its other\npayment obligations, including payment obligations under the guarantees of our warrants.\n\nWe may issue warrants from time to time in one\nor more series. (Section 2.03) The warrants may be denominated and payable in U.S. dollars or foreign\ncurrencies. (Section\n2.03) We may also issue warrants, from time to time, with the amounts payable on any relevant payment date\nto be determined\nby reference to one or more currency exchange rates, securities or baskets of securities, indices or basket\nof indices, provided\nthat any warrants that are based, in whole or in part, on one or more currency exchange rates will be listed\non a national securities\nexchange.\n\nThe prospectus supplement relating to a particular\nseries of warrants being offered will specify the particular terms of, and other information relating to,\nthose warrants.\n\nHolders may present warrants for exchange or transfer,\nin the manner, at the places and subject to the restrictions stated in the warrants and described in the\napplicable prospectus supplement. We\nwill provide these services without charge except for any tax or other governmental charge payable in\nconnection with these services and\nsubject to any limitations provided in the Indenture. (Section 2.08)\n\nIf any of the securities are held in global form,\nthe procedures for transfer of interests in those securities will depend upon the procedures of the\ndepositary for those global securities. See\n“Forms of Securities.”\n\nWe will generally have no obligation to repurchase,\nredeem, or change the terms of the warrants upon any event (including a change in control of us or the\nGuarantor) that might have an adverse\neffect on our or the Guarantor’s credit quality.\n\nEvents of Default and Waivers\n\nUnless otherwise specified in the applicable prospectus\nsupplement, an “Event of Default” with respect to any warrant of any series issued under the Indenture is\ndefined in the Indenture\nas:\n                                                                                                            \n     default in the payment of any amount payable on that warrant when due (but                             \n  ·  not such a default in respect of any other warrant of the same series or any other series), either     \n     upon exercise, upon redemption or otherwise;                                                           \n                                                                                                            \n                                                                                                            \n     failure by us for 90 days to perform any other covenants or warranties applicable                      \n     to us contained in the Indenture applicable to that series after written notice has been given by the  \n  ·  trustee to us and the Guarantor                                                                        \n     or given by holders of at least 25% in aggregate number of the outstanding warrants of all series      \n     affected thereby to us, the Guarantor                                                                  \n     and the trustee;                                                                                       \n                                                                                                            \n                                                                                \n  ·  certain events of our bankruptcy, insolvency, receivership, winding up or  \n     liquidation, whether voluntary or involuntary;                             \n                                                                                \n                                                                                                            \n     the guarantee ceases to be in full force and effect, other than in accordance                          \n     with the Indenture, or the Guarantor denies or disaffirms its obligations under the guarantee,         \n     provided that no Event of Default                                                                      \n     with respect to the guarantee will occur as a result of, or because it is related directly or          \n  ·  indirectly to, the insolvency of the Guarantor                                                         \n     or the commencement of proceedings under Title 11 of the United States Code, or the appointment of a   \n     receiver for the Guarantor under                                                                       \n     Title II of the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, or the Federal      \n     Deposit                                                                                                \n                                                                                                            \n                                                     29                                                     \nInsurance Corporation having separately repudiated the Guarantee\nin receivership, or the commencement of or certain other events of the Guarantor’s bankruptcy, insolvency,\nresolution, receivership,\nwinding up or liquidation;\n                                                                                    \n  ·  any other event of default provided in the applicable supplemental indentures  \n     to the Indenture or form of security. (Section 5.01)                           \n                                                                                    \nHowever, a failure by the Issuer to perform any\nobligation or otherwise observe any covenant in any warrant or in the Indenture insofar as it applies to any\nwarrant will not constitute\na default unless all conditions precedent to the obligations of the Issuer to be satisfied by the holder of\nthat warrant have been satisfied.\n(Section 5.01)\n\nNeither the trustee nor any holder is entitled,\nwhether by reason of a default or otherwise, to demand or accelerate any payment on a warrant before the\npayment is otherwise due in accordance\nwith the terms of that warrant. (Section 5.02)\n\nSubject to certain conditions, past defaults may\nbe waived by the holders of a majority in number of the outstanding warrants of the series affected.\n(Section 5.10)\n\nEvents of bankruptcy, insolvency, resolution, receivership,\nwinding up or liquidation relating to the Guarantor will not constitute an Event of Default with respect to\nany series of warrants. In\naddition, failure by the Guarantor to perform any of its covenants or warranties (other than a payment\ndefault) will not constitute an\nEvent of Default with respect to any series of warrants. Therefore, the trustee is not authorized to\nexercise any remedy against\nus or the Guarantor upon the occurrence or continuation of events of bankruptcy, resolution, receivership,\ninsolvency, winding up or liquidation\nrelating to the Guarantor (in the absence of any such event occurring with respect to us). Instead, even if\nan event of bankruptcy,\ninsolvency, resolution, receivership, winding up or liquidation relating to the Guarantor has occurred, the\ntrustee and the holders of\nwarrants of a series will not be entitled to institute any action or proceeding against us or the Guarantor\nunless there is an Event of\nDefault with respect to that series as described above, such as our bankruptcy, insolvency, receivership,\nwinding up or liquidation or\na payment default by us or the Guarantor on the relevant warrants. The value you receive on any series of\nwarrants may be significantly less than what you would have otherwise received had our warrants authorized\nthe trustee to exercise any remedy against us or the Guarantor upon the occurrence or continuation of these\nevents with respect to the Guarantor.\n\nAn Event of Default with respect to one series\nof warrants does not necessarily constitute an Event of Default with respect to any other series of\nwarrants. The Indenture\nrequires the trustee to provide notice of default with respect to the warrants within 90 days, unless the\ndefault is cured, but provides\nthat the trustee may withhold notice to the holders of the warrants of any default if the board of\ndirectors, the executive committee,\nor a trust committee of directors or trustees and/or responsible officers of the trustee determines in good\nfaith that it is in the interest\nof the holders of the warrants of the applicable series to do so. The trustee may not withhold notice of a\ndefault in the payment\nof any money due, under such warrants. (Section 5.11)\n\nThe Indenture provides that the holders of a majority\nin number of outstanding warrants of each series affected, with all such series voting as a single class,\nmay direct the time, method,\nand place of conducting any proceeding for any remedy available to the trustee, or exercising any trust or\npower conferred on the trustee. The\ntrustee may decline to act if the direction is contrary to law and in certain other circumstances set forth\nin the Indenture. (Section\n5.09) The trustee is not obligated to exercise any of its rights or powers under the Indenture at the\nrequest or direction\nof the holders of warrants unless the holders offer the trustee security or indemnity satisfactory to it\nagainst the costs, expenses and\nliabilities incurred therein or thereby. (Section 6.02(d))\n\nNo holder of any warrant of any affected series\nhas the right to institute any action for remedy unless such holder has previously given to the trustee\nwritten notice of default, the\ntrustee has failed to take action for 60 days after the holders of not less than 25% in aggregate number of\nthe warrants of each affected\nseries make written request upon the trustee to institute such action and have offered reasonable indemnity\nin connection with the same\nand the holders of a majority in aggregate number of the warrants\n                                                     30                                                     \nof each affected series (voting as a single class)\nhave not given direction to the trustee that is inconsistent with the written request referred to above.\n(Section 5.06)\n\nHowever, the right of any holder of a warrant to\nreceive payment of the money due on that warrant on or after its payment date, to exercise that warrant in\naccordance with its terms,\nor to institute suit for the enforcement of any such payment and such right to exercise, may not be impaired\nor affected without the consent\nof that holder. (Section 5.07)\n\nThe Indenture requires us and the Guarantor to\nfile annually with the trustee a written statement as to whether or not we or the Guarantor, as the case may\nbe, have knowledge of a default.\n(Section 3.05)\n\nDischarge\n\nThe Indenture will cease to be of further effect\nwith respect to warrants of any series and the guarantee as it relates to warrants of that series, except as\nto rights of registration\nof transfer and exchange, substitution of mutilated, defaced, lost or stolen warrants, rights of holders to\nreceive amounts payable under\nthe warrants on the due date thereof, rights and immunities of the trustee and rights of holders with\nrespect to property deposited pursuant\nto the following provisions, and our obligation to maintain an office for payments, if at any time:\n                                                                                   \n  ·  we or the Guarantor have paid the amounts payable under the warrants of such  \n     series as and when due;                                                       \n                                                                                   \n                                                                                       \n  ·  we have delivered to the trustee or the applicable paying agent for cancellation  \n     all warrants of such series; or                                                   \n                                                                                       \n                                                                                                            \n     the warrants of such series not delivered to the trustee or the applicable                             \n     paying agent for cancellation have been exercised, or will be automatically exercised within one       \n     year, or are to be called for redemption                                                               \n     within one year under arrangements satisfactory to the trustee or the applicable paying agent for the  \n     giving of notice of redemption,                                                                        \n  ·  and we or the Guarantor has irrevocably deposited with the trustee or the applicable paying agent as   \n     trust funds the entire amount in                                                                       \n     cash or, in the case of securities payable in dollars, U.S. government obligations sufficient to pay   \n     amounts due with respect to such                                                                       \n     warrants on or after the date of such deposit, including upon expiration, exercise or redemption of    \n     all such warrants, including all amounts                                                               \n     on the dates on which such payments are due and payable. (Section 10.01)                               \n                                                                                                            \nThe trustee, on our or the Guarantor’s demand,\naccompanied by an officers’ certificate of ours or the Guarantor’s, and an opinion of counsel and at our or\nthe Guarantor’s\ncost and expense, will execute proper instruments acknowledging such satisfaction of and discharging the\nIndenture with respect to such\nseries.\n\nModification of the Indenture\n\nThe Indenture contains provisions permitting us,\nthe Guarantor and the trustee to modify the Indenture or the rights of the holders of warrants with the\nconsent of the holders of not\nless than a majority in number of each outstanding series of warrants affected by the modification. Each\nholder of an affected\nwarrant must consent to a modification that would:\n                                                       \n  ·  extend the final expiration date of any warrant;  \n                                                       \n                                                                               \n  ·  reduce or extend the time of payment of any money due under any warrant;  \n                                                                               \n                                                                                \n  ·  change the currency or currency unit of payment of any warrant or certain  \n     provisions of the Indenture applicable to warrants in foreign currencies;  \n                                                                                \n                                                                                    \n  ·  change the method in which amounts of payments are determined on any warrant;  \n                                                                                    \n                                                                            \n  ·  reduce any amount payable upon exercise or redemption of any warrant;  \n                                                                            \n                                                     31                                                     \n                                                                                                            \n     impair the right of a holder to institute suit for the payment of a warrant,                           \n  ·  the right of a holder to exercise a warrant in accordance with its terms or, if the warrants provide,  \n     any right of repurchase at the option                                                                  \n     of the holder of a warrant;                                                                            \n                                                                                                            \n                                                                                  \n  ·  reduce the percentage of warrants of any series, the consent of the holders  \n     of which is required for any modification; or                                \n                                                                                  \n                                                                                                            \n     make any change in the guarantee that would adversely affect the holders of                            \n  ·  the warrants of such series or release the Guarantor from the guarantee other than pursuant to the     \n     terms of the Indenture. (Section 8.02)                                                                 \n                                                                                                            \nThe Indenture also permits us, the Guarantor and the trustee to amend the Indenture in certain circumstances\nwithout the consent of the holders of warrants to evidence our or the Guarantor’s merger or the replacement\nof the trustee, to cure any ambiguity or to correct or supplement any defective or inconsistent provision,to\nmake any change to the Indenture or our warrants that we deem necessary\nor desirable and that does not materially and adversely affect the interests of holders of the warrants and\nfor certain other purposes. (Section 8.01)\n\nConsolidations, Mergers, Sales and Transfers of Assets\n\nNeither we nor the Guarantor may merge or consolidate\nwith any other entity or sell, convey or transfer all or substantially all of their respective assets to any\nother entity, unless:\n                          \n  ·  with respect to us:  \n                          \n                                                                                                            \n     either we are the continuing entity in the case of a merger or consolidation                           \n     or the successor entity in the case of a merger or consolidation (including an affiliate of the        \n     Guarantor) or the entity to whom those                                                                 \n     assets are sold, conveyed or transferred in the case of a sale, conveyance or transfer is a United     \n  ·  States corporation or limited liability                                                                \n     company that expressly assumes the due and punctual payment of the principal of, any interest on, or   \n     any other amounts due under the warrants                                                               \n     and the due and punctual performance and observance of all the covenants and conditions of the         \n     Indenture binding upon us, and                                                                         \n                                                                                                            \n                                                                                                            \n     no Event of Default and no event which, with notice or lapse of time or both,                          \n  ·  would become an Event of Default has occurred or would be continuing, immediately after the merger or  \n     consolidation, or the sale, conveyance                                                                 \n     or transfer, and                                                                                       \n                                                                                                            \n                                     \n  ·  with respect to the Guarantor:  \n                                     \n                                                                                                            \n     either the Guarantor is the continuing entity in the case of a merger or consolidation                 \n     or the successor entity in the case of a merger or consolidation or the entity to whom those assets    \n     are sold, conveyed or transferred                                                                      \n     in the case of a sale, conveyance or transfer is a United States corporation that expressly assumes    \n  ·  the full and unconditional guarantee                                                                   \n     of the full and punctual payment of the principal of, any interest on, or any other amounts due under  \n     the warrants and the due and punctual                                                                  \n     performance and observance of all the covenants and conditions of the Indenture binding upon the       \n     Guarantor, and                                                                                         \n                                                                                                            \n                                                                                                            \n     no Event of Default and no event which, with notice or lapse of time or both,                          \n  ·  would become an Event of Default has occurred or would be continuing, immediately after the merger or  \n     consolidation, or the sale, conveyance                                                                 \n     or transfer. (Sections 9.01 and 9.02)                                                                  \n                                                                                                            \nAny transfer of material assets of the Guarantor\nto any other entity that occurs as a result of, or because it is related directly or indirectly to, any\nproceedings relative to the Guarantor\nunder Title 11 of the United States Code or under a receivership under Title II of the Dodd-Frank Wall\nStreet Reform and Consumer Protection\nAct of 2010 or under any other applicable federal or state bankruptcy, insolvency, resolution or other\nsimilar law will be deemed to be\na sale, conveyance or transfer of all or substantially all of the Guarantor’s assets.\n                                                     32                                                     \nThere are no covenants or other provisions in the\nIndenture that would afford holders of warrants additional protection in the event of a recapitalization\ntransaction involving us or the\nGuarantor, a change of control of us or the Guarantor or a highly leveraged transaction involving us or the\nGuarantor. The\nmerger covenant described above would apply only if the recapitalization transaction, change of control or\nhighly leveraged transaction\nwere structured to include a merger or consolidation of us or the Guarantor or a sale or conveyance of all\nor substantially all of our\nor the Guarantor’s assets. However, we may provide specific protections, such as a put right for particular\nwarrants,\nwhich we would describe in the applicable prospectus supplement.\n\nJPMorgan Chase & Co. Guarantee\n\nThe Guarantor will fully and unconditionally guarantee\nthe full and punctual payment of amounts payable under the warrants when the same becomes due and payable,\nwhether at expiration, upon\nexercise, redemption or repurchase at the option of the holders of the applicable warrants. If for any\nreason we do not make\nany required payment in respect of our warrants when due, the Guarantor will on demand pay the unpaid amount\nat the same place and in\nthe same manner that applies to payments made by us under the Indenture. The guarantee is of payment and not\nof collection.\n(Section 14.01)\n\nThe Guarantor’s obligations under the guarantee\nare unconditional and absolute. However, (1) the Guarantor will not be liable for any amount of payment that\nwe are excused\nfrom making or any amount in excess of the amount actually due and owing by us, and (2) any defense or\ncounterclaims available to us (except\nthose resulting solely from, or on account of, our insolvency or our status as debtor or subject of a\nbankruptcy or insolvency proceeding)\nwill also be available to the Guarantor to the same extent as these defense or counterclaims are available\nto us, whether or not asserted\nby us. (Section 14.02)\n\nConcerning the Trustee, Paying Agent, Registrar and Transfer Agent\n\nWe, the Guarantor and certain of their affiliates\nhave a wide range of banking relationships with Deutsche Bank Trust Company Americas, The Bank of New York\nMellon and The Bank of New\nYork Mellon, London Branch. The Bank of New York Mellon and, for warrants settled through Euroclear Bank\nSA/NV or Clearstream\nBanking, S.A., Luxembourg, The Bank of New York Mellon, London Branch, will be the paying agents,\nauthenticating agents, registrars and\ntransfer agents for warrants issued under the Indenture.\n\nDeutsche Bank Trust Company Americas is initially\nserving as the trustee for the warrants issued under our Indenture, to which JPMorgan Chase & Co. acts as a\nguarantor, the debt securities\nissued under our indenture for debt securities, to which JPMorgan Chase & Co. acts as a guarantor, and the\ndebt securities issued\nunder JPMorgan Chase & Co.’s indenture. Consequently, if an actual or potential event of default occurs with\nrespect\nto any of these securities, the trustee may be considered to have a conflicting interest for purposes of the\nTrust Indenture Act of 1939,\nas amended. In that case, the trustee may be required to resign under the Indenture, and we would be\nrequired to appoint a\nsuccessor trustee. For this purpose, a “potential” event of default means an event that would be an event of\ndefault\nif the requirements for giving us default notice or for the default having to exist for a specific period of\ntime were disregarded.\n\nReplacement of Warrants\n\nAt the expense of the holder, we may, in our discretion,\nreplace any warrant that has been mutilated, destroyed, lost or stolen or that is apparently destroyed, lost\nor stolen. The\nmutilated warrant must be delivered to the paying agent and the registrar or satisfactory evidence of the\ndestruction, loss or theft of\nthe warrant must be delivered to us, the paying agent, the registrar and the trustee. At the expense of the\nholder, an indemnity\nthat is satisfactory to us, the Guarantor, the paying agent, the registrar and the trustee may be required\nbefore a replacement warrant\nwill be issued. (Section 2.09)\n\nGoverning Law and Judgments\n\nThe warrants and the Indenture, including the guarantee,\nwill be governed by, and construed in accordance with, the laws of the State of New York. (Section 11.08) A\njudgment for money\nin an action based on warrants payable in foreign currencies in a federal or state court in the United\nStates ordinarily would be enforced\nin the United States only in U.S. dollars. The date used to determine the rate of\n                                                     33                                                     \nconversion of the foreign currency in which a particular\nwarrant is payable into U.S. dollars will depend upon various factors, including which court renders the\njudgment. However,\nif a judgment for money in an action based on the warrants and the Indenture were entered by a New York\ncourt applying New York law, the\ncourt would render a judgment in that foreign currency, and the judgment would be converted into U.S.\ndollars at the rate of exchange\nprevailing on the date of entry of the judgment.\n                                                     34                                                     \n                                                                                                            \n                                            Forms of Securities                                             \nEach debt security, warrant, unit and purchase\ncontract will be represented either by a certificate issued in definitive form to a particular investor or\nby one or more global securities\nrepresenting the entire issuance of securities. Both definitive securities and global securities will be\nissued only in registered\nform, where our or JPMorgan Financial’s obligation runs to the holder of the security named on the face of\nthe security or, if a\nregistry is kept, the registered owner of the note in the registry, and not in bearer form, where our or\nJPMorgan Financial’s obligation\nwould run to the bearer of the security. Definitive securities name you or your nominee as the owner of the\nsecurity, and in\norder to transfer or exchange these securities or to receive payments other than interest or other interim\npayments, you or your nominee\nmust physically deliver the securities to the trustee, registrar, paying agent or other agent, as\napplicable. Registered global\nsecurities name a depositary or its common depositary or nominee as the owner of the debt securities,\nwarrants, units or purchase contracts\nrepresented by these global securities. The depositary maintains a computerized system that will reflect\neach investor’s\nbeneficial ownership of the securities through an account maintained by the investor with its broker/dealer,\nbank, trust company or other\nrepresentative, as we explain more fully below.\n\nBook-Entry System\n\nGeneral. Unless otherwise specified\nin the relevant prospectus supplement, the securities will be initially issued in the form of one or more\nfully registered global securities\nthat will be deposited with or on behalf of one or more depositaries, including, without limitation, The\nDepository Trust Company (“DTC”),\nEuroclear Bank SA/NV (“Euroclear”) and/or Clearstream Banking, S.A., Luxembourg (“Clearstream”) and will be\nregistered\nin the name of such depositary or its common depositary or nominee. Under these circumstances, one or more\nregistered global\nsecurities will be issued in a denomination or aggregate denominations equal to the portion of the aggregate\nprincipal or face amount\nof the securities to be represented by registered global securities. Unless and until it is exchanged in\nwhole for securities\nin definitive registered form, a registered global security may not be transferred except as a whole by and\namong the depositary for the\nregistered global security, the common depositaries or the nominees of the depositary or any successors of\nthe depositary or those common\ndepositaries or nominees.\n\nThe securities may be accepted for clearance by\nDTC, Euroclear and Clearstream. Unless otherwise specified in the relevant prospectus supplement, the\ninitial distribution\nof the securities will be cleared through DTC only. Under these circumstances, beneficial interests in the\nregistered global\nsecurities will be shown on, and transfers thereof will be effected only through, the book-entry records\nmaintained by DTC and its direct\nand indirect participants, including, as applicable, Euroclear and Clearstream.\n\nThe laws of some states may require that some purchasers\nof securities take physical delivery of these securities in definitive form. These laws may impair your\nability to own, transfer\nor pledge beneficial interests in registered global securities.\n\nOwnership of beneficial interests in a registered\nglobal security will be limited to persons, called participants, that have accounts with the depositary or\npersons that may hold interests\nthrough participants. Upon the issuance of a registered global security, the depositary will credit, on its\nbook entry registration\nand transfer system, the participants’ accounts with the respective principal or face amounts of the\nsecurities beneficially owned\nby the participants. Any dealers, underwriters or agents participating in the distribution of the securities\nwill designate\nthe accounts to be credited. Ownership of beneficial interests in a registered global security will be shown\non, and the transfer\nof ownership interests will be effected only through, records maintained by the depositary, with respect to\ninterests of participants,\nand on the records of participants, with respect to interests of persons holding through participants.\n\nSo long as the depositary, or its common depositary\nor nominee, is the registered owner of a registered global security, that depositary or its common\ndepositary or nominee, as the case\nmay be, will be considered the sole owner and holder of the securities represented by the registered global\nsecurity for all purposes\nunder the Indenture, warrant agreement, unit agreement or purchase contract, as applicable. Except as\ndescribed below, owners\nof beneficial interests in a registered global security will not be entitled to have the securities\nrepresented by the registered global\nsecurity registered in their names, will not receive or be entitled to receive physical delivery of the\nsecurities in definitive form\nand will not be considered the owners or holders of the securities under the Indenture, warrant agreement,\nunit\n                                                     35                                                     \nagreement or purchase contract, as applicable. Accordingly,\neach person owning a beneficial interest in a registered global security must rely on the procedures of the\ndepositary for that registered\nglobal security and, if that person is not a participant, on the procedures of the participant through which\nthe person owns its interest,\nto exercise any rights of a holder under the Indenture, warrant agreement, unit agreement or purchase\ncontract, as applicable. We\nand JPMorgan Financial understand that under existing industry practices, if we or JPMorgan Financial\nrequest any action of holders or\nif an owner of a beneficial interest in a registered global security desires to give or take any action that\na holder is entitled to give\nor take under the Indenture, warrant agreement, unit agreement or purchase contract, as applicable, the\ndepositary for the registered\nglobal security would authorize the participants holding the relevant beneficial interests to give or take\nthat action, and the participants\nwould authorize beneficial owners owning through them to give or take that action or would otherwise act\nupon the instructions of beneficial\nowners holding through them.\n\nThe Clearing Systems.DTC, Euroclear\nand Clearstream, as applicable, have advised us and JPMorgan Financial as follows:\n\nDTC is a limited-purpose trust company organized\nunder the New York Banking Law, a “banking organization” within the meaning of the New York Banking Law, a\nmember of the Federal\nReserve System, a “clearing corporation” within the meaning of the New York Uniform Commercial Code and a\n“clearing\nagency” registered pursuant to the provisions of Section 17A of the Securities Exchange Act of 1934, as\namended. DTC\nholds and provides asset servicing for securities deposited with it by its participants. DTC also\nfacilitates the post-trade\nsettlement among direct participants of sales and other securities transactions in deposited securities,\nthrough electronic computerized\nbook-entry transfers and pledges between direct participants’ accounts. This eliminates the need for\nphysical movement\nof securities certificates. Direct participants include both U.S. and non-U.S. securities brokers and\ndealers, banks, trust\ncompanies, clearing corporations, and certain other organizations. DTC is a wholly-owned subsidiary of The\nDepository Trust\n& Clearing Corporation (“DTCC”). DTCC is the holding company for DTC, National Securities Clearing\nCorporation\nand Fixed Income Clearing Corporation, all of which are registered clearing agencies. DTCC is owned by the\nusers of its regulated\nsubsidiaries. Access to the DTC system is also available to others such as both U.S. and non-U.S. securities\nbrokers and dealers,\nbanks, trust companies and clearing corporations that clear through or maintain a custodial relationship\nwith a direct participant, either\ndirectly or indirectly. The DTC rules applicable to its participants are on file with the SEC. More\ninformation\nabout DTC can be found at www.dtcc.com. We and JPMorgan Chase & Co. make no representation or warranty as to\nthe accuracy\nor completeness of the information displayed on such website, and such information is not incorporated by\nreference herein and should\nnot be considered a part of this prospectus.\n\nEuroclear holds securities for its participants\nand clears and settles transactions between its participants through simultaneous electronic book-entry\ndelivery against payment, thus\neliminating the need for physical movement of certificates. Euroclear provides various other services,\nincluding safekeeping,\nadministration, clearance and settlement and securities lending and borrowing, and interfaces with domestic\nmarkets in several countries. Euroclear\nis operated by Euroclear Bank, under contract with Euroclear plc, a U.K. corporation. Euroclear Bank\nconducts all operations,\nand all Euroclear securities clearance accounts and Euroclear cash accounts are accounts with Euroclear\nBank, not Euroclear plc. Euroclear\nplc establishes policy for Euroclear on behalf of Euroclear participants. Euroclear participants include\nbanks (including central\nbanks), securities brokers and dealers and other professional financial intermediaries and may include any\nunderwriters for the securities. Indirect\naccess to Euroclear is also available to other firms that clear through or maintain a custodial relationship\nwith a Euroclear participant,\neither directly or indirectly. Euroclear is an indirect participant in DTC. Securities clearance accounts\nand cash\naccounts with Euroclear are governed by the Terms and Conditions Governing Use of Euroclear and the related\nOperating Procedures of the\nEuroclear System (collectively, the “Euroclear Terms and Conditions”) and applicable law. The Euroclear\nTerms and\nConditions govern transfers of securities and cash within Euroclear, withdrawals of securities and cash from\nEuroclear and receipts of\npayments with respect to securities in Euroclear.\n\nClearstream is incorporated under the laws of The\nGrand Duchy of Luxembourg as a société anonyme and is subject to regulation by the Luxembourg Commission for\nthe Supervision\nof the Financial Sector (Commission de Surveillance du Secteur Financier). Clearstream is owned by Deutsche\nBörse AG,\na publicly traded company. Clearstream holds securities for its participants and facilitates the\n                                                     36                                                     \nclearance and settlement of securities transactions\namong its participants through electronic book-entry changes in accounts of its participants, thereby\neliminating the need for physical\nmovement of certificates. Clearstream provides other services to its participants, including safekeeping,\nadministration, clearance\nand settlement of internationally traded securities and securities lending and borrowing. Clearstream\ninterfaces with domestic\nmarkets in several countries. Clearstream’s customers include worldwide securities brokers and dealers,\nbanks, trust\ncompanies and clearing corporations and may include professional financial intermediaries. Its U.S.\ncustomers are limited to\nsecurities brokers, dealers and banks. Indirect access to the Clearstream system is also available to others\nthat clear through\nClearstream customers or that have custodial relationships with its customers, such as banks, brokers,\ndealers and trust companies. Clearstream\nis an indirect participant in DTC. Clearstream has established an electronic bridge with Euroclear to\nfacilitate settlement\nof trades between Clearstream and Euroclear. Distributions with respect to securities held beneficially\nthrough Clearstream\nare credited to cash accounts of Clearstream customers in accordance with its rules and procedures, to the\nextent received by Clearstream.\n\nPayments on Registered Global Securities. Principal,\ninterest payments on debt securities, other amounts due under debt securities and any payments to holders\nwith respect to warrants, units\nor purchase contracts, represented by a registered global security registered in the name of a depositary or\nits common depositary or\nnominee will be made to the depositary or its common depositary or nominee, as the case may be, as the\nregistered owner of the registered\nglobal security. None of us, JPMorgan Financial, the trustees, the warrant agents, the unit agents or any of\nour or JPMorgan\nFinancial’s other agents, agent of the trustees or agent of the warrant agents or unit agents will have any\nresponsibility or liability\nfor any aspect of the records relating to payments made on account of beneficial ownership interests in the\nregistered global security\nor for maintaining, supervising or reviewing any records relating to those beneficial ownership interests.\n\nWe and JPMorgan Financial expect that the depositary\nfor any of the securities represented by a registered global security, upon receipt of any payment of\nprincipal, interest, other amounts\nor other distribution of underlying securities or other property to holders on that registered global\nsecurity, will immediately credit\nparticipants’ accounts in amounts proportionate to their respective beneficial interests in that registered\nglobal security as shown\non the records of the depositary. We and JPMorgan Financial also expect that payments by participants to\nowners of beneficial\ninterests in a registered global security held through participants will be governed by standing customer\ninstructions and customary practices,\nas is now the case with the securities held for the accounts of customers registered in “street name,” and\nwill be the responsibility\nof those participants.\n\nGlobal Clearance and Settlement Procedures.You\nwill be required to make your initial payment for the securities in immediately available funds. Secondary\nmarket trading between\nDTC participants will occur in the ordinary way in accordance with DTC rules and will be settled in\nimmediately available funds using\nDTC's Same-Day Funds Settlement System, or any successor thereto. Secondary market trading between\nClearstream customers and/or\nEuroclear participants will occur in the ordinary way in accordance with the applicable rules and operating\nprocedures of Clearstream\nand Euroclear and will be settled using the procedures applicable to conventional eurobonds in immediately\navailable funds.\n\nCross-market transfers between persons holding\ndirectly or indirectly through DTC, on the one hand, and directly or indirectly through Clearstream\ncustomers or Euroclear participants,\non the other, will be effected in DTC in accordance with DTC rules on behalf of the relevant European\ninternational clearing system by\na U.S. depositary; however, such cross-market transactions will require delivery of instructions to the\nrelevant European international\nclearing system by the counterparty in such system in accordance with its rules and procedures and within\nits established deadlines (based\non European time). The relevant European international clearing system will, if the transaction meets its\nsettlement requirements,\ndeliver instructions to the U.S. depositary to take action to effect final settlement on its behalf by\ndelivering or receiving securities\nin DTC, and making or receiving payment in accordance with normal procedures for same-day funds settlement\napplicable to DTC. Clearstream\ncustomers and Euroclear participants may not deliver instructions directly to their respective U.S.\ndepositaries.\n\nInvestors should be aware that they will be able\nto make and receive deliveries, payments and other communications involving the securities through\nClearstream and Euroclear only on days\nwhen those systems are open for business. Those systems may not be open for business on days when banks,\n                                                     37                                                     \nbrokers and other institutions are open for business\nin the United States. In addition, because of time-zone differences, there may be problems with completing\ntransactions involving\nClearstream and Euroclear on the same business day as in the United States. U.S. investors who wish to\ntransfer their interests\nin the securities, or to receive or make a payment or delivery of the securities, on a particular day, may\nfind that the transactions\nwill not be performed until the next business day in Luxembourg or Brussels, depending on whether\nClearstream or Euroclear is used.\n\nAlthough DTC, Clearstream and Euroclear have agreed\nto the foregoing procedures in order to facilitate transfers of securities among participants of DTC,\nClearstream and Euroclear, they\nare under no obligation to perform or continue to perform such procedures and such procedures may be\ndiscontinued at any time.\n\nIssuance of Definitive Securities. If\nthe depositary for any of these securities represented by a registered global security is at any time\nunwilling or unable to continue\nas depositary or ceases to be either a clearing agency registered under the Securities Exchange Act of 1934\nand any other applicable statute\nor regulation or a foreign clearing agency regulated by a foreign financial authority as defined in Section\n3(a)(52) of the Securities\nExchange Act of 1934, including, without limitation, Clearstream and Euroclear, and a successor depositary\nregistered as a clearing agency\nunder the Securities Exchange Act of 1934 is not appointed by us or JPMorgan Financial, as the case may be,\nwithin 90 days, we or JPMorgan\nFinancial, as applicable, will issue securities in definitive form in exchange for the registered global\nsecurity that had been held by\nthe depositary. In addition, the Indenture permits us and JPMorgan Financial, as the case may be, at any\ntime and in our or\nJPMorgan Financial’s sole discretion to decide not to have any of the securities issued under it represented\nby one or more registered\nglobal securities. However, The Depository Trust Company, New York, New York has advised us and JPMorgan\nFinancial that, under\nits current practices, it would notify its participants of our or JPMorgan Financial’s request, but will\nonly withdraw beneficial\ninterests from the global securities at the request of each DTC participant. We or JPMorgan Financial, as\nthe case may be,\nwill issue securities in definitive form in exchange for the registered global security or all the\nsecurities representing those securities. Any\nsecurities issued in definitive form in exchange for a registered global security will be registered in the\nname or names that the depositary\ngives to the trustee, warrant agent, unit agent or other relevant agent of ours, JPMorgan Financial’s or\ntheirs. It is\nexpected that the depositary’s instructions will be based upon directions received by the depositary from\nparticipants with respect\nto ownership of beneficial interests in the registered global security that had been held by the depositary.\n\nForm of Securities Included in Units\n\nThe form of any warrant included in a unit will\ncorrespond to the form of the unit and of any other security included in that unit.\n                                                     38                                                     \n                                                                                                            \n                                            Plan of Distribution                                            \n                                          (Conflicts of Interest)                                           \nWe may sell our debt securities, warrants, units\nor purchase contracts and JPMorgan Financial may sell its debt securities or warrants fully and\nunconditionally guaranteed by us:\n                      \n  ·  through agents;  \n                      \n                            \n  ·  through underwriters;  \n                            \n                           \n  ·  through dealers; and  \n                           \n                                                                                      \n  ·  directly to purchasers, any of whom may be customers of, engage in transactions  \n     with, or perform services for, us in the ordinary course of business.            \n                                                                                      \nIf we or JPMorgan Financial offer and sell securities\nthrough an agent, that agent will be named, and any commissions payable to that agent by us or JPMorgan\nFinancial, as applicable, will\nbe set forth in the prospectus supplement. Any agent will be acting on a best efforts basis. An agent may be\ndeemed\nto be an underwriter under the federal securities laws.\n\nIf underwriters are used in the sale of the securities,\nwe or JPMorgan Financial, as applicable, will sign an underwriting agreement with them. The underwriting\nagreement will provide\nthat the obligations of the underwriters are subject to certain conditions and that the underwriters will be\nobligated to purchase all\nof the securities if any are purchased. Underwriters will buy the securities for their own account and may\nresell them from\ntime to time in one or more transactions, including negotiated transactions, at fixed public offering prices\nor at varying prices determined\nat the time of sale. Securities may be offered to the public either through underwriting syndicates\nrepresented by managing\nunderwriters or directly by the managing underwriters. The name of the managing underwriter or underwriters,\nas well as any\nother underwriters, and the terms of the transaction, including compensation of the underwriters and\ndealers, if any, will be set forth\nin the prospectus supplement. The underwriters named in the prospectus supplement will be the only\nunderwriters for the securities\noffered by that prospectus supplement.\n\nIf a dealer is utilized in the sale of securities,\nwe or JPMorgan Financial, as applicable, will sell those securities to the dealer, as principal or as agent\nfor its customers. The\ndealer may resell those securities to the public at varying prices to be determined by the dealer at the\ntime of resale. A\ndealer may be deemed to be an underwriter of those securities under the federal securities laws. The name of\nthe dealer and\nthe terms of the transaction will be set forth in the prospectus supplement.\n\nOur and JPMorgan Financial’s net proceeds\nwill be the purchase price in the case of sales to a dealer, the public offering price less discount in the\ncase of sales to an underwriter\nor the purchase price less commission in the case of sales through an agent — in each case, less other\nexpenses attributable to\nissuance and distribution.\n\nIn order to facilitate the offering of these securities,\nthe underwriters may engage in transactions that stabilize, maintain or otherwise affect the price of these\nsecurities or any other securities\nthe prices of which may be used to determine payments on these securities. Specifically, the underwriters\nmay sell more securities\nthan they are obligated to purchase in connection with the offering, creating a short position for their own\naccounts. A short\nsale is covered if the short position is no greater than the number or amount of securities available for\npurchase by the underwriters\nunder any overallotment option. The underwriters can close out a covered short sale by exercising the\noverallotment option\nor purchasing these securities in the open market. In determining the source of securities to close out a\ncovered short sale,\nthe underwriters will consider, among other things, the open market price of these securities compared to\nthe price available under the\noverallotment option. The underwriters may also sell these securities or any other securities in excess of\nthe overallotment\noption, creating a naked short position. The underwriters must close out any naked short position by\npurchasing securities\nin the open market. A naked short position is more likely to be created if the underwriters are concerned\nthat there may be\ndownward pressure on the price of these securities in the open market after pricing that could adversely\naffect investors who purchase\nin the offering.\n                                                     39                                                     \nAs an additional means of facilitating the offering,\nthe underwriters may bid for, and purchase, these securities or any other securities in the open market to\nstabilize the price of these\nsecurities or of any other securities. Finally, in any offering of the securities through a syndicate of\nunderwriters, the\nunderwriting syndicate may also reclaim selling concessions allowed to an underwriter or a dealer for\ndistributing these securities in\nthe offering, if the syndicate repurchases previously distributed securities to cover syndicate short\npositions or to stabilize the price\nof these securities. Any of these activities may raise or maintain the market price of these securities\nabove independent market\nlevels or prevent or retard a decline in the market price of these securities. The underwriters are not\nrequired to engage\nin these activities, and may end any of these activities at any time.\n\nWe and JPMorgan Financial may agree to indemnify\nagents, underwriters or dealers against certain liabilities, including liabilities under the securities\nlaws, or to contribute to payments\nthat agents, underwriters or dealers may be required to make. Agents, underwriters and dealers may be\ncustomers of, engage\nin transactions with or perform services for, us or JPMorgan Financial in the ordinary course of business.\n\nWe and JPMorgan Financial may directly solicit\noffers to purchase securities, and we or JPMorgan Financial may sell securities directly to institutional\ninvestors or others who may\nbe deemed to be underwriters within the meaning of the securities laws. The terms of any such sales will be\ndescribed in the\nprospectus supplement.\n\nWe or JPMorgan Financial may enter into derivative\nor other hedging transactions with financial institutions. These financial institutions may in turn engage\nin sales of securities\nto hedge their position, deliver this prospectus in connection with some or all of those sales and use the\nsecurities covered by this\nprospectus to close out any loan of securities or short position created in connection with those sales. We\nor JPMorgan Financial\nmay also sell securities short using this prospectus and deliver securities covered by this prospectus to\nclose out any loan of securities\nor such short positions, or loan or pledge securities to financial institutions that in turn may sell the\nsecurities using this prospectus. We\nor JPMorgan Financial may pledge or grant a security interest in some or all of the securities covered by\nthis prospectus to support a\nderivative or hedging position or other obligation and, if we or JPMorgan Financial default in the\nperformance of our or JPMorgan Financial’s\nobligations, the pledgees or secured parties may offer and sell the securities from time to time pursuant to\nthis prospectus.\n\nWe or JPMorgan Financial may loan or pledge securities\nto a financial institution or other third party that in turn may sell the securities using this prospectus.\nSuch financial\ninstitution or third party may transfer its short position to investors in our or JPMorgan Financial’s\nsecurities or in connection\nwith a simultaneous offering of other securities offered by this prospectus.\n\nIf so indicated in the applicable prospectus supplement,\none or more firms, including J.P. Morgan Securities LLC, which we refer to as “remarketing firms,” may also\noffer or sell\nthe securities in connection with a remarketing arrangement upon their purchase. Remarketing firms may act\nas principals for\ntheir own accounts or as agents for us. These remarketing firms will offer or sell the securities in\naccordance with a redemption\nor repurchase pursuant to the terms of the securities. The prospectus supplement will identify any\nremarketing firm and the\nterms of its agreement, if any, with us or JPMorgan Financial and will describe the remarketing firm’s\ncompensation. Remarketing\nfirms may be deemed to be underwriters in connection with the securities they remarket. Remarketing firms\nmay be entitled under\nagreements that may be entered into with us or JPMorgan Financial to indemnification by us or JPMorgan\nFinancial against certain civil\nliabilities, including liabilities under the Securities Act of 1933, as amended, and may be customers of,\nengage in transactions with\nor perform services for us and JPMorgan Financial in the ordinary course of business.\n\nWe and/or JPMorgan Financial may authorize agents,\nunderwriters and dealers to solicit offers by certain institutions to purchase the securities from us or\nJPMorgan Financial at the public\noffering price stated in the prospectus supplement pursuant to delayed delivery contracts providing for\npayment and delivery on a specified\ndate in the future and on terms described in the prospectus supplement. These contracts will be subject only\nto those conditions\ndescribed in the prospectus supplement, and the prospectus supplement will state the commission payable for\nsolicitation of these offers. Institutions\nwith which delayed delivery contracts may be made include commercial and savings banks, insurance\n                                                     40                                                     \ncompanies, pension funds, investment companies, educational\nand charitable institutions and other institutions but will in all cases be institutions that we or JPMorgan\nFinancial have approved.\n\nThese contracts will be subject only to the conditions\nthat:\n                                                                                \n  ·  the underwriters purchase the securities at the time of the contract; and  \n                                                                                \n                                                                                      \n  ·  the purchase is not prohibited under the laws of any jurisdiction in the United  \n     States to which the purchase is subject.                                         \n                                                                                      \nWe or JPMorgan Financial will pay a commission,\nas indicated in the prospectus supplement, to agents and dealers soliciting purchases of securities pursuant\nto delayed delivery contracts\nthat we or JPMorgan Financial have accepted.\n\nThis prospectus and related prospectus supplement\nmay be used by direct or indirect wholly owned subsidiaries of ours, including J.P. Morgan Securities LLC,\nin connection with offers and\nsales related to secondary market transactions in the securities. Those subsidiaries may act as principal or\nagent in those\ntransactions. Secondary market sales will be made at prices related to prevailing market prices at the time\nof sale.\n\nFollowing the initial distribution of any of the\nsecurities, our affiliates may offer and sell these securities in the course of their business as broker\ndealers. Our affiliates\nmay act as principals or agents in these transactions and may make any sales at varying prices related to\nprevailing market prices at\nthe time of sale or otherwise. None of our affiliates is obligated to make a market in any of these\nsecurities and may discontinue\nany market making activities at any time without notice.\n\nConflicts of Interest\n\nJ.P. Morgan Securities LLC has a “conflict\nof interest” within the meaning of FINRA Rule 5121 in any offering of the securities in which it\nparticipates because we own, directly\nor indirectly, all of the outstanding equity securities of J.P. Morgan Securities LLC, because J.P. Morgan\nSecurities LLC and JPMorgan\nFinancial are under common control by us and because the net proceeds received from the sale of the\nsecurities will be used, in part,\nby J.P. Morgan Securities LLC or its affiliates in connection with hedging our or JPMorgan Financial’s\nobligations under the securities. The\noffer and sale of the securities by J.P. Morgan Securities LLC will comply with the requirements of FINRA\nRule 5121 regarding a FINRA\nmember firm’s participation in a public offering of securities of an affiliate. In accordance with FINRA\nRule 5121, neither\nJ.P. Morgan Securities LLC nor any other affiliated underwriter, agent or dealer of ours or JPMorgan\nFinancial’s may sell the securities\nto any of its discretionary accounts without the specific written approval of the customer.\n                                                     41                                                     \n                                                                                                            \n                                           Independent Registered                                           \n                                           Public Accounting Firm                                           \nThe financial statements and management’s\nassessment of the effectiveness of internal control over financial reporting (which is included in\nManagement’s Report on Internal\nControl over Financial Reporting) incorporated in this prospectus by reference to JPMorgan Chase & Co.’s\nAnnual Report on Form\n10-K for the year ended December 31, 2022 have been so incorporated in reliance on the report of\nPricewaterhouseCoopers LLP, an independent\nregistered public accounting firm, given on the authority of said firm as experts in auditing and\naccounting.\n                                               Legal Matters                                                \nThe validity of the securities will be passed upon\nfor JPMorgan Chase & Co. and JPMorgan Chase Financial Company LLC by Simpson Thacher & Bartlett LLP. The\nvalidity of\ncertain of the securities will be passed upon for JPMorgan Chase & Co. and JPMorgan Chase Financial Company\nLLC by Davis Polk &\nWardwell LLP, as special products counsel, by Sidley Austin LLP, as counsel, or by Latham & Watkins LLP, as\nspecial product counsel. Davis\nPolk & Wardwell LLP will also pass upon certain legal matters relating to the securities for the agents.\nEach of Simpson\nThacher & Bartlett LLP, Davis Polk & Wardwell LLP, Sidley Austin LLP and Latham & Watkins LLP has in the\npast represented\nJPMorgan Chase & Co. and its affiliates and continues to represent JPMorgan Chase & Co. and its affiliates\non a regular basis\nand in a variety of matters.\n                                           Benefit Plan Investor                                            \n                                               Considerations                                               \nA fiduciary of a pension, profit-sharing or other\nemployee benefit plan subject to Title I of the Employee Retirement Income Security Act of 1974, as amended\n(“ERISA”), including\nentities such as collective investment funds, partnerships and separate accounts whose underlying assets\ninclude the assets of such plans\n(collectively, “ERISA Plans”) should consider the fiduciary standards of ERISA in the context of the ERISA\nPlan’s particular\ncircumstances before authorizing an investment in the securities. Among other factors, the fiduciary should\nconsider whether\nthe investment would satisfy the prudence and diversification requirements of ERISA and would be consistent\nwith the documents and instruments\ngoverning the ERISA Plan.\n\nSection 406 of ERISA and Section 4975 of the Internal\nRevenue Code of 1986, as amended (the “Code”), prohibit ERISA Plans, as well as plans (including individual\nretirement accounts\nand Keogh plans) subject to Section 4975 of the Code (together with ERISA Plans, “Plans”), from engaging in\ncertain transactions\ninvolving the “plan assets” with persons who are “parties in interest” under ERISA or “disqualified persons”\nunder Section 4975 of the Code (in either case, referred to herein as “Parties in Interest”) with respect to\nsuch Plans. As\na result of our business, we, and our current and future affiliates (including JPMorgan Financial), may be\nParties in Interest with respect\nto many Plans. Where we (or one of our affiliates, including JPMorgan Financial) are a Party in Interest\nwith respect to a\nPlan (either directly or by reason of our ownership interests in our directly or indirectly owned\nsubsidiaries), the purchase and holding\nof the securities by or on behalf of the Plan could be a prohibited transaction under Section 406 of ERISA\nand/or Section 4975 of the\nCode, unless statutory or administrative exemptive relief were available.\n\nIn this regard, certain prohibited transaction\nclass exemptions (“PTCEs”) issued by the U.S. Department of Labor may provide exemptive relief for direct or\nindirect prohibited\ntransactions resulting from the purchase or holding of the securities. Those class exemptions are PTCE 96-23\n(for certain transactions\ndetermined by in-house asset managers), PTCE 95-60 (for certain transactions involving insurance company\ngeneral accounts), PTCE 91-38\n(for certain transactions involving bank collective investment funds), PTCE 90-1 (for certain transactions\ninvolving insurance company\nseparate accounts) and PTCE 84-14 (for certain transactions determined by independent qualified asset\nmanagers). In addition,\nERISA Section 408(b)(17) and Section 4975(d)(20) of the Code may provide a limited exemption for the\npurchase and sale of the securities\nand related lending transactions, provided that neither the issuer of the securities nor any of its\naffiliates have or exercise\nany discretionary authority or control or render any investment advice with respect to the assets of the\nPlan involved in the transaction\nand provided further that the Plan pays no more, and receives no less, than adequate consideration in\nconnection with the transaction\n(the so-called “service provider exemption”). There can be no assurance\n                                                     42                                                     \nthat any of these statutory or class exemptions will\nbe available with respect to transactions involving the securities.\n\nAccordingly, the securities may not be purchased\nor held by any Plan, any entity whose underlying assets include “plan assets” by reason of any Plan’s\ninvestment in\nthe entity (a “Plan Asset Entity”) or any person investing “plan assets” of any Plan, unless such purchaser\nor\nholder is eligible for the exemptive relief available under PTCE 96-23, 95-60, 91-38, 90-1 or 84-14 or the\nservice-provider exemption\nor there is some other basis on which the purchase and holding of the securities will not constitute or\nresult in a non-exempt prohibited\ntransaction under ERISA or Section 4975 of the Code. Each purchaser or holder of the securities or any\ninterest therein will\nbe deemed to have represented by its purchase or holding of the securities that (a) it is not a Plan or a\nPlan Asset Entity and its purchase\nand holding of the securities is not made on behalf of or with “plan assets” of any Plan or a Plan Asset\nEntity or (b) its\npurchase, holding and subsequent disposition of the securities will not constitute or result in a non-exempt\nprohibited transaction under\nSection 406 of ERISA or Section 4975 of the Code.\n\nIn this regard, certain governmental plans (as\ndefined in Section 3(32) of ERISA), church plans (as defined in Section 3(33) of ERISA) and non-U.S. plans\n(as described in Section 4(b)(4)\nof ERISA) (collectively, “Non-ERISA Arrangements”) are not subject to the fiduciary responsibility or\nprohibited transaction\nrules of ERISA or Section 4975 of the Code, but may be subject to similar rules under other applicable laws\nor regulations (“Similar\nLaws”). Accordingly, each such purchaser or holder of the securities shall be required to represent and be\ndeemed to\nhave represented by its purchase or holding of the securities that its purchase, holding and subsequent\ndisposition of the securities\nwill not constitute or result in a violation of any applicable Similar Laws.\n\nDue to the complexity of these rules, it is particularly\nimportant that fiduciaries or other persons considering purchasing the securities on behalf of or with “plan\nassets” of any\nPlan, Plan Asset Entity or Non-ERISA Arrangement consult with their counsel regarding the relevant\nprovisions of ERISA, the Code or applicable\nSimilar Laws and the availability of exemptive relief under PTCE 96-23, 95-60, 91-38, 90-1, 84-14, the\nservice provider exemption or some\nother basis on which the acquisition and holding of the securities will not constitute or result in a non-\nexempt prohibited transaction\nunder ERISA or Section 4975 of the Code or a violation of any applicable Similar Laws.\n\nThe securities are contractual financial instruments. The\nfinancial exposure provided by the securities is not a substitute or proxy for, and is not intended as a\nsubstitute or proxy for, individualized\ninvestment management or advice for the benefit of any purchaser or holder of the securities. The securities\nhave not been\ndesigned and will not be administered in a manner intended to reflect the individualized needs and\nobjectives of any purchaser or holder\nof the securities.\n\nEach purchaser or holder of any securities acknowledges\nand agrees that:\n                                                                                                            \n       the purchaser or holder or its fiduciary has made and shall make all investment decisions for the    \n       purchaser or holder and the purchaser                                                                \n       or holder has not relied and shall not rely in any way upon us or our affiliates (including          \n       JPMorgan Financial) to act as a fiduciary                                                            \n  (i)  or adviser of the purchaser or holder with respect to (A) the design and terms of the securities,    \n       (B) the purchaser or holder’s                                                                        \n       investment in the securities, or (C) the exercise of or failure to exercise any rights the           \n       purchaser or holder or we or any of our affiliates                                                   \n       (including JPMorgan Financial) has under or with respect to the securities;                          \n                                                                                                            \n                                                                                                            \n        we and our affiliates (including JPMorgan Financial) have acted and will act solely for our own     \n        accounts in connection with (A) all                                                                 \n  (ii)  transactions relating to the securities and (B) all hedging transactions in connection with our or  \n        our affiliates’ (including JPMorgan                                                                 \n        Financial’s) obligations under the securities;                                                      \n                                                                                                            \n                                                                                                            \n         any and all assets and positions relating to hedging transactions by us or our affiliates          \n  (iii)  (including JPMorgan Financial) are assets                                                          \n         and positions of those entities and are not assets and positions held for the benefit of the       \n         purchaser or holder;                                                                               \n                                                                                                            \n                                                                                                            \n  (iv)  our and JPMorgan Financial’s interests are adverse to the interests of the purchaser or holder;     \n        and                                                                                                 \n                                                                                                            \n                                                     43                                                     \n                                                                                                            \n       neither we nor any of our affiliates (including JPMorgan Financial) is a fiduciary or adviser of     \n       the purchaser or holder in connection                                                                \n  (v)  with any such assets, positions or transactions, and any information that we or any of our           \n       affiliates (including JPMorgan Financial) may                                                        \n       provide is not intended to be impartial investment advice.                                           \n                                                                                                            \nEach purchaser and holder of the securities has\nexclusive responsibility for ensuring that its purchase, holding and subsequent disposition of the\nsecurities does not violate the fiduciary\nor prohibited transaction rules of ERISA, the Code or any applicable Similar Laws. The sale of any\nsecurities to any Plan,\nPlan Asset Entity or Non-ERISA Arrangement is in no respect a representation by us or any of our affiliates\n(including JPMorgan Financial)\nor representatives that such an investment is appropriate for, or meets all relevant legal requirements with\nrespect to investments by,\nPlans, Plan Asset Entities or Non-ERISA Arrangements generally or any particular Plan, Plan Asset Entity or\nNon-ERISA Arrangement. Neither\nthis discussion nor anything in this prospectus is or is intended to be investment advice directed at any\npotential Plan, Plan Asset or\nNon-ERISA Arrangement purchaser or at such purchasers generally.\n                                                     44                                                     \n                                                                                                            \n                                                  PART II                                                   \n                                   INFORMATION NOT REQUIRED IN PROSPECTUS                                   \nItem 14. Other Expenses of Issuance and Distribution\n\nEstimated expenses in connection with the issuance\nand distribution of securities being registered, other than underwriting compensation and related hedging\ncosts, are as follows:\n                                                                    \n                                                         Amount to  \n                                                                be  \n                                                              Paid  \n  Securities and Exchange Commission registration                $  \n  fee                                                11,020,000.00  \n  Legal fees and expenses                                        $  \n                                                       600,000.00*  \n  Accounting fees and expenses                                   $  \n                                                        50,000.00*  \n  Trustees fees and expenses (including counsel                  $  \n  fees)                                                 25,000.00*  \n  Printing expenses                                              $  \n                                                         5,000.00*  \n  Miscellaneous                                                  $  \n                                                        20,000.00*  \n  TOTAL                                                          $  \n                                                    11,720,000.00*  \n                                                                    \n                \n  *  Estimated  \n                \nItem 15.Indemnification of Directors and Officers\n\nJPMorgan Chase & Co.\n\nPursuant to the Delaware General Corporation Law\n(“DGCL”), a corporation may indemnify any person who was or is a party or is threatened to be made a party\nto any threatened,\npending or completed action, suit or proceeding, whether civil, criminal, administrative or investigative\n(other than a derivative action\nby or in the right of such corporation) who is or was a director, officer, employee or agent of such\ncorporation, or serving at the request\nof such corporation in such capacity for another corporation, partnership, joint venture, trust or other\nenterprise, against expenses\n(including attorneys’ fees), judgments, fines and amounts paid in settlement actually and reasonably\nincurred in connection with\nsuch action, suit or proceeding, if such person acted in good faith and in a manner he or she reasonably\nbelieved to be in or not opposed\nto the best interests of such corporation, and, with respect to any criminal action or proceeding, had no\nreasonable cause to believe\nhis or her conduct was unlawful.\n\nThe DGCL also permits indemnification by a corporation\nunder similar circumstances for expenses (including attorneys’ fees) actually and reasonably incurred by\nsuch persons in connection\nwith the defense or settlement of a derivative action, except that no indemnification shall be made in\nrespect of any claim, issue or\nmatter as to which such person shall have been adjudged to be liable to such corporation unless and only to\nthe extent that the Delaware\nCourt of Chancery or the court in which such action or suit was brought shall determine upon application\nthat such person is fairly and\nreasonably entitled to indemnity for such expenses which such court shall deem proper.\n\nThe DGCL provides that the indemnification described\nabove shall not be deemed exclusive of any other indemnification that may be granted by a corporation\npursuant to its by-laws, disinterested\ndirectors’ vote, stockholders’ vote, agreement or otherwise.\n\nThe DGCL also provides corporations with the power\nto purchase and maintain insurance on behalf of any person who is or was a director, officer, employee or\nagent of the corporation, or\nis or was serving at the request of the corporation in a similar capacity for another corporation,\npartnership, joint venture, trust or\nother enterprise, against any liability asserted against him or her in any such capacity, or arising out of\nhis or her status as such,\nwhether or not the corporation would have the power to indemnify him or her against such liability as\ndescribed above.\n\nThe certificate of incorporation of JPMorgan Chase\n& Co. (“JPMorgan Chase”) provides that, to the fullest extent that the DGCL as from time to time in effect\npermits the\nlimitation or elimination of the\n                                                    II-1                                                    \nliability of directors, no director of JPMorgan Chase\nshall be personally liable to JPMorgan Chase or its stockholders for monetary damages for breach of\nfiduciary duty as a director.\n\nJPMorgan Chase’s certificate of incorporation\nempowers JPMorgan Chase to indemnify any director, officer, employee or agent of JPMorgan Chase or any other\nperson who is serving at\nJPMorgan Chase’s request in any such capacity with another corporation, partnership, joint venture, trust or\nother enterprise (including,\nwithout limitation, any employee benefit plan) to the fullest extent permitted under the DGCL as from time\nto time in effect, and any\nsuch indemnification may continue as to any person who has ceased to be a director, officer, employee or\nagent and may inure to the benefit\nof the heirs, executors and administrators of such a person.\n\nJPMorgan Chase’s certificate of incorporation\nalso empowers JPMorgan Chase by action of its board of directors, notwithstanding any interest of the\ndirectors in the action, to purchase\nand maintain insurance in such amounts as the Board of Directors deems appropriate to protect any director,\nofficer, employee or agent\nof JPMorgan Chase or any other person who is serving at JPMorgan Chase’s request in any such capacity with\nanother corporation,\npartnership, joint venture, trust or other enterprise (including, without limitation, any employee benefit\nplan) against any liability\nasserted against him or her or incurred by him or her in any such capacity or arising out of his or her\nstatus as such (including, without\nlimitation, expenses, judgments, fines (including any excise taxes assessed on a person with respect to any\nemployee benefit plan) and\namounts paid in settlement) to the fullest extent permitted under the DGCL as from time to time in effect,\nwhether or not JPMorgan Chase\nwould have the power or be required to indemnify any such person under the terms of any agreement or by-law\nor the DGCL.\n\nIn addition, JPMorgan Chase’s by-laws require\nJPMorgan Chase to indemnify, to the fullest extent permitted under applicable law, as from time to time in\neffect, any person who was\nor is involved in any manner (including, without limitation, as a party or witness), or is threatened to be\nmade so involved, in any threatened,\npending or completed investigation, claim, action, suit or proceeding, whether civil, criminal,\nadministrative, or investigative (including\nwithout limitation, any action, suit or proceeding by or in the right of JPMorgan Chase to procure a\njudgment in its favor, but excluding\nany action, suit, or proceeding, or part thereof, brought by such person against JPMorgan Chase or any of\nits affiliates unless consented\nto by JPMorgan Chase) (a “Proceeding”) by reason of the fact that he or she is or was a director, officer,\nor employee of\nJPMorgan Chase, or is or was serving at the request of JPMorgan Chase as a director, officer or employee of\nanother corporation, partnership,\njoint venture, trust or other enterprise, against all expenses (including attorneys’ fees), judgments, fines\nand amounts paid in\nsettlement actually and reasonably incurred by him or her in connection with such Proceeding (or part\nthereof). The by-laws\nspecify that the right to indemnification so provided is a contract right, set forth certain procedural and\nevidentiary standards applicable\nto the enforcement of a claim under the by-laws and entitle the persons to be indemnified to receive payment\nin advance of any expenses\nincurred in connection with such Proceeding, consistent with the provisions of applicable law, as from time\nto time in effect. Such\nprovisions, however, are intended to be in furtherance and not in limitation of the general right to\nindemnification provided in the by-laws,\nwhich right of indemnification and of advancement of expenses is not exclusive of any other rights to which\na person seeking indemnification\nmay otherwise be entitled, under any statute, by-law, agreement, vote or otherwise.\n\nJPMorgan Chase’s by-laws also provide that\nJPMorgan Chase may enter into contracts with any director, officer or employee of JPMorgan Chase in\nfurtherance of the indemnification\nprovisions in the by-laws, as well as create a trust fund, grant a security interest or use other means\n(including, without limitation,\na letter of credit) to ensure payment of amounts indemnified.\n\nLastly, JPMorgan Chase’s by-laws also provide\nthat any repeal or modification of the indemnification rights provided in the by-laws shall not adversely\naffect any right or protection\nthereunder of any person in respect of any act or omission occurring prior to the time of such repeal or\nmodification.\n\nThe foregoing statements are subject to the detailed\nprovisions of Section 145 of the DGCL and the certificate of incorporation and by-laws of JPMorgan Chase.\n                                                    II-2                                                    \nJPMorgan Chase Financial Company LLC\n\nPursuant to Section 18-108 of the Delaware Limited\nLiability Company Act, a Delaware limited liability company is empowered to indemnify and hold harmless any\nmember or manager or other\npersons from and against all claims and demands whatsoever.\n\nThe limited liability company agreement of JPMorgan\nChase Financial Company LLC (“JPMorgan Financial”) provides that, to the fullest extent permitted by the\nlaws of the State\nof Delaware, no member, manager or officer shall be liable to JPMorgan Financial or any other member for any\nloss, damage or claim incurred\nby reason of any act or omission performed or omitted by such member, manager or officer in good faith on\nbehalf of JPMorgan Financial\nand in a manner reasonably believed to be within the scope of the authority conferred on such member,\nmanager or officer by the limited\nliability company agreement.\n\nJPMorgan Financial’s limited liability company\nagreement provides that each person (and the heirs, executors or administrators of such person) who was or\nis a party or is threatened\nto be made a party to, or is involved in any threatened, pending or completed action, suit or proceeding,\nwhether civil, criminal, administrative\nor investigative (hereinafter a “proceeding”), by reason of the fact that such person is or was a member,\nmanager or officer,\nor is or was serving at the request of JPMorgan Financial as a manager, director, officer, or trustee of\nanother company, corporation\nor of a partnership, joint venture, trust or other enterprise, including service with respect to an employee\nbenefit plan (hereinafter\nan “indemnitee”), whether the basis of such proceeding is alleged action in an official capacity as a\nmember, manager, director,\nofficer or trustee, or in any other capacity while serving as a member, manager, director, officer, or\ntrustee, shall be indemnified and\nheld harmless by JPMorgan Financial to the fullest extent permitted by the laws of the State of Delaware for\nmembers, managers and officers\nof limited liability companies formed under the laws of the State of Delaware, as then in effect, against\nall expense, liability and loss\n(including attorneys’ fees, judgments, fines, ERISA excise taxes or penalties and amounts paid in\nsettlement) reasonably incurred\nor suffered by such indemnitee in connection therewith; provided, however, that JPMorgan Financial shall\nindemnify any such\nindemnitee in connection with a proceeding (or part thereof) initiated by such indemnitee only if such\nproceeding (or part thereof) was\nauthorized by JPMorgan Financial’s board of managers.\n\nIn addition, JPMorgan Financial’s limited\nliability company agreement provides that an indemnitee shall have the right to be paid by JPMorgan\nFinancial the expenses (including\nattorney’s fees) incurred in defending any such proceeding in advance of its final disposition (hereinafter\nan “advancement\nof expenses”); provided, however, an advancement of expenses incurred by an indemnitee in his or her\ncapacity as a\nmember, manager or officer (and not in any other capacity in which service was or is rendered by such\nindemnitee, including, without limitation,\nservice to an employee benefit plan) shall be made only upon delivery to JPMorgan Financial of an\nundertaking (hereinafter an “undertaking”),\nby or on behalf of such indemnitee, to repay all amounts so advanced if it shall ultimately be determined by\nfinal judicial decision from\nwhich there is no further right to appeal (hereinafter a “final adjudication”) that such indemnitee is not\nentitled to be\nindemnified for such expenses under the limited liability company agreement or otherwise.\n\nJPMorgan Financial’s limited liability company\nagreement empowers JPMorgan Financial to maintain insurance, at its expense, to protect itself and any\nmember, manager, officer, employee\nor agent of JPMorgan Financial or another company, corporation, partnership, joint venture, trust or other\nenterprise against any expense,\nliability or loss, whether or not JPMorgan Financial would have the power to indemnify such person against\nsuch expense, liability, or\nloss under the limited liability company agreement or the Delaware Limited Liability Company Act.\n\nJPMorgan Financial’s limited liability company\nagreement empowers JPMorgan Financial, to the extent authorized from time to time by its board of managers,\nto grant rights to indemnification\nand to the advancement of expenses to any employee or agent of JPMorgan Financial to the fullest extent of\nthe limited liability company\nagreement with respect to the indemnification and advancement of expenses of member, managers and officers\nof JPMorgan Financial.\n\nJPMorgan Financial’s limited liability company\nagreement also provides that the rights to indemnification and to the advancement of expenses conferred in\nthe limited liability company\nagreement\n                                                    II-3                                                    \nshall not be exclusive of any other right which any\nperson may have or hereafter acquire under any statute, agreement (including the limited liability company\nagreement), vote of disinterested\nmanagers or otherwise.\n\nLastly, JPMorgan Financial’s limited liability\ncompany agreement provides that the rights conferred upon indemnitees in the limited liability company\nagreement shall be contract rights\nand such rights shall continue as to an indemnitee who has ceased to be a member, manager, director, officer\nor trustee and shall inure\nto the benefit of the indemnitee’s heirs, executors and administrators. Any amendment, alteration or repeal\nof the indemnity\nsection of the limited liability company agreement that adversely affects any right of an indemnitee or its\nsuccessors shall be prospective\nonly and shall not limit or eliminate any such right with respect to any proceeding involving any occurrence\nor alleged occurrence of\nany action or omission to act that took place prior to such amendment, alteration or repeal. Any indemnity\nunder the limited\nliability company agreement shall be provided out of and to the extent of JPMorgan Financial’s assets only,\nand no member shall\nhave personal liability on account thereof.\n\nThe foregoing statements are subject to the detailed\nprovisions of Section 18-108 of the Delaware Limited Liability Company Act and the limited liability company\nagreement of JPMorgan Financial.\n\nItem 16. Exhibits\n\nThe exhibits to this registration statement are\nlisted in the exhibit index, which appears elsewhere herein and is incorporated herein by reference.\n\nItem 17. Undertakings\n\n(a) Each\nof the undersigned Registrants hereby undertakes:\n\n(1) To file, during any period in which offers\nor sales are being made, a post-effective amendment to this Registration Statement:\n\n(i) To include any prospectus required by Section 10(a)(3)\nof the Securities Act of 1933, as amended;\n\n(ii) To reflect in the prospectus any facts or events arising\nafter the effective date of the Registration Statement (or the most recent post-effective amendment thereof)\nwhich, individually or in\nthe aggregate, represent a fundamental change in the information set forth in this Registration Statement.\nNotwithstanding\nthe foregoing, any increase or decrease in volume of securities offered (if the total dollar value of\nsecurities offered would not exceed\nthat which was registered) and any deviation from the low or high end of the estimated maximum offering\nrange may be reflected in the\nform of prospectus filed with the Commission pursuant to Rule 424(b) if, in the aggregate, the changes in\nvolume and price represent no\nmore than 20 percent change in the maximum aggregate offering price set forth in the “Calculation of\nRegistration Fee” table\nin the effective Registration Statement; and\n\n(iii) To include any material information with respect to\nthe plan of distribution not previously disclosed in the Registration Statement or any material change to\nsuch information in the Registration\nStatement;\n\nprovided, however, that paragraphs (a)(1)(i), (a)(1)(ii)\nand (a)(1)(iii) do not apply if the information required to be included in a post-effective amendment by\nthose paragraphs is contained\nin reports filed with or furnished to the Commission by JPMorgan Chase & Co. pursuant to Section 13 or\nSection 15(d) of the Securities\nExchange Act of 1934, as amended, that are incorporated by reference in this Registration Statement, or is\ncontained in a form of prospectus\nfiled pursuant to Rule 424(b) that is part of the Registration Statement.\n\n(2) That,\nfor the purpose of determining any liability under the Securities Act of 1933, as amended, each such post-\neffective amendment shall be\ndeemed to be a new registration statement relating to the securities offered therein, and the offering of\nsuch securities at that time\nshall be deemed to be the initial bona fide offering thereof.\n                                                    II-4                                                    \n(3) To\nremove from registration by means of a post-effective amendment any of the securities being registered which\nremain unsold at the termination\nof the offering.\n\n(4) That,\nfor the purpose of determining liability under the Securities Act of 1933, as amended, to any purchaser:\n\n(i) Each prospectus\nfiled by a Registrant pursuant to Rule 424(b)(3) shall be deemed to be part of the registration statement as\nof the date the filed\nprospectus was deemed part of and included in the registration statement; and\n\n(ii) Each prospectus\nrequired to be filed pursuant to Rule 424(b)(2), (b)(5), or (b)(7) as part of a registration statement in\nreliance on Rule 430B\nrelating to an offering made pursuant to Rule 415(a)(1)(i), (vii) or (x) for the purpose of providing the\ninformation required by\nSection 10(a) of the Securities Act of 1933, as amended, shall be deemed to be part of and included in the\nregistration statement\nas of the earlier of the date such form of prospectus is first used after effectiveness or the date of the\nfirst contract of sale of securities\nin the offering described in the prospectus. As provided in Rule 430B, for liability purposes of the issuer\nand any person\nthat is at that date an underwriter, such date shall be deemed to be a new effective date of the\nregistration statement relating to the\nsecurities in the registration statement to which that prospectus relates, and the offering of such\nsecurities at that time shall be deemed\nto be the initial bona fide offering thereof. Provided, however, that no statement made in a registration\nstatement\nor prospectus that is part of the registration statement or made in a document incorporated or deemed\nincorporated by reference into the\nregistration statement or prospectus that is part of the registration statement will, as to a purchaser with\na time of contract of sale\nprior to such effective date, supersede or modify any statement that was made in the registration statement\nor prospectus that was part\nof the registration statement or made in any such document immediately prior to such effective date.\n\n(5) That,\nfor the purpose of determining liability of a Registrant under the Securities Act of 1933, as amended, to\nany purchaser in the initial\ndistribution of the securities, each of the undersigned Registrants undertakes that in a primary offering of\nsecurities of such undersigned\nRegistrant pursuant to this Registration Statement, regardless of the underwriting method used to sell the\nsecurities to the purchaser,\nif the securities are offered or sold to such purchaser by means of any of the following communications,\nsuch undersigned Registrant will\nbe a seller to the purchaser and will be considered to offer or sell such securities to such purchaser:\n\n(i) Any preliminary\nprospectus or prospectus of such undersigned Registrant relating to the offering required to be filed\npursuant to Rule 424;\n\n(ii) Any free writing\nprospectus relating to the offering prepared by or on behalf of such undersigned Registrant or used or\nreferred to by such undersigned\nRegistrant;\n\n(iii) The portion\nof any other free writing prospectus relating to the offering containing material information about such\nundersigned Registrant or its\nsecurities provided by or on behalf of such undersigned Registrant; and\n\n(iv) Any other communication\nthat is an offer in the offering made by such undersigned Registrant to the purchaser.\n\n(b) Each\nof the undersigned Registrants hereby undertakes that, for purposes of determining any liability under the\nSecurities Act of 1933, as\namended, each filing of the JPMorgan Chase & Co.’s annual report pursuant to Section 13(a) or Section 15(d)\nof the Securities\nExchange Act of 1934, as amended, (and, where applicable, each filing of an employee benefit plan’s annual\nreport pursuant to Section\n15(d) of the Securities Exchange Act of 1934, as amended) that is incorporated by reference in this\nRegistration Statement shall be deemed\nto be a new registration statement relating to the securities offered therein, and the offering of such\nsecurities at that time shall\nbe deemed to be the initial bona fide offering thereof.\n                                                    II-5                                                    \n(c) Insofar\nas indemnification for liabilities arising under the Securities Act of 1933, as amended, may be permitted to\ndirectors, officers and controlling\npersons of a Registrant pursuant to the provisions described under Item 15 of this Registration Statement,\nor otherwise, such Registrant\nhas been advised that in the opinion of the Securities and Exchange Commission such indemnification is\nagainst public policy as expressed\nin the Securities Act of 1933, as amended, and is, therefore, unenforceable. In the event that a claim for\nindemnification\nagainst such liabilities (other than the payment by a Registrant of expenses incurred or paid by a director,\nofficer or controlling person\nof such Registrant in the successful defense of any action, suit or proceeding) is asserted by such\ndirector, officer or controlling person\nin connection with the securities being registered, such Registrant will, unless in the opinion of its\ncounsel the matter has been settled\nby controlling precedent, submit to a court of appropriate jurisdiction the question whether such\nindemnification by it is against public\npolicy as expressed in such Act and will be governed by the final adjudication of such issue.\n                                                    II-6                                                    \n                                                                                                            \n                                               Exhibit Index                                                \n                                                                                                            \n  Exhibit  Document Description                                                                             \n  Number                                                                                                    \n           Underwriting Agreement Standard Provisions (including form of Delayed Delivery Contract) dated   \n  1(a)(1)  as of June 12, 2001 (incorporated by reference to Exhibit 1(a)(1) to Amendment No. 1 to the      \n           Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)                 \n           Master Agency Agreement dated as of December 1, 2005, among JPMorgan Chase & Co. and the Agents  \n  1(a)(2)  party thereto (incorporated by reference to Exhibit 1(a)(2) to the Registration Statement on     \n           Form S-3 (File No. 333-130051) of JPMorgan Chase & Co.)                                          \n           Addendum to Master Agency Agreement dated as of October 12, 2006, between JPMorgan Chase & Co.   \n  1(a)(3)  and the Agents party thereto (incorporated by reference to Exhibit 1(a)(3) to the Registration   \n           Statement on Form S-3 (File No. 333-155535) of JPMorgan Chase & Co.)                             \n           Master Addendum to Master Agency Agreement and Calculation Agent Agreement each dated December   \n  1(a)(4)  1, 2005, dated as of February 4, 2008 between JPMorgan Chase & Co. and the Agents party thereto  \n           (incorporated by reference to Exhibit 1(a)(4) to the Registration Statement on Form S-3 (File    \n           No. 333-155535) of JPMorgan Chase & Co.)                                                         \n           Amendment No. 1 to Master Agency Agreement dated as of November 21, 2008, to the Master Agency   \n  1(a)(5)  Agreement dated as of December 1, 2005 (as amended) between JPMorgan Chase & Co. and the Agents  \n           party thereto (incorporated by reference to Exhibit 1(a)(5) to the Registration Statement on     \n           Form S-3 (File No. 333-155535) of JPMorgan Chase & Co.)                                          \n           Amendment No. 2 to Master Agency Agreement dated as of November 14, 2011, to the Master Agency   \n  1(a)(6)  Agreement dated as of December 1, 2005 (as amended) between JPMorgan Chase & Co. and the Agents  \n           party thereto (incorporated by reference to Exhibit 1(a)(6) to the Registration Statement on     \n           Form S-3 (File No. 333-177923) of JPMorgan Chase & Co.)                                          \n           Master Agency Agreement dated as of April 18, 2016 among JPMorgan Chase Financial Company LLC,   \n  1(a)(7)  JPMorgan Chase & Co. and the Agents party thereto (incorporated by reference to Exhibit 1(a)(7)  \n           to Registration Statement on Form S-3 (File Nos. 333-222672 and 333-222672-01) of JPMorgan       \n           Chase & Co. and JPMorgan Financial Company LLC)                                                  \n           Indenture, dated as of May 25, 2001, between JPMorgan Chase & Co. and Deutsche Bank Trust        \n  4(a)(1)  Company Americas (formerly Bankers Trust Company), as trustee (incorporated by reference to      \n           Exhibit 4(a)(1) to Amendment No. 1 to the Registration Statement on Form S-3 (File No.           \n           333-52826) of JPMorgan Chase & Co.)                                                              \n           First Supplemental Indenture, dated as of April 9, 2008 to the Indenture dated as of May 25,     \n  4(a)(2)  2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly Bankers     \n           Trust Company), as trustee (incorporated by reference to Exhibit 4.1 to the Current Report on    \n           Form 8-K (File No. 001-05805) of JPMorgan Chase & Co. dated May 8, 2008)                         \n           Second Supplemental Indenture, dated as of November 14, 2011 to the Indenture dated as of May    \n  4(a)(3)  25, 2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly         \n           Bankers Trust Company), as trustee (incorporated by reference to Exhibit 4(a)(3) to the          \n           Registration Statement on Form S-3 (File No. 333-177923) of JPMorgan Chase & Co.)                \n                                                                                                            \n                                                    II-7                                                    \n                                                                                                            \n  Exhibit  Document Description                                                                             \n  Number                                                                                                    \n           Third Supplemental Indenture, dated as of September 24, 2014 to the Indenture dated as of May    \n  4(a)(4)  25, 2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly         \n           Bankers Trust Company), as trustee (incorporated by reference to Exhibit 4(a)(4) to the          \n           Registration Statement on Form S-3 (File No. 333-199966) of JPMorgan Chase & Co.)                \n           Fourth Supplemental Indenture, dated as of December 5, 2014 to the Indenture dated as of May     \n           25, 2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly         \n  4(a)(5)  Bankers Trust Company), as trustee (incorporated by reference to Exhibit 4(a)(5) to              \n           Post-Effective Amendment No. 1 to the Registration Statement on Form S-3 (File No. 333-199966)   \n           of JPMorgan Chase & Co.)                                                                         \n           Fifth Supplemental Indenture, dated as of December 30, 2014 to the Indenture dated as of May     \n           25, 2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly         \n  4(a)(6)  Bankers Trust Company), as trustee (incorporated by reference to Exhibit 4(a)(6) to              \n           Post-Effective Amendment No. 1 to the Registration Statement on Form S-3 (File No. 333-199966)   \n           of JPMorgan Chase & Co.)                                                                         \n           Sixth Supplemental Indenture, dated as of January 13, 2017 to the Indenture dated as of May 25,  \n  4(a)(7)  2001 between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas (formerly Bankers     \n           Trust Company), as trustee (incorporated by reference to Exhibit 4.3 to the Current Report on    \n           Form 8-K (File No. 001-05805) of JPMorgan Chase & Co. dated January 13, 2017)                    \n           Indenture, dated as of February 19, 2016, among JPMorgan Chase Financial Company LLC, JPMorgan   \n  4(a)(8)  Chase & Co. and Deutsche Bank Trust Company Americas, as trustee (incorporated by reference to   \n           Exhibit 4(a)(7) to the Registration Statement on Form S-3 (File Nos. 333-209682 and              \n           333-209682-01) of the Registrants)                                                               \n           Form of Warrant Indenture, among JPMorgan Chase Financial Company LLC, JPMorgan Chase & Co. and  \n  4(a)(9)  Deutsche Bank Trust Company Americas, as trustee (incorporated by reference to Exhibit 4(a)(8)   \n           to Pre-Effective Amendment No. 1 to the Registration Statement on Form S-3 (File Nos.            \n           333-209682 and 333-209682-01) of the Registrants)                                                \n  4(b)(1)  Form of Fixed Rate Note of JPMorgan Chase & Co. (incorporated by reference to Exhibit 4(b)(1)    \n           to the Registration Statement on Form S-3 (File No. 333-177923) of JPMorgan Chase & Co.)         \n           Form of Floating Rate Note of JPMorgan Chase & Co. (incorporated by reference to Exhibit         \n  4(b)(2)  4(b)(3) to the Registration Statement on Form S-3 (File No. 333-177923) of JPMorgan Chase &      \n           Co.)                                                                                             \n  4(b)(3)  Form of Note of JPMorgan Chase & Co. (incorporated by reference to Exhibit 4(b)(3) to the        \n           Registration Statement on Form S-3 (File No. 333-199966) of JPMorgan Chase & Co.)                \n           Non-U.S. Distribution Form of Note of JPMorgan Chase & Co. (incorporated by reference to         \n  4(b)(4)  Exhibit 4(b)(4) to the Registration Statement on Form S-3 (File No. 333-199966) of JPMorgan      \n           Chase & Co.)                                                                                     \n           Form of Note of JPMorgan Chase Financial Company LLC (incorporated by reference to Exhibit       \n  4(b)(5)  4(b)(5) to the Registration Statement on Form S-3 (File Nos. 333-209682 and 333-209682-01) of    \n           the Registrants)                                                                                 \n                                                                                                            \n                                                    II-8                                                    \n                                                                                                            \n  Exhibit  Document Description                                                                             \n  Number                                                                                                    \n           Non-U.S. Distribution Form of Note of JPMorgan Chase Financial Company LLC (incorporated by      \n  4(b)(6)  reference to Exhibit 4(b)(6) to the Registration Statement on Form S-3 (File Nos. 333-209682     \n           and 333-209682-01) of the Registrants)                                                           \n           Form of Master Note of JPMorgan Chase Financial Company LLC (incorporated by reference to        \n  4(b)(7)  Exhibit 4.1 to the Current Report on Form 8-K (File No. 001-05805) of JPMorgan Chase & Co.       \n           dated May 6, 2022)                                                                               \n  4(c)     Form of Debt Warrant Agreement (incorporated by reference to Exhibit 4(c) to Amendment No. 1 to  \n           the Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)             \n           Forms of Debt Warrant Certificates (included as Exhibits A and B to form of Debt Warrant         \n  4(d)     Agreement) (incorporated by reference to Exhibit 4(d) to Amendment No. 1 to the Registration     \n           Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)                              \n  4(e)     Form of Index Warrant Agreement (incorporated by reference to Exhibit 4(e) to Amendment No. 1    \n           to the Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)          \n           Forms of Index Warrant Certificates (included as Exhibits A and A-1 to form of Index Warrant     \n  4(f)     Agreement) (incorporated by reference to Exhibit 4(f) to Amendment No. 1 to the Registration     \n           Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)                              \n  4(g)     Form of Universal Warrant Agreement (incorporated by reference to Exhibit 4(k) to Amendment No.  \n           1 to the Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)        \n           Forms of Universal Warrant Certificates (included as Exhibits A and B to form of Universal       \n  4(h)     Warrant Agreement) (incorporated by reference to Exhibit 4(1) to Amendment No. 1 to the          \n           Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)                 \n           Form of Warrant of JPMorgan Chase Financial Company LLC (incorporated by reference to Exhibit    \n  4(i)(1)  4(m)(1) to the Registration Statement on Form S-3 (File Nos. 333-209682 and 333-209682-01) of    \n           the Registrants)                                                                                 \n           Non-U.S. Distribution Form of Warrant of JPMorgan Chase Financial Company LLC (incorporated by   \n  4(i)(2)  reference to Exhibit 4(m)(2) to the Registration Statement on Form S-3 (File Nos. 333-209682     \n           and 333-209682-01) of the Registrants)                                                           \n  4(j)     Form of Unit Agreement (incorporated by reference to Exhibit 4(m) to Amendment No. 1 to the      \n           Registration Statement on Form S-3 (File No. 333-52826) of JPMorgan Chase & Co.)                 \n           Form of Unit Certificate (included as Exhibit A to form of Unit Agreement) (incorporated by      \n  4(k)     reference to Exhibit 4(n) to Amendment No. 1 to the Registration Statement on Form S-3 (File     \n           No. 333-52826) of JPMorgan Chase & Co.)                                                          \n  4(l)+    Form of Purchase Contract                                                                        \n           Calculation Agent Agreement dated as of November 7, 2014 between JPMorgan Chase & Co. and J.P.   \n  4(m)(1)  Morgan Securities LLC (incorporated by reference to Exhibit 4(p)(1) to the Registration          \n           Statement on Form S-3 (File No. 333-199966) of JPMorgan Chase & Co.)                             \n                                                                                                            \n                                                    II-9                                                    \n                                                                                                            \n  Exhibit  Document Description                                                                             \n  Number                                                                                                    \n           Calculation Agent Agreement dated as of April 18, 2016 among JPMorgan Chase Financial Company    \n  4(m)(2)  LLC, JPMorgan Chase & Co. and J.P. Morgan Securities LLC (incorporated by reference to Exhibit   \n           4(q)(2) to Registration Statement on Form S-3 (File Nos. 333-222672 and 333-222672-01) of        \n           JPMorgan Chase & Co. and JPMorgan Financial Company LLC)                                         \n           Paying Agent, Registrar & Transfer Agent and Authenticating Agent Agreement dated as of October  \n  4(n)(1)  2, 2006 between JPMorgan Chase & Co., Deutsche Bank Trust Company Americas and The Bank of New   \n           York Mellon (formerly, The Bank of New York) (incorporated by reference to Exhibit 4(q)(1) to    \n           the Registration Statement on Form S-3 (File No. 333-155535) of JPMorgan Chase & Co.)            \n           Paying Agent, Registrar & Transfer Agent and Authenticating Agent Agreement for Notes dated as   \n           of April 18, 2016 among JPMorgan Chase Financial Company LLC, JPMorgan Chase & Co., Deutsche     \n  4(n)(2)  Bank Trust Company Americas and The Bank of New York Mellon (incorporated by reference to        \n           Exhibit 4(r)(2) to Registration Statement on Form S-3 (File Nos. 333-222672 and 333-222672-01)   \n           of JPMorgan Chase & Co. and JPMorgan Financial Company LLC)                                      \n           Form of Paying Agent, Registrar & Transfer Agent and Authenticating Agent Agreement for          \n           Warrants among JPMorgan Chase Financial Company LLC, JPMorgan Chase & Co., Deutsche Bank Trust   \n  4(n)(3)  Company Americas and The Bank of New York Mellon (incorporated by reference to Exhibit 4(r)(3)   \n           to Pre-Effective Amendment No. 1 to the Registration Statement on Form S-3 (File Nos.            \n           333-209682 and 333-209682-01) of the Registrants)                                                \n  5.1*     Opinion of Simpson Thacher & Bartlett LLP                                                        \n  5.2*     Opinion of Davis Polk & Wardwell LLP, special products counsel to JPMorgan Chase Financial       \n           Company LLC and JPMorgan Chase & Co.                                                             \n  5.3*     Opinion of Sidley Austin llp, counsel to JPMorgan Chase Financial Company LLC and JPMorgan       \n           Chase & Co.                                                                                      \n  5.4*     Opinion of Latham & Watkins LLP, special product counsel to JPMorgan Chase Financial Company     \n           LLC and JPMorgan Chase & Co.                                                                     \n  23.1*    Consent of PricewaterhouseCoopers LLP                                                            \n  23.2*    Consent of Simpson Thacher & Bartlett LLP (included in Exhibit 5.1)                              \n  23.3*    Consent of Davis Polk & Wardwell LLP, special products counsel to JPMorgan Chase & Co. and       \n           JPMorgan Chase Financial Company LLC (included in Exhibit 5.2)                                   \n  23.4*    Consent of Sidley Austin llp, counsel to JPMorgan Chase Financial Company LLC and JPMorgan       \n           Chase & Co. (included in Exhibit 5.3)                                                            \n  23.5*    Consent of Latham & Watkins LLP, special product counsel to JPMorgan Chase & Co. and JPMorgan    \n           Chase Financial Company LLC and JPMorgan Chase & Co. (included in Exhibit 5.4)                   \n  23.6*    Consent of Davis Polk & Wardwell LLP, special tax counsel to JPMorgan Chase Financial Company    \n           LLC and JPMorgan Chase & Co.                                                                     \n  23.7*    Consent of Sidley Austin llp, special tax counsel to JPMorgan Chase Financial Company LLC and    \n           JPMorgan Chase & Co.                                                                             \n                                                                                                            \n                                                   II-10                                                    \n                                                                                                            \n  Exhibit  Document Description                                                                             \n  Number                                                                                                    \n  23.8*    Consent of Latham & Watkins LLP, special tax counsel to JPMorgan Chase Financial Company LLC     \n           and JPMorgan Chase & Co.                                                                         \n           Powers of Attorney of Linda B. Bammann, Stephen B. Burke, Todd A. Combs, James S. Crown, James   \n  24.1*    Dimon, Timothy P. Flynn, Alex Gorsky, Mellody Hobson, Michael A. Neal, Phebe N. Novakovic,       \n           Virginia M. Rometty, Jeremy Barnum and Elena Korablina                                           \n  24.2*    Powers of Attorney of Patrick Dempsey, Michael O. Kurd, Brandon P. Igyarto, Daniel T. Roose and  \n           Bin Yu (included on signature page to the Registration Statement)                                \n           Form T-1 Statement of Eligibility and Qualifications under the Trust Indenture Act of 1939 of    \n  25.1*    Deutsche Bank Trust Company Americas as trustee under the Indenture dated as of May 25, 2001,    \n           between JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas, as Trustee                \n           Form T-1 Statement of Eligibility and Qualifications under the Trust Indenture Act of 1939 of    \n           Deutsche Bank Trust Company Americas as trustee under the Indenture dated as of February 19,     \n  25.2*    2016 among JPMorgan Chase Financial Company LLC, JPMorgan Chase & Co. and Deutsche Bank Trust    \n           Company Americas, as Trustee, and under the Warrant Indenture among JPMorgan Chase Financial     \n           Company LLC, JPMorgan Chase & Co. and Deutsche Bank Trust Company Americas, as Trustee           \n  107*     Filing Fee Table                                                                                 \n                                                                                                            \n                     \n  *  Filed herewith  \n                     \n                                                                  \n  +  To be filed by amendment or under subsequent Current Report  \n     on Form 8-K                                                  \n                                                                  \n                                                   II-11                                                    \n                                                                                                            \n                                                 SIGNATURES                                                 \nPursuant to the requirements of the Securities\nAct of 1933, as amended, the Registrant named below certifies that it has reasonable grounds to believe that\nit meets all of the requirements\nfor filing on Form S-3 and has duly caused this Registration Statement to be signed on its behalf by the\nundersigned, thereunto duly authorized,\nin the City of New York, State of New York, on February 24, 2023.\n                                                            \n       JPMORGAN CHASE & CO.                                 \n       (Registrant)                                         \n  By:                        /s/ Stephen B. Grant           \n       Name:                 Stephen B. Grant               \n       Title:                Assistant Corporate Secretary  \n                                                            \n                                                   II-12                                                    \nPursuant to the requirements of the Securities\nAct of 1933, as amended, this Registration Statement has been signed by the following persons in the\ncapacities and on the date indicated.\n                                 OFFICERS AND DIRECTORS OF JPMORGAN CHASE &                                 \n                                                    CO.                                                     \n                                                                                                            \n                       TITLE                                                                                \n  SIGNATURE            Director, Chairman of the Board and Chief Executive Officer       DATE               \n  *                    (Principal Executive Officer)                                     February 24, 2023  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n  James Dimon                                                                                               \n  *                    Director                                                          February 24, 2023  \n  Linda B. Bammann                                                                                          \n  *                    Director                                                          February 24, 2023  \n  Stephen B. Burke                                                                                          \n  *                    Director                                                          February 24, 2023  \n  Todd A. Combs                                                                                             \n  *                    Director                                                          February 24, 2023  \n  James S. Crown                                                                                            \n  *                    Director                                                          February 24, 2023  \n  Timothy P. Flynn                                                                                          \n  *                    Director                                                          February 24, 2023  \n  Alex Gorsky                                                                                               \n  *                    Director                                                          February 24, 2023  \n  Mellody Hobson                                                                                            \n  *                    Director                                                          February 24, 2023  \n  Michael A. Neal                                                                                           \n  *                    Director                                                          February 24, 2023  \n  Phebe N. Novakovic                                                                                        \n  *                    Director                                                          February 24, 2023  \n  Virginia M. Rometty                                                                                       \n  *                    Executive Vice President and Chief Financial Officer (Principal   February 24, 2023  \n                       Financial Officer)                                                                   \n  Jeremy Barnum                                                                                             \n  *                    Managing Director and Firmwide Controller (Principal Accounting   February 24, 2023  \n                       Officer)                                                                             \n  Elena Korablina                                                                                           \n                                                                                                            \n                                                                                                            \n     Stephen B. Grant hereby signs this Registration Statement on behalf of                                 \n     each of the indicated persons for whom he is attorney-in-fact on February 24, 2023 pursuant to a       \n     power of attorney filed as an exhibit                                                                  \n  *  to this registration statement.                                                                        \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                            \n                             \n  By:  /s/ Stephen B. Grant  \n       Stephen B. Grant      \n                             \n                                                   II-13                                                    \nPursuant to the requirements of the Securities\nAct of 1933, as amended, the Registrant named below certifies that it has reasonable grounds to believe that\nit meets all of the requirements\nfor filing on Form S-3 and has duly caused this Registration Statement to be signed on its behalf by the\nundersigned, thereunto duly authorized,\nin the City of New York, State of New York, on February 24, 2023.\n                                                                            \n       JPMORGAN CHASE FINANCIAL COMPANY LLC                                 \n       (Registrant)                                                         \n  By:                                        /s/ Patrick Dempsey            \n       Name:                                 Patrick Dempsey                \n       Title:                                Treasurer & Managing Director  \n                                                                            \n                                                   II-14                                                    \nKNOW ALL MEN BY THESE PRESENTS, that each person\nwhose signature appears below constitutes and appoints BRANDON P. IGYARTO and PATRICK DEMPSEY, and each of\nthem, his or her true and lawful\nattorneys-in-fact and agents, with full power to act separately and full power of substitution and\nresubstitution, for him or her and\nin his or her name, place and stead, in any and all capacities, to sign any and all amendments (including\npost-effective amendments) to\nthis registration statement and any and all additional registration statements pursuant to Rule 462(b) of\nthe Securities Act of 1933,\nas amended, and to file the same, with all exhibits thereto, and all other documents in connection\ntherewith, with the Securities and\nExchange Commission, granting unto each said attorney-in-fact and agent full power and authority to do and\nperform each and every act\nin person, hereby ratifying and confirming all that said attorneys-in-fact and agents or either of them or\nhis or her or their substitute\nor substitutes may lawfully do or cause to be done by virtue hereof.\n\nPursuant to the requirements of the Securities\nAct of 1933, as amended, this Registration Statement has been signed by the following persons in the\ncapacities and on the date indicated.\n                             OFFICERS AND MANAGERS OF JPMORGAN CHASE FINANCIAL                              \n                                                COMPANY LLC                                                 \n                                                                                                            \n                       TITLE                                                                                \n  SIGNATURE            Treasurer (Principal Financial Officer and Principal Accounting   DATE               \n  /s/ Patrick Dempsey  Officer) and Manager                                              February 24, 2023  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n  Patrick Dempsey                                                                                           \n  /s/ Michael O.       Manager                                                           February 24, 2023  \n  Kurd                                                                                                      \n  Michael O. Kurd                                                                                           \n  /s/ Brandon P.       President (Principal Executive Officer) and Manager               February 24, 2023  \n  Igyarto                                                                                                   \n  Brandon P. Igyarto                                                                                        \n  /s/ Daniel T.        Manager                                                           February 24, 2023  \n  Roose                                                                                                     \n  Daniel T. Roose                                                                                           \n  /s/ Bin Yu           Manager                                                           February 24, 2023  \n  Bin Yu                                                                                                    \n                                                                                                            \n                                                   II-15                                                    \n"
}