{
  "title": "CIBC becomes the first major Canadian bank to sign the federal generative AI code of conduct",
  "url": "https://cibc.mediaroom.com/2025-03-25-CIBC-becomes-the-first-major-Canadian-bank-to-sign-the-federal-generative-AI-code-of-conduct",
  "date": "2025-03-25T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nMarch 25, 2025\n/CNW/ - CIBC has reinforced its commitment to responsible AI by becoming the first major Canadian bank to sign the Government of\nCanada's\nVoluntary Code of Conduct on the Responsible Development and Management of Advanced Generative AI Systems\n. This initiative highlights CIBC's dedication to fostering ethical AI practices and promoting responsible innovation within the financial sector.\n\"At CIBC, we understand the significant impact that artificial intelligence can have on our industry and society,\" said\nDave Gillespie\n, Executive Vice-President, Infrastructure, Architecture and Modernization, CIBC. \"By adhering to this voluntary code of conduct, we are reinforcing our commitment to responsible AI development and deployment, ensuring that our AI systems are fair, transparent, and accountable.\"\nThe voluntary generative AI code of conduct sets out key principles for the responsible use of AI technologies, including:\nAccountability: Establishing robust governance frameworks for AI oversight;\nFairness: Ensuring that AI systems are designed and implemented with the risk of biased outputs mitigated prior to release;\nTransparency: Providing clear and accessible information about AI systems and their impacts;\nPrivacy: Protecting client data and maintaining compliance with privacy regulations.\nAs set out in the\n2024 Sustainability Report\n, our AI governance foundation is built on our Trustworthy AI Principles, enforced through the CIBC Enterprise AI Framework, and supported by our robust AI Risk Assessment Process (AIRAP). In addition, we have AI governance committees consisting of Senior Executives as well as risk stakeholders across the bank. Our approach ensures that we leverage AI with thoughtfully designed guardrails to support innovation. In 2024, CIBC introduced several GenAI pilot programs, including its CIBC AI platform, its Knowledge Central information hub, and GitHub CoPilot, to enhance productivity and client service.\n\"Our participation in this initiative is a testament to our ongoing commitment to innovation and accelerating our AI adoption responsibly, to better support our clients and communities,\" added Gillespie. \"We believe that responsible AI practices are essential for building trust and delivering sustainable value.\"\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nhttps://www.cibc.com/en/about-cibc/media-centre.html\n.\nSOURCE  CIBC",
  "id": "2025-03-25-CIBC-becomes-the-first-major-Canadian-bank-to-sign-the-federal-generative-AI-code-of-conduct",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}