{
  "title": "CIBC to Issue Aggregate $600 million of NVCC AT1 Limited Recourse Capital Notes & Institutional NVCC Preferred Shares",
  "url": "https://cibc.mediaroom.com/2025-03-17-CIBC-to-Issue-Aggregate-600-million-of-NVCC-AT1-Limited-Recourse-Capital-Notes-Institutional-NVCC-Preferred-Shares",
  "date": "2025-03-17T00:00:00",
  "short_description": "",
  "content": "/NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN\nTHE UNITED STATES\n/\nThe prospectus supplements, the corresponding base shelf prospectus and any amendment thereto in connection with these offerings will be accessible through SEDAR+ within two business days.\nTORONTO\n,\nMarch 17, 2025\n/CNW/ - CIBC (TSX: CM) (NYSE: CM) today announced a domestic public offering of\n$450 million\nof 6.369% Limited Recourse Capital Notes Series 6 (Non-Viability Contingent Capital (\"\nNVCC\n\")) (Subordinated Indebtedness) (the \"\nLRCNs\n\") and a domestic public offering of\n$150 million\nNon-Cumulative 5-Year Fixed Rate Reset Class A Preferred Shares Series 61 (NVCC) (the \"\nSeries 61 Shares\n\", and collectively with the LRCNs, the \"\nSecurities\n\"). The Securities will be sold to certain institutional investors through a dealer syndicate led by CIBC Capital Markets.\nThe LRCNs will be issued at a price of\n$1,000\nper note and will bear interest at a rate of 6.369% annually, payable semi-annually, for the initial period ending on, but excluding,\nApril 28, 2030\n. Thereafter, the interest rate on the LRCNs will reset every five years at a rate equal to the prevailing 5-year Government of Canada Yield plus 3.65%. The LRCNs will mature on\nApril 28\n, 2085.\nIn connection with the issuance of the LRCNs, CIBC will issue Non-Cumulative 5-Year Fixed Rate Reset Class A Preferred Shares Series 60 (NVCC) (the \"\nSeries 60 Shares\n\") to be held by Computershare Trust Company of\nCanada\nas trustee of CIBC LRCN Limited Recourse Trust (the \"\nLimited Recourse Trust\n\"). In case of non-payment of interest on or principal of the LRCNs when due, the recourse of each LRCN holder will be limited to that holder's proportionate share of the Limited Recourse Trust's assets held in respect of the LRCNs, which will consist of Series 60 Shares except in limited circumstances.\nThe Series 61 Shares will be issued at a price of\n$1,000\nper share and will pay dividends at a rate of 6.369% annually, payable semi-annually, as and when declared by the Board of Directors of CIBC, for the initial period ending on, but excluding,\nApril 28, 2030\n. Thereafter, the dividend rate on the Series 61 Shares will reset every five years at a rate equal to the prevailing 5-year Government of Canada Yield plus\n3.65%\n.\nCIBC may redeem the Securities during the period from\nMarch 28\nto and including\nApril 28\n, commencing on\nMarch 28, 2030\nand every five years thereafter with the prior written approval of the Superintendent of Financial Institutions (\nCanada\n), in whole or in part on not less than 10 days' nor more than 60 days' prior notice.\nThe net proceeds to CIBC from the sale of the Securities will be used for general corporate purposes, which may include the redemption of outstanding capital securities of CIBC, and/or the repayment of other outstanding liabilities of CIBC.\nThe expected closing date of the offerings is\nMarch 24, 2025\n. The closing of the offerings are not conditional on each other.\nThe Securities will each be offered by way of a prospectus supplement to the bank's short form base shelf prospectus dated\nSeptember 20, 2024\n, to be filed on or about\nMarch 18, 2025\nwith the securities commissions and other similar regulatory authorities in each of the provinces and territories of\nCanada\n.\nAccess to the prospectus supplements, the corresponding base shelf prospectus and any amendment thereto in connection with these offerings is provided in accordance with securities legislation relating to procedures for providing access to a shelf prospectus supplement, a base shelf prospectus and any amendment thereto. The prospectus supplements, the base shelf prospectus and any amendment thereto in connection with these offerings will be accessible within two business days at\nwww.sedarplus.com\n.\nAn electronic or paper copy of the shelf prospectus supplements, the corresponding base shelf prospectus and any amendment to the documents may be obtained, without charge, from CIBC World Markets Inc., by contacting 416-594-8515 or email at\nMailbox.CIBCDebtSyndication@cibc.com\n, by providing the contact with an email address or address, as applicable.\nThe Securities have not been, and will not be, registered in\nthe United States\nunder the United States Securities Act of 1933, as amended (the \"\nSecurities Act\n\"), or the securities laws of any state of\nthe United States\nand may not be offered, sold or delivered, directly or indirectly in\nthe United States\nor to, or for the account or benefit of, a \"U.S. person\" (as defined in Regulation S under the Securities Act) absent registration under the Securities Act or an applicable exemption from the registration requirements. This press release shall not constitute an offer to sell or an invitation to purchase or subscribe for any securities in\nthe United States\nor in any other jurisdiction where such offer is unlawful.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across\nCanada\n, in\nthe United States\nand around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\n.\nSOURCE CIBC - Investor Relations",
  "id": "2025-03-17-CIBC-to-Issue-Aggregate-600-million-of-NVCC-AT1-Limited-Recourse-Capital-Notes-Institutional-NVCC-Preferred-Shares",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}