{
  "title": "From common ground to making progress with purpose, the inaugural CIBC Ambitions Index explores the heart of Canadian ambitions",
  "url": "https://cibc.mediaroom.com/2025-03-26-From-common-ground-to-making-progress-with-purpose,-the-inaugural-CIBC-Ambitions-Index-explores-the-heart-of-Canadian-ambitions",
  "date": "2025-03-26T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nMarch 26, 2025\n/CNW/ - Today, CIBC launched its first annual CIBC Ambitions Index, an in-depth report exploring Canadians' current goals and ambitions – big or small – across all areas of life.\n\"At CIBC, we believe that understanding the ambitions of Canadians is essential to fulfilling our purpose of helping make ambitions real,\" said\nStephen Forbes\n, Executive Vice-President, Purpose, Brand and Corporate Affairs, CIBC. \"The CIBC Ambitions Index not only sheds light on the goals that matter most to Canadians across ages and geographies, but also reinforces our commitment to supporting them on their journeys towards achieving those ambitions.\"\nAnnually, the CIBC Ambitions Index will track the goals and ambitions of Canadians, the progress they've made, and what's holding them back. The index builds a clear view of what matters most to Canadians and where their efforts are focused at different stages in life. While money and finances play a role in achieving ambition, this report explores all aspects of Canadians' ambitions, including health and wellness, personal relationships, travel and leisure, pursuing a passion, education and learning, career development, social impact and environmental sustainability.\nIn recent years, Canadians have been navigating through ongoing economic and geopolitical instability. Despite continued uncertainty, however, as we arrive at the quarter century Canadians have some positive reflections on their ambitions and their efforts to achieve them. In fact, 78% of Canadians say their ambitions have gained importance in light of current economic challenges.\nKey takeaways from the inaugural report include:\nCommon ground\n:\nFrom coast to coast and across generations,\nCanadians have many common ambitions\n– with goals in the areas of health and wellness (\n57%\n), financial stability and growth (\n54%\n), and personal relationships with family and friends (\n49%\n) topping the list nationally. This demonstrates a balanced approach of blending practical ambitions with those more personal and meaningful.\nProgress with purpose\n:\nDespite uncertainties, Canadians are making headway.\n68% made progress towards their ambition in the last year\nand three in four Canadians are happy with the progress they've made. But the quest for quicker results is palpable as\n58%\nare only somewhat satisfied with the progress they've made.\n61%\nare optimistic about unlocking more achievements next year.\nCanadians' view of wellness is evolving:\nCanadians are\nprioritizing their personal well-being\nand work-life balance over a commitment to career advancement.\n91%\nof Canadians state that a balanced work-life lifestyle is essential to happiness, while fewer than half (\n49%)\nexpress a commitment to career advancement.\n91%\nalso say maintaining a healthy lifestyle is crucial to their overall wellbeing, and\n85%\nprioritize their physical health and regularly engage in fitness activities.\nCelebrate your success\n:\nThose who plan, review and celebrate their journey are more likely to advance their ambitions, yet many aren't doing this.\nAt least quarterly\n, only\n35%\nof Canadians set goals,\n40%\nreview their progress, and only\n29%\ncelebrate their milestones.\nThe inaugural CIBC Ambitions Index serves as a vital resource for understanding Canadian ambitions. This report not only highlights the common threads that unite us but also illustrates the unique differences. In future years, it will help reveal the evolving landscape and key trends that define our ambitions. As CIBC continues to support Canadians in their pursuit of their goals, we remain committed to providing the tools, resources, and guidance necessary to help individuals navigate their journeys.\nThe full CIBC Ambitions Index can be found at\nthoughtleadership.cibc.com/ambitionsindex\nDisclaimer\nThe findings are from an Ipsos poll conducted\nbetween October 10 and 17, 2024\n, on behalf of CIBC. For this survey, a sample of 2,500 Canadians aged 18+ were interviewed. Sample was sourced from the Ipsos panel. Weighting was employed to balance demographics to ensure that the sample's composition reflects that of the adult population according to Census data and to provide results intended to approximate the sample universe. The precision of Ipsos polls is measured using a credibility interval. In this case, the poll is accurate to within ±2.4 percentage points, 19 times out of 20, had all Canadians been polled. The credibility interval will be wider among subsets of the population.\nNote: Ipsos conducted a validation poll in\nFebruary 2025\nfor CIBC to verify the original study's findings amid recent economic and geopolitical shifts. The survey interviewed 1,000 Canadian adults (18+) between\nFebruary 13-18, 2025\n, using a sample from the Ipsos panel. Demographic weighting was applied to ensure the sample accurately represents the adult population as per Census data.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\nSOURCE  CIBC",
  "id": "2025-03-26-From-common-ground-to-making-progress-with-purpose,-the-inaugural-CIBC-Ambitions-Index-explores-the-heart-of-Canadian-ambitions",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}