{
  "title": "Media Advisory - CIBC to Announce Second Quarter 2025 Results on May 29, 2025",
  "url": "https://cibc.mediaroom.com/2025-05-08-Media-Advisory-CIBC-to-Announce-Second-Quarter-2025-Results-on-May-29,-2025",
  "date": "2025-05-08T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nMay 8, 2025\n/CNW/ -\nCIBC\n(TSX: CM) (NYSE: CM) will be announcing its 2025 second quarter results for the quarter ended\nApril 30, 2025\n, on\nThursday, May 29, 2025\n. The results are expected to be released at approximately\n5:30 a.m. (ET)\n, followed by a live audio webcast and teleconference call with analysts, investors and media at\n7:30 a.m. (ET)\n.\nEarnings Conference Call/Webcast\nEnglish 416-340-2217, or toll-free 1-800-806-5484, passcode 1073773#\nFrench 514-392-1587, or toll-free 1-800-898-3989, passcode 5601311#\nParticipants are asked to dial in 10 minutes before the call. Immediately following the formal presentations, CIBC executives will be available to answer questions.\nA live audio webcast of the conference call will also be available in English and French at\nhttps://www.cibc.com/ca/investor-relations/quarterly-results.html\n.\nFinancial Results and Investor Presentation\nDetails of CIBC's 2025 second quarter results, as well as a presentation to investors, will be available in English and French at\nwww.cibc.com\n, Investor Relations section, prior to the conference call/webcast.\nEarnings Conference Call Replay and Archived Webcast\nA telephone replay will be available until\n11:59 p.m. (ET)\nJune 12, 2025\n.\nEnglish 905-694-9451 or 1-800-408-3053, passcode 7808652#\nFrench 514-861-2272 or 1-800-408-3053, passcode 4825374#\nThe audio webcast will be archived at\nhttps://www.cibc.com/ca/investor-relations/quarterly-results.html\n.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets businesses, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada with offices in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nhttps://cibc.mediaroom.com/\n.\nSOURCE  CIBC - Investor Relations",
  "id": "2025-05-08-Media-Advisory-CIBC-to-Announce-Second-Quarter-2025-Results-on-May-29,-2025",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 2,
  "month": 5,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}