{
  "title": "CIBC Named One of Canada's Greenest Employers for Fourth Consecutive Year",
  "url": "https://cibc.mediaroom.com/2025-04-22-CIBC-Named-One-of-Canadas-Greenest-Employers-for-Fourth-Consecutive-Year",
  "date": "2025-04-22T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nApril 22, 2025\n/CNW/ - CIBC has been recognized as one of\nCanada's\nGreenest Employers by MediaCorp Canada Inc. for the fourth consecutive year. This award highlights organizations that demonstrate leadership in reducing environmental impact, integrating responsible business practices, supporting clients in their transition to a low carbon economy, and engaging employees in environmental initiatives.\n\"This award reflects our ongoing efforts in supporting sustainable initiatives that contribute to positive change for our team, clients, and communities,\" said\nKikelomo Lawal\n, Executive Vice-President, Chief Legal Officer and Chair of the Senior Executive ESG Council, CIBC. \"We are honoured to receive this recognition and guided by our purpose, remain focused on enabling a more prosperous future.\"\nCIBC's key investments towards sustainability include:\nHosting the inaugural CIBC Electrification Summit and the second annual CIBC Carbon Summit to facilitate critical discussions with stakeholders about the energy transition.\nAs of 2024, we have achieved a cumulative reduction of 31.4% in absolute Scope 1 and 2 operational GHG emissions against our target of 30% by 2028 for our operations in\nCanada\nand US.\n1\nMobilizing\n$42.5 billion\nin 2024 to achieve cumulative progress of\n$199.8 billion\ntoward our goal of\n$300 billion\nin sustainable finance by 2030 to help clients achieve their green, social, and decarbonization objectives.\n2\nRecognized by Global Finance's Sustainable Finance Awards in 2025 for Best Sustainable Finance Bank in\nCanada\n, Best Bank for Green Bonds in\nNorth America\n, and Best Bank for Sustaining Communities in North America.\nFor more information about CIBC's commitment to sustainability,\nvisit our website\n.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets businesses, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across\nCanada\n, in\nthe United States\nand around the world. Ongoing news releases and more information about CIBC can be found at\nhttps://www.cibc.com/en/about-cibc/media-centre.html\n.\n_____________________\n1\nAll Scope 1 and 2 emissions are calculated and disclosed using the following reporting standard: World Resources Institute (WRI)/World Business Council for Sustainable Development (WBCSD), The Greenhouse Gas Protocol: A Corporate Accounting and Reporting Standard (Revised Edition)\nMarch 2004\n. The reduction in absolute Scope 1 and 2emissions (location-based) is before the application of Renewable Energy Certificates (RECs). The 2024 reporting period for Scope 1 and 2 emissions is from\nAugust 1, 2023\n–\nJuly 31, 2024\n.\n2\nRefer to CIBC's\nSustainable Finance Methodology\nfor details on eligible green, decarbonization, and social activities and corresponding eligibility criteria, business products, and measurement methodology used for the classification of a transaction as sustainable finance.\nSOURCE  CIBC",
  "id": "2025-04-22-CIBC-Named-One-of-Canadas-Greenest-Employers-for-Fourth-Consecutive-Year",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 2,
  "month": 4,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}