{
  "title": "CIBC Asset Management announces CIBC ETF cash distributions for April 2025",
  "url": "https://cibc.mediaroom.com/2025-04-24-CIBC-Asset-Management-announces-CIBC-ETF-cash-distributions-for-April-2025",
  "date": "2025-04-24T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nApril 24, 2025\n/CNW/ -\nCIBC\n(TSX: CM) (NYSE: CM) – CIBC Asset Management Inc. today announced the\nApril 2025\ncash distributions for CIBC ETFs and ETF Series of the CIBC Fixed Income Pools, which distribute monthly.\nUnitholders of record on\nApril 30, 2025\n, will receive cash distributions payable on\nMay 5, 2025\n. Details of the final \"per unit\" distribution amounts are as follows:\nCIBC ETF\nTicker Symbols\nExchange\nCash Distribution Per Unit ($)\nCIBC Active Investment Grade Corporate Bond ETF\nCACB\nTSX\n$0.072\nCIBC Active Investment Grade Floating Rate Bond ETF\nCAFR\nTSX\n$0.057\nCIBC Flexible Yield ETF (CAD-Hedged)\nCFLX\nTSX\n$0.078\nCIBC Conservative Fixed Income Pool ETF\nCCNS\nTSX\n$0.066\nCIBC Core Fixed Income Pool ETF\nCCRE\nTSX\n$0.069\nCIBC Core Plus Fixed Income Pool\nCPLS\nTSX\n$0.080\nCIBC Canadian Bond Index ETF\nCCBI\nTSX\n$0.046\nCIBC Canadian Short Term Bond Index ETF\nCSBI\nTSX\n$0.047\nCIBC Global Bond ex-Canada Index ETF (CAD-Hedged)\nCGBI\nTSX\n$0.039\nCIBC Sustainable Canadian Core Plus Bond Fund\nCSCP\nCBOE\n$0.053\nCIBC Qx Canadian Low Volatility Dividend ETF\nCQLC\nCBOE\n$0.060\nCIBC Qx U.S. Low Volatility Dividend ETF\nCQLU\nCBOE\n$0.033\nCIBC Qx International Low Volatility Dividend ETF\nCQLI\nCBOE\n$0.045\nCIBC 2025 Investment Grade Bond Fund — ETF Series\nCTBA\nCBOE\n$0.030\nCIBC 2026 Investment Grade Bond Fund — ETF Series\nCTBB\nCBOE\n$0.028\nCIBC 2027 Investment Grade Bond Fund — ETF Series\nCTBC\nCBOE\n$0.036\nCIBC 2028 Investment Grade Bond Fund — ETF Series\nCTBD\nCBOE\n$0.034\nCIBC 2029 Investment Grade Bond Fund — ETF Series\nCTBE\nCBOE\n$0.045\nCIBC 2030 Investment Grade Bond Fund — ETF Series\nCTBF\nCBOE\n$0.039\nCIBC 2025 U.S. Investment Grade Bond Fund — ETF Series (USD)*\nCTUC.U\nCBOE\n$0.022\nCIBC 2026 U.S. Investment Grade Bond Fund — ETF Series (USD)*\nCTUD.U\nCBOE\n$0.027\nCIBC 2027 U.S. Investment Grade Bond Fund — ETF Series (USD)*\nCTUE.U\nCBOE\n$0.032\n* Cash distribution per unit ($) amounts are USD for CTUC.U, CTUD.U, and CTUE.U\nCIBC ETFs are managed by CIBC Asset Management Inc., a subsidiary of Canadian Imperial Bank of Commerce. Commissions, management fees and expenses all may be associated with investments in exchange traded funds (ETFs). Please read the CIBC ETFs prospectus or ETF Facts document before investing. To obtain a copy, call 1-888-888-3863, ask your advisor or visit\nwww.cibc.com/etfs\n. ETFs are not guaranteed, their values change frequently, and past performance may not be repeated. CIBC ETFs are offered by registered dealers.\nMorningstar® Canada Core Bond Index™,\nMorningstar Canada\n1-5 Year Core Bond Index and Morningstar® Global ex-Canada Core Bond Hedged CAD Index™, are trademarks or service marks of Morningstar, Inc., and have been licensed for use for certain purposes by CIBC Asset Management. CIBC Canadian Bond Index ETF, CIBC Canadian Short-Term Bond Index ETF and CIBC Global Bond ex-Canada Index ETF (CAD Hedged), are not sponsored, endorsed, sold or promoted by Morningstar, and Morningstar makes no representation regarding the advisability of investing in the CIBC Canadian Bond Index ETF, CIBC Canadian Short-Term Bond Index ETF and CIBC Global Bond ex-Canada Index ETF (CAD-Hedged).\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in\nthe United States\nand around the world. Ongoing news releases and more information about CIBC can be found at\nhttps://www.cibc.com/en/about-cibc/media-centre.html\nAbout CIBC Asset Management\nCIBC Asset Management Inc. (CAM), the asset management subsidiary of CIBC, provides a range of high-quality investment management services and solutions to retail and institutional investors. CAM's offerings include: a comprehensive platform of mutual funds, strategic managed portfolio solutions, discretionary investment management services for high-net-worth individuals, and institutional portfolio management. CAM is one of Canada's largest asset management firms, with over\n$227 billion\nin assets under administration as of\nMarch 2025\n.\nSOURCE  CIBC",
  "id": "2025-04-24-CIBC-Asset-Management-announces-CIBC-ETF-cash-distributions-for-April-2025",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 2,
  "month": 4,
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}