{
  "title": "CIBC launches CIBC Adapta™ Mastercard®, a credit card that automatically adapts to spending behaviour, rewarding cardholders more for everyday purchases",
  "url": "https://cibc.mediaroom.com/2025-05-01-CIBC-launches-CIBC-Adapta-TM-Mastercard-R-,-the-first-credit-card-in-Canada-that-automatically-adapts-to-spending-behaviour,-rewarding-cardholders-more-for-everyday-purchases",
  "date": "2025-05-01T00:00:00",
  "short_description": "",
  "content": "Also the first card in\nCanada\nto include Touch Card by Mastercard\nTM\n– an accessible design that helps cardholders easily identify their credit card\nTORONTO, May 1, 2025 – CIBC announced today its innovative new, no annual fee CIBC Adapta Mastercard, a credit card that automatically determines the cardholder’s top three spend categories each month based on where they spend the most, and rewards them with 50% more points on those categories.\nOffering a flexible rewards system, CIBC Adapta Mastercard cardholders will earn 1.5 points for every $1 spent in their top three of 12 dynamic spend categories, and 1 point for every $1 spent on all other purchases each month.\n“Our new CIBC Adapta Mastercard is a differentiator in the market as it delivers true flexibility to cardholders, putting control in their hands to help them realize their ambitions,” said Diane Ferri, Senior Vice-President, Day-to-Day Banking, CIBC. “Adapta is a unique no annual fee card, offering flexibility to earn points on all purchases. It’s the only credit card where cardholders earn bonus points on their personal top three spend categories each month, whether it be pet stores, clothing or important everyday essentials like groceries and gas.”\nThe key benefits of the CIBC Adapta Mastercard include:\nA credit card  that\nadapts to cardholders’ spending behaviour\nputting them in control of the categories where they will be rewarded the most.\nA\nflexible rewards approach\nwhere the top three spend categories are automatically determined each month and can change based on a cardholder’s spending choices. For example, if a cardholder is spending the most on entertainment, hotels and dining one month, and gas, groceries and home improvement next month, they’ll always earn 50% more Adapta Points in their top three spend categories.\nTouch Card featuring a unique notch which enables people who are blind or have low vision to distinguish their payment cards from one another using touch.\nA cutting-edge design with vertical orientation, a vibrant red centre, and made using recycled plastic.\nRoadside assistance, offered by Dominion Automobile Association.\nPurchase Security and Extended Warranty Insurance.\n\"We’re proud to partner with CIBC on the new CIBC Adapta Mastercard credit card, featuring Mastercard’s Touch Card design for enhanced accessibility to ensure all Canadians can navigate payments with ease and confidence,” said Diane Miquelon, Senior Vice President, Financial Institutions, Mastercard, Canada. “Combining Adapta’s personalized experience with accessibility, this innovative offering empowers Canadians in every transaction.\"\nFor more information about the CIBC Adapta Mastercard, please visit cibc.com/adapta\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\nFor further information: Katarina Milicevic, katarina.milicevic@cibc.com or 416-362-3458\nAbout Mastercard\nMastercard powers economies and empowers people in 200+ countries and territories worldwide. Together with our customers, we’re building a resilient economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest potential.\nwww.mastercard.com\nFor more information: Helena Wade,\nhelena.wade@mastercard.com\nSOURCE CIBC",
  "id": "2025-05-01-CIBC-launches-CIBC-Adapta-TM-Mastercard-R-,-the-first-credit-card-in-Canada-that-automatically-adapts-to-spending-behaviour,-rewarding-cardholders-more-for-everyday-purchases",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 2,
  "month": 5,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}