{
  "title": "Media Advisory – CIBC's Hratch Panossian to Speak at National Bank Financial Services Conference",
  "url": "https://cibc.mediaroom.com/2025-03-19-CIBCs-Hratch-Panossian-to-Speak-at-National-Bank-Financial-Services-Conference",
  "date": "2025-03-19T00:00:00",
  "short_description": "",
  "content": "In the news release, Media Advisory - CIBC's\nHratch Panossian\nto Speak at National Bank Financial Services Conference, issued\n19-Mar-2025\nby CIBC over PR Newswire, we are advised by the company that the second paragraph has been modified. The complete, corrected release follows:\nMedia Advisory - CIBC's Hratch Panossian to Speak at National Bank Financial Services Conference\nTORONTO\n,\nMarch 19, 2025\n/CNW/ -\nHratch Panossian\n, Senior Executive Vice-President and Group Head, Personal and Business Banking,\nCanada\n, CIBC (TSX: CM) (NYSE: CM) will speak at the National Bank Financial Services Conference in\nMontreal\non\nTuesday March 25, 2025\n.\nInterested parties may access the live audio webcast at\nhttps://www.cibc.com/ca/investor-relations/exctv-prsntatns-wbcsts.html\n. An archived version of the audio webcast will be available at the same location.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets businesses, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across\nCanada\n, in\nthe United States\nand around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\n.\nSOURCE CIBC",
  "id": "2025-03-19-CIBCs-Hratch-Panossian-to-Speak-at-National-Bank-Financial-Services-Conference",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}