{
  "title": "CIBC President and CEO Victor Dodig Announces Plan to Retire October 31, 2025; Harry Culham Appointed Chief Operating Officer effective April 1, 2025 and Named to Succeed Dodig as CIBC President and CEO November 1, 2025",
  "url": "https://cibc.mediaroom.com/2025-03-13-CIBC-President-and-CEO-Victor-Dodig-Announces-Plan-to-Retire-October-31,-2025-Harry-Culham-Appointed-Chief-Operating-Officer-effective-April-1,-2025-and-Named-to-Succeed-Dodig-as-CIBC-President-and-CEO-November-1,-2025",
  "date": "2025-03-13T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nMarch 13, 2025\n/CNW/ - CIBC (TSX: CM) (NYSE: CM) today announced that\nVictor Dodig\nplans to retire as President and Chief Executive Officer, effective\nOctober 31, 2025\n, and that\nHarry Culham\nhas been appointed as Chief Operating Officer effective\nApril 1, 2025\nand will succeed Mr. Dodig as President and Chief Executive Officer, effective\nNovember 1, 2025\n. Mr. Dodig will serve as a special advisor to Mr. Culham and the Board from\nNovember 1, 2025\nto\nApril 30, 2026\nto support a seamless transition.\nMr. Dodig has served as President and CEO of CIBC since\nSeptember 2014\n, guiding the bank through a period of significant transformation and growth. Under his leadership, CIBC has become a modern, relationship-oriented bank recognized for delivering superior client focus, consistent and reliable strategic growth, and top-tier shareholder returns.\n\"It has been an honour to lead CIBC and work alongside such a dedicated and purpose-led team,\" said Mr. Dodig. \"Together, we have built a strong foundation for the future, with a clear and consistent strategy focused on client relationships, financial strength, innovation, sustainability and genuine community engagement. I am very proud of all that we have accomplished together and believe the time is right to hand the baton to Harry. I look forward to working closely with Harry and our entire leadership team as we continue delivering exceptional value for our clients, shareholders, and communities.\"\nOver the past decade, CIBC built a highly connected and client-focused team and culture that is guided by a common purpose of helping make ambitions real, renewed its brand, modernized its workplaces, achieved best-in-class employee experience scores, and delivered the strongest client experience gains among Canadian banks. In addition, the bank has taken a leading role in fostering inclusion, furthered its commitment to communities through the launch of the CIBC Foundation, and became a North American leader in sustainability.\n\"Victor's tenure as President and CEO has been marked by a relentless focus on our clients and an unwavering commitment to transforming CIBC into the modern, relationship-oriented bank it is today, with a connected culture that brings the best of CIBC to its clients,\" said\nKate Stevenson\n, Chair of the Board of Directors. \"Victor led key strategic acquisitions including the acquisition of PrivateBancorp, Inc., which significantly enhanced CIBC's U.S. footprint in Commercial Banking and Wealth Management. He also led the acquisition of Costco's Canadian credit card portfolio which added over two million clients to CIBC, including many mass affluent and business banking clients. In addition, he led transformative investments in digital banking and technology to modernize the bank. The result is a strategic platform for growth that will benefit stakeholders for years to come.\"\n\"We are thankful for his incredible contributions and appreciate the care he has invested in partnering with the board as we prepare to transition to the next generation of leadership.\"\nHarry Culham Named Chief Operating Officer and incoming President and CEO\nEffective\nApril 1, 2025\n, all of CIBC's operating businesses will report to Mr. Culham to help facilitate the leadership transition and continued strong focus on clients and performance. CIBC's corporate functions will continue to report to Mr. Dodig until\nOctober 31, 2025\n.\nWith a proven track record of leading Capital Markets and other key areas of CIBC's businesses and head office groups, Mr. Culham has instilled a strategic, client-focused, and growth-oriented mindset across the organization, building an exceptional team and delivering outstanding business results.\nMr. Culham first joined CIBC in\nVancouver\nas an intern and participated in one of the bank's first ever graduate programs. He then gained extensive experience in senior banking roles in\nEurope\nand\nAsia\nbefore rejoining CIBC in 2008, ultimately taking on the leadership of CIBC's global Capital Markets business in 2015.\nMr. Culham's global experience working with clients across borders was instrumental in providing a broad global perspective that he has brought to CIBC's Capital Markets business, and he has been a valued member of CIBC's Executive Committee for the past decade. Under his leadership, the business has diversified with robust growth in\nNorth America\nand with global reach to better meet the changing needs of clients in an evolving marketplace, while in parallel re-orienting the business around deep client relationships in key growth sectors. The result is a transformed business that produces consistent, sustainable growth with reduced earnings volatility and strong credit quality with a highly connected culture.\nMr. Culham has also been responsible for leading and optimizing several areas of the bank including CIBC Caribbean, CIBC Mellon, and the Strategic Client Office. He has also led CIBC's Enterprise Strategy and Corporate Development function and, most recently Global Asset Management. His commitment to community service is reflected in his roles as Co-Chair of the CIBC Foundation, Executive Chair of CIBC Miracle Day, the United Way Finance Sector lead, and as a member of the Board of Sinai Health. He holds a degree from the\nUniversity of British Columbia's\nSauder School\nof Business and is a Leslie Wong Fellow.\n\"Harry is a proven leader who has worked alongside me, our board and the rest of our CIBC team to build the bank we are today,\" said Mr. Dodig. \"His client focus, inclusive leadership and track record of performance and consistency position him perfectly to take the bank forward and build on the momentum we have established. I look forward to working closely with him over the coming months.\"\n\"I'm delighted to take on these new responsibilities in service of CIBC's clients, employees, business partners, shareholders and the communities we serve,\" said Mr. Culham. \"I am enormously proud of the work we have done under Victor's leadership and am excited to build on our current momentum to fully realize the value of the strategy we have put in place over the past several years.\"\n\"Harry's approach to creating shareholder value through disciplined execution, prudent and risk-controlled growth, and a focus on clients are ideally suited to furthering CIBC's momentum,\" said Ms. Stevenson. \"Succession planning and talent development at all levels of the organization have been an ongoing and continuous focus for our board. Today's announcement is the reflection of our process and will ensure CIBC continues to grow in a consistent and sustainable way, creating enduring value for stakeholders.\"\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\n.\nSOURCE  CIBC",
  "id": "2025-03-13-CIBC-President-and-CEO-Victor-Dodig-Announces-Plan-to-Retire-October-31,-2025-Harry-Culham-Appointed-Chief-Operating-Officer-effective-April-1,-2025-and-Named-to-Succeed-Dodig-as-CIBC-President-and-CEO-November-1,-2025",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}