{
  "title": "CIBC's 2025 Annual and Special Meeting of Shareholders - Meeting Materials Now Available",
  "url": "https://cibc.mediaroom.com/2025-03-04-CIBCs-2025-Annual-and-Special-Meeting-of-Shareholders-Meeting-Materials-Now-Available",
  "date": "2025-03-04T00:00:00",
  "short_description": "",
  "content": "TORONTO\n,\nMar. 4, 2025\n/CNW/ - CIBC (TSX: CM) (NYSE: CM) today announced that materials for its Annual and Special Meeting of Shareholders scheduled on\nThursday, April 3, 2025\nat\n9:30 a.m. Eastern Daylight Time\n(EDT), are now available, including the 2025 Management Proxy Circular.\nAnnual and Special Meeting of Shareholders\nOur 2025 Annual and Special Meeting of Shareholders will take place in-person and by live webcast. In-person attendance at the meeting is open to registered shareholders, beneficial shareholders and duly appointed proxyholders. Shareholders and proxyholders may also attend through the live webcast or call into our phone line to listen to the meeting (though voting is not available by phone).\nAll other interested persons are welcome to attend the meeting through the live webcast.\nWhen\n:\nThursday, April 3, 2025\n,\n9:30 a.m. (EDT)\nIn person\n: CIBC Square, 81 Bay Street,\nToronto, Ontario\n(available for registered shareholders, beneficial shareholders and duly appointed proxyholders)\nLive webcast\n: Log in at\nhttps://cibcvirtual.com/agm2025\nat least 15 minutes before the meeting starts\nBy phone:\nEnglish 416 340-2217 (local) or 1 800 806-5484 (toll-free in\nCanada\nand\nthe United States\n), passcode 7053922#\nFrench 514 392-1587 (local) or 1 800 898-3989 (toll free in\nCanada\nand\nthe United States\n), passcode 9040336#\nWe encourage shareholders to vote in advance of the meeting by one of the methods described in the Management Proxy Circular (available at\nwww.meetingdocuments.com/TSXT/cibc\n) and their proxy form or voting instruction form. Shareholders with questions may contact CIBC's transfer agent TSX Trust Company at 1 866 751-6315 (toll free in\nCanada\nand\nthe United States\n) or 416 682-3860 (other countries).\nWe also encourage shareholders to submit questions for our Board and management in advance of the meeting by email to the Corporate Secretary at\ncorporate.secretary@cibc.com\nor by mail to CIBC Corporate Secretary Division, 81 Bay Street, CIBC Square, 20th Floor,\nToronto, Ontario\nM5J 0E7.\nMeeting Materials\nCIBC's meeting materials have been filed with the Canadian Securities Administrators and the U.S. Securities and Exchange Commission. Distribution of the meeting materials to shareholders begins today and they can also be accessed online:\nCIBC website:\nCIBC Annual Meeting webpage\nTSX Trust Company's website:\nwww.meetingdocuments.com/TSXT/cibc\nSEDAR+:\nwww.sedarplus.com\nEDGAR:\nwww.sec.gov/edgar.shtml\nShareholders may obtain a paper copy of the Management Proxy Circular or the Annual Report, free of charge, by contacting our transfer agent, TSX Trust Company, through one of the methods described in the Management Proxy Circular.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets businesses, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nhttps://www.cibc.com/en/about-cibc/media-centre.html\n.\nSOURCE  CIBC - Investor Relations",
  "id": "2025-03-04-CIBCs-2025-Annual-and-Special-Meeting-of-Shareholders-Meeting-Materials-Now-Available",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 3,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}