{
  "title": "Scotiabank's Jacqui Allard named to Report on Business Best Executive List",
  "url": "https://scotiabank.investorroom.com/2025-04-25-Scotiabanks-Jacqui-Allard-named-to-Report-on-Business-Best-Executive-List",
  "date": "2025-04-25",
  "short_description": "Scotiabank's Jacqui Allard, Group Head, Global Wealth Management, has been recognized in the Report on Business Best Executive Awards for outstanding executive leadership. \"Jacqui is an...",
  "content": "Jacqui Allard (CNW Group/The Bank of Nova Scotia)\nTORONTO,April 25, 2025/CNW/ - Scotiabank's Jacqui Allard, Group Head, Global Wealth Management, has been recognized in theReport on Business Best Executive Awardsfor outstanding executive leadership.\n\n\"Jacqui is an exceptional strategic leader making a meaningful impact here at Scotiabank,\" saidScott Thomson, President and CEO, Scotiabank. \"Under her leadership, our Global Wealth Management business achieved record earnings and an all-time-high client satisfaction in 2024. She has fostered an inclusive, client-centric culture and empowered her team to deliver strong results. On behalf of all of us at Scotiabank, we congratulate her on this well-deserved recognition.\"\nWith over 25 years of progressively more senior positions in global financial services, Jacqui was appointed Group Head, Global Wealth Management at Scotiabank in 2023. She is responsible for all aspects of Scotiabank's wealth management advisory, private banking, trust and insurance businesses globally, leading over 8,500 employees. Jacqui has deep experience transforming and growing businesses to deliver maximum value to clients.\nJacqui has been recognized as one of 'Canada'sTop 100 Most Powerful Women' by the Women's Executive Network. She serves on the Board of Directors of KeyCorp, a publicly traded bank based inCleveland, Ohio, and the not-for-profit Centre for Addiction and Mental Health (CAMH) Foundation. She is also a Strategic Advisor and Past Chair of the Board of Directors of not-for profit organization Up With Women.\nAbout Scotiabank\nScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately $1.4 trillion (as at January 31, 2025), Scotiabank is one of the largest banks in North America by assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE The Bank ofNova Scotia\n",
  "id": "2025-04-25-Scotiabanks-Jacqui-Allard-named-to-Report-on-Business-Best-Executive-List",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "report",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}