{
  "title": "Scotiabank Commits $3 Million to Support Local Atlantic Communities in 2025",
  "url": "https://scotiabank.investorroom.com/2025-04-07-Scotiabank-Commits-3-Million-to-Support-Local-Atlantic-Communities-in-2025",
  "date": "2025-04-07",
  "short_description": "Today, Scotiabank announced a $3 million community investment in Atlantic Canada, marking its largest annual commitment in the region. Funding will support local communities through partnerships...",
  "content": "HALIFAX, NS,April 7, 2025/CNW/ - Today, Scotiabank announced a$3 millioncommunity investment inAtlantic Canada, marking its largest annual commitment in the region. Funding will support local communities through partnerships with non-profit organizations, which will include programs focused on economic resilience that are in line with the Bank's ScotiaRISE initiative.\n\nThe ScotiaRISE community investment program supports initiatives that address critical issues to strengthen economic resilience, including improving high school graduation rates and post-secondary participation, removing barriers to workforce participation and career development, and supporting newcomer inclusion and basic needs. Launched in 2021, ScotiaRISE has contributed more than$150 millionand partnered with over 300 organizations worldwide, including more than 30 active partnerships inAtlantic Canada.\n\"Scotiabank's commitment toAtlantic Canadais deeply rooted in our Bank's heritage and in our vision of being our clients' most trusted financial partner across the communities we serve,\" saidScott Thomson, President and CEO, Scotiabank. \"Our increased community investment inAtlantic Canadaunderscores our commitment to help strengthen emerging and growing communities and create meaningful opportunities for individuals and families to reach their full potential.\"\n\"Atlantic Canadahas immense economic potential, driven by our traditional industries as well as emerging ones,\" said the Honorable Colton LeBlanc, Minister of Growth and Development for the Province ofNova Scotia. \"We're excited about what the future holds in terms of economic growth and development. We thank Scotiabank for its significant investment inNova Scotiaand across the region.\"\nScotiaRISE recently partnered withDalhousie Universityto invest in the new College of Digital Transformation, which provides training for underrepresented and equity-deserving groups in management and computer science careers. ScotiaRISE also partners locally with United Way inAtlantic Canadato support people living in poverty, working to ensure that everyone has access to the programs and services they need to thrive.\nAmong other community partnerships acrossAtlantic Canada, ScotiaRISE actively collaborates with Easter Seals Nova Scotia, Hope Blooms, Janeway Children's Hospital Foundation, Junior Achievement New Brunswick, theNova Scotia CommunityCollege, QEII Health Sciences Centre Foundation, and The Prep Academy.\nAbout ScotiaRISEScotiaRISEis Scotiabank's$500 millioncommunity investment initiative designed to help remove barriers and increase access to a more resilient future for individuals, families and communities across our footprint. Through community partnerships, ScotiaRISE invests in three focus areas: improving high school and post-secondary participation, removing career barriers, and supporting newcomer economic inclusion. ScotiaRISE also invests in programs that address reclamation of Indigenous language and culture as well as urgent and basic needs, such as improving access to basic supports like food and water, shelter and medical care. Since its launch in 2021, ScotiaRISE has invested over$150 millionand partnered with over 300 organizations worldwide to provide the tools people need to reach their full potential.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-04-07-Scotiabank-Commits-3-Million-to-Support-Local-Atlantic-Communities-in-2025",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}