{
  "title": "Scotiabank Proxy Circular Now Available",
  "url": "https://scotiabank.investorroom.com/2025-03-07-Scotiabank-Proxy-Circular-Now-Available",
  "date": "2025-03-07",
  "short_description": "Scotiabank's Notice of the 193rd Annual Meeting of Shareholders and Management Proxy Circular is now available at scotiabank.com/annualmeeting. The Management Proxy Circular contains key...",
  "content": "TORONTO,March 7, 2025/CNW/ - Scotiabank's Notice of the 193rdAnnual Meeting of Shareholders and Management Proxy Circular is now available atscotiabank.com/annualmeeting.\n\nThe Management Proxy Circular contains key information for shareholders regarding the Annual Meeting of Shareholders and items of business, including the election of directors, the appointment of the bank's auditor, an advisory vote on Scotiabank's approach to executive compensation and shareholder proposals.\nScotiabank's Annual Meeting of Shareholders is scheduled to be held in-person inHalifax, Nova Scotia, and online via a live webcast onTuesday, April 8, 2025, at9:30 a.m.Atlantic Time (8:30 a.m. Eastern Time). Shareholders and duly appointed proxyholders are invited to attend the meeting in-person or online. Guests are welcome to attend the meeting online via the live webcast.\nWe encourage shareholders to vote in advance of the meeting by one of the methods described in the Management Proxy Circular and their proxy form or voting instruction form.\nFurther details will be made available in advance of the meeting atscotiabank.com/annualmeeting.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-03-07-Scotiabank-Proxy-Circular-Now-Available",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}