{
  "title": "Embark on a World of Luxury: Scotiabank Introduces the Scotiabank Passport® Visa Infinite Privilege* Card",
  "url": "https://scotiabank.investorroom.com/2025-03-11-Embark-on-a-World-of-Luxury-Scotiabank-Introduces-the-Scotiabank-Passport-R-Visa-Infinite-Privilege-Card",
  "date": "2025-03-11",
  "short_description": "New Scotiabank credit card unlocks a world of rewards and exclusive benefits to clients. TORONTO, March 11, 2025 /CNW/ - Scotiabank announced today the launch of the new Scotiabank Passport Visa...",
  "content": "New Scotiabank credit card unlocks a world of rewards and exclusive benefits to clients.\nTORONTO,March 11, 2025/CNW/ - Scotiabank announced today the launch of the new Scotiabank Passport Visa Infinite Privilege Card, an elite travel credit card tailored to Canadians seeking a superior travel experience. With a suite of exceptional benefits, including travel rewards, comprehensive insurance, and curated offers, the Scotiabank Passport Visa Infinite Privilege Card will transform the way Canadians travel.\n\"Avid travellers know that the right credit card can elevate their experience with a range of features to ensure a luxurious journey,\" saidD'Arcy McDonald, Senior Vice-President of Retail Payments and Unsecured Lending. \"That's exactly what we aimed to deliver with the Scotiabank Passport Visa Infinite Privilege Card. A card for the modern traveller, offering unparalleled travel privileges and exclusive lifestyle and client service benefits to help make every journey a rewarding one.\"\n\"We are committed to developing market-leading products and solutions, backed by the trust, scale, and security of the Visa network,\" saidMichiel Wielhouwer, President and Country Manager at Visa Canada. \"Your card benefits should complement your lifestyle, and we are thrilled to deepen our relationship with Scotiabank to introduce this new Visa Infinite Privilege card, specifically designed to enrich the travel experiences of Canadian cardholders.\"\nThe Scotiabank Passport Visa Infinite Privilege Card is ideal for travel enthusiasts and adventure seekers who are looking for a card that offers first-rate service, convenience, and enhanced value for themselves and their loved ones, including:\nThe Scotiabank Passport Visa Infinite Privilege Card is available for application online. Private Banking clients can speak to their Private Banker for more information.\nTerms and conditions apply. To learn more about the Scotiabank Passport Visa Infinite Privilege Card, please visit the official page onScotiabank.comfor full details.\n®Registered trademark of The Bank of Nova Scotia.\n*Visa Int./Licensed User.\n™Scene+ and the Icon Design are trademarks of Scene Plus IP Corporation, used under license.\n1\nInsurance coverage is underwritten by The Manufacturers Life Insurance Company and its wholly owned subsidiary First North American Insurance Company. All coverages are subject to limitations, restrictions and exclusions set out in the insurance certificates.\n2\nScotia Credit Card Protection is underwritten by Chubb Life Insurance Company of Canada: Tel:1-800-387-7199, Option 3, orwww.chubb.comunder a Group Policy issued to the Bank of Nova Scotia. All coverage is subject to the terms and conditions in the certificate of insurance.\nAbout ScotiabankScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-03-11-Embark-on-a-World-of-Luxury-Scotiabank-Introduces-the-Scotiabank-Passport-R-Visa-Infinite-Privilege-Card",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}