{
  "title": "Scotia Global Asset Management announces March 2025 cash distributions for Scotia ETFs",
  "url": "https://scotiabank.investorroom.com/2025-03-19-Scotia-Global-Asset-Management-announces-March-2025-cash-distributions-for-Scotia-ETFs",
  "date": "2025-03-19",
  "short_description": "Scotia Global Asset Management announced today the March 2025 cash distributions for the Scotia ETFs listed on the Cboe Canada exchange, which pay on a monthly or quarterly basis, as noted below....",
  "content": "TORONTO,March 19, 2025/CNW/ - Scotia Global Asset Management announced today theMarch 2025cash distributions for the Scotia ETFs listed on the Cboe Canada exchange, which pay on a monthly or quarterly basis, as noted below. Unitholders of record onMarch 26, 2025will receive a cash distribution payable onApril 2, 2025, as noted below.\n\nScotia ETF name\nTickersymbol\nCash distributionper unit ($)\nDistributionfrequency\nScotia Canadian Bond Index Tracker ETF\nSITB\n0.034\nMonthly\nScotia Canadian Large Cap Equity Index Tracker ETF\nSITC\n0.182\nQuarterly\nScotia Emerging Markets Equity Index Tracker ETF\nSITE\n0.067\nQuarterly\nScotia International Equity Index Tracker ETF\nSITI\n0.051\nQuarterly\nScotia Responsible Investing Canadian Bond Index ETF\nSRIB\n0.046\nMonthly\nScotia Responsible Investing Canadian Equity Index ETF\nSRIC\n0.105\nQuarterly\nScotia Responsible Investing International Equity Index ETF\nSRII\n0.028\nQuarterly\nScotia Responsible Investing U.S. Equity Index ETF\nSRIU\n0.052\nQuarterly\nScotia U.S. Equity Index Tracker ETF\nSITU\n0.086\nQuarterly\nFor more information on the Scotia ETFs, please visit theScotia Exchange Traded Funds (ETF) website.\nCommissions, trailing commissions, management fees and expenses may be associated with mutual fund investments, including exchange-traded funds (ETFs).  Please read the prospectus before investing. Mutual funds and ETFs are not guaranteed, their values change frequently and past performance may not be repeated.\nAbout Scotia Global Asset Management\nScotia Global Asset Management® is a business name used by 1832 Asset Management L.P., a limited partnership, the general partner of which is wholly owned by Scotiabank. Scotia Global Asset Management offers a range of wealth management solutions, including mutual funds, ETFs, liquid alternative mutual funds, private asset funds and customized investment solutions for institutions and managed asset programs. For more information, please visitwww.scotiagam.com.\nAbout Scotiabank\nScotiabank's vision is to be our clients' most trusted financial partner and deliver sustainable, profitable growth. Guided by our purpose: \"for every future,\" we help our clients, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets. With assets of approximately$1.4 trillion(as atJanuary 31, 2025), Scotiabank is one of the largest banks inNorth Americaby assets, and trades on the Toronto Stock Exchange (TSX: BNS) and New York Stock Exchange (NYSE: BNS). For more information, please visitwww.scotiabank.comand follow us on X @Scotiabank.\nSOURCE  Scotiabank",
  "id": "2025-03-19-Scotia-Global-Asset-Management-announces-March-2025-cash-distributions-for-Scotia-ETFs",
  "company": "Scotiabank",
  "year": "",
  "quarter": "",
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "scotiabank",
  "raw_content_type": "html"
}