{
  "cik": 72971,
  "company_name": "Wells_Fargo",
  "ticker": "WFC",
  "form_type": "S-3",
  "filing_date": "2024-02-28",
  "period": "",
  "accession_number": "0001193125-24-050710",
  "file_url": "https://www.sec.gov/Archives/edgar/data/72971/0001193125-24-050710-index.html",
  "text": "As filed with the Securities and Exchange Commission on February 28, 2024\nRegistration No. UNITED STATES SECURITIES AND EXCHANGE COMMISSION WASHINGTON,\nD.C. 20549 FORM S-3 REGISTRATION STATEMENT UNDER THE SECURITIES ACT OF 1933\nWELLS FARGO & COMPANY (Exact name of Registrant as specified in its charter)\n                                                            \n  Delaware                           41-0449260             \n  (State or other jurisdiction of    -IRS Employer          \n  incorporation or organization)     Identification Number  \n                                                            \n420 Montgomery Street San Francisco, California 94104 (866) 249-3302\n(Address, including zip code, and telephone number, including area code, of\nRegistrant\u0092s principal executive offices) Ellen R. Patterson Senior Executive\nVice President and General Counsel Wells Fargo & Company 420 Montgomery\nStreet San Francisco, California 94104 (866) 249-3302 (Name, address,\nincluding zip code, and telephone number, including area code, of agent for\nservice) With copies to: Anita Minicucci Wells Fargo & Company MAC #D1050-282\n401 S. Tryon Street, 28 thFloor Charlotte, North Carolina 28202 (866)\n249-3302 Approximate date of commencement of proposed sale to the public:From\ntime to time on or after the effective date of this Registration Statement.\nIf the only securities being registered on this form are being offered\npursuant to dividend or interest reinvestment plans, please check the\nfollowing box. ☐ If any of the securities being registered on this form are\nto be offered on a delayed or continuous basis pursuant to Rule 415 under the\nSecurities Act of 1933, other than securities offered only in connection with\ndividend or interest reinvestment plans, check the following box. ☒ If this\nform is filed to register additional securities for an offering pursuant to\nRule 462(b) under the Securities Act, please check the following box and list\nthe Securities Act Registration Statement number of the earlier effective\nRegistration Statement for the same offering. ☐ If this form is a post-\neffective amendment filed pursuant to Rule 462(c) under the Securities Act,\ncheck the following box and list the Securities Act Registration Statement\nnumber of the earlier effective Registration Statement for the same offering.\n☐ If this form is a Registration Statement pursuant to General Instruction\nI.D. or a post-effective amendment thereto that shall become effective upon\nfiling with the Commission pursuant to Rule 462(e) under the Securities Act,\ncheck the following box. ☐ If this form is a post-effective amendment to a\nRegistration Statement filed pursuant to General Instruction I.D. filed to\nregister additional securities or additional classes of securities pursuant\nto Rule 413(b) under the Securities Act, check the following box. ☐ Indicate\nby check mark whether the Registrant is a large accelerated filer, an\naccelerated filer, a non-acceleratedfiler, a smaller reporting company, or an\nemerging growth company. See the definitions of \u0093large accelerated filer,\u0094\n\u0093accelerated filer,\u0094 \u0093smaller reporting company\u0094 and \u0093emerging growth\ncompany\u0094 in Rule 12b-2of the Exchange Act:\n                                                            \n  Large accelerated filer ☒    Accelerated filer ☐          \n  Non-accelerated filer ☐      Smaller reporting company ☐  \n                               Emerging growth company ☐    \n                                                            \nIf an emerging growth company, indicate by check mark if the Registrant has\nelected not to use the extended transition period for complying with any new\nor revised financial accounting standards provided pursuant to Section\n7(a)(2)(B) of Securities Act. ☐ The Registrant hereby amends this\nRegistration Statement on such date or dates as may be necessary to delay its\neffective date until the Registrant shall file a further amendment which\nspecifically states that this Registration Statement shall thereafter become\neffective in accordance with Section 8(a) of the Securities Act of 1933 or\nuntil the Registration Statement shall become effective on such date as the\nSecurities and Exchange Commission, acting pursuant to said Section 8(a), may\ndetermine.\n\nWells Fargo Direct ® Wells Fargo & Company Direct Purchase and Dividend\nReinvestment Plan CUSIP# 949746 10 1 Wells Fargo Direct is a direct stock\npurchase and dividend reinvestment plan that provides a convenient and\neconomical method for new investors to make an initial investment in Wells\nFargo & Company common stock and for existing investors to increase their\nholdings of Wells Fargo & Company common stock. As a participant in Wells\nFargo Direct you can:\n                                                                         \n      purchase Wells Fargo & Company common stock through a convenient,  \n      low-cost method;                                                   \n                                                                         \n                                                                             \n      build your investment over time, starting with as little as $250, or   \n      $25 if you authorize recurring automatic                               \n      debits;                                                                \n                                                                             \n                                                                             \n      purchase shares by conducting recurring or periodic investments, by    \n      automatic bank debit or by sending in a                                \n      check;                                                                 \n                                                                             \n                                                                             \n      reinvest all or some of your cash dividends in Wells Fargo & Company   \n      common stock; and                                                      \n                                                                             \n                                                                        \n      access your account online to review and manage your investment.  \n                                                                        \nThis prospectus describes and constitutes the Wells Fargo & Company Direct\nPurchase and Dividend Reinvestment Plan, or simply Wells Fargo Direct, and\nrelates to shares of Wells Fargo & Company common stock offered for purchase\nunder Wells Fargo Direct. Please read this prospectus carefully and keep it\nfor future reference. If you have any questions about Wells Fargo Direct,\nplease call the Plan Administrator, Equiniti Trust Company, LLC (\u0093 EQ\nShareowner Services\u0094), at 1-877-840-0492between 7:00 a.m. and 7:00 p.m.,\nCentral time, on any business day. Wells Fargo & Company common stock trades\non the New York Stock Exchange under the symbol \u0093WFC.\u0094 Investing in Wells\nFargo & Company common stock involves risks. You should read carefully the\nrisk factorsdescribed herein on page 1 and in Wells Fargo & Company\u0092s\nSecurities and Exchange Commission filings before investing in Wells Fargo &\nCompany common stock. Neither the Securities and Exchange Commission nor any\nstate securities commission or other regulatory body has approved or\ndisapproved of these securities or passed upon the accuracy or adequacy of\nthis prospectus. Any representation to the contrary is a criminal offense.\nShares of Wells Fargo & Company common stock are not savings accounts,\ndeposits or other obligations of any bank or nonbank subsidiary of Wells\nFargo & Company, and they are not insured by the Federal Deposit Insurance\nCorporation, the Deposit Insurance Fund or any other governmental agency.\nThis prospectus is not an offer to sell securities, nor is it a solicitation\nof an offer to buy securities, in any state or country where the offer or\nsale is not permitted. Shares of Wells Fargo & Company common stock offered\nthrough Wells Fargo Direct are offered only through a registered broker.\nProspectus dated , 2024\n\nTABLE OF CONTENTS\n                                                                             \n       RISK FACTORS                                                       1  \n       FORWARD-LOOKING STATEMENTS                                         1  \n       ABOUT WELLS FARGO & COMPANY                                        2  \n       ABOUT THE PLAN                                                     3  \n  1.                                   What is Wells Fargo Direct?        3  \n  2.                                   What features does the Plan        3  \n                                       offer?                                \n                                       How do I enroll in Wells Fargo        \n  3.                                   Direct if I am a Wells Fargo       3  \n                                       stockholder?                          \n                                       How do I enroll if my shares          \n  4.                                   are held other than in my          3  \n                                       name?                                 \n                                       How do I enroll if I am not           \n  5.                                   currently a Wells Fargo            4  \n                                       stockholder?                          \n  6.                                   What are the fees associated       4  \n                                       with participation?                   \n  7.                                   How can I purchase additional      5  \n                                       shares?                               \n  8.                                   What are my dividend               6  \n                                       reinvestment options?                 \n  9.                                   When are dividends paid?           7  \n  10.                                  When does the Plan                 7  \n                                       Administrator purchase shares?        \n  11.                                  How does the Plan                  7  \n                                       Administrator buy the shares?         \n                                       At what price will the Plan           \n  12.                                  Administrator purchase the         8  \n                                       shares?                               \n  13.                                  Can I execute Plan                 8  \n                                       transactions by phone?                \n                                       Can I enroll, view my account         \n  14.                                  information, and execute           8  \n                                       transactions                          \n                                       online?                               \n  15.                                  How often will I receive           8  \n                                       account statements?                   \n                                       Will I receive stock                  \n  16.                                  certificates for my Plan           9  \n                                       shares?                               \n  17.                                  Can I deposit stock                9  \n                                       certificates?                         \n  18.                                  Can I transfer my Plan shares      9  \n                                       to someone else?                      \n  19.                                  How do I sell my Plan shares?      9  \n  20.                                  How can I terminate my            11  \n                                       participation in the Plan?            \n                                       Who is the Plan Administrator         \n  21.                                  and what does the Plan            11  \n                                       Administrator do?                     \n  22.                                  How do I contact the Plan         12  \n                                       Administrator?                        \n                                       What are the material U.S.            \n  23.                                  federal income tax                13  \n                                       consequences of participating         \n                                       in the Plan?                          \n       OTHER PLAN INFORMATION                                            15  \n       WHERE YOU CAN FIND MORE                                           17  \n       INFORMATION                                                           \n       USE OF PROCEEDS                                                   18  \n       EXPERTS                                                           18  \n       LEGAL OPINIONS                                                    18  \n       INDEMNIFICATION                                                   18  \n                                                                             \nRISK FACTORS\n\nAn investment in Wells Fargo & Company involves uncertainties and risks,\nincluding the possibility that the value of\nthe investment could fall substantially and that dividends or other\ndistributions on the investment could be reduced or eliminated. You should\ncarefully consider and evaluate all of the information included and\nincorporated by reference in this\nprospectus, including the risk factors incorporated by reference from our\nAnnual Report on Form 10-K for the year ended December 31, 2023, as updated\nby our subsequent quarterly reports on Form 10-Q and other filings we make\nwith the Securities and Exchange\nCommission (the \u0093\u0094). We encourage you to read these risk factors in their\nentirety. In addition to these risks, other risks and uncertainties not\npresently known to us or that we currently deem immaterial may also adversely\naffect our business operations and financial condition. Such risks could\ncause actual results to differ materially from anticipated results. This\ncould cause the trading price of our common stock to decline, perhaps\nsignificantly, and you may lose\npart or all of your investment.\n\nReferences in this prospectus to \u0093,\u0094 \u0093,\u0094\n\u0093\u0094 and \u0093\u0094 are to Wells Fargo\n& Company unless the context indicates otherwise.\n\nFORWARD-LOOKING STATEMENTS\n\nThis document contains \u0093forward-looking statements\u0094 within the meaning of the\nPrivate Securities Litigation Reform\nAct of 1995. In addition, we may make forward-looking statements in our other\ndocuments filed or furnished with the SEC, and our management may make\nforward-looking statements orally to analysts, investors, representatives of\nthe media and others.\nForward-looking statements can be identified by words such as \u0093anticipates,\u0094\n\u0093intends,\u0094 \u0093plans,\u0094 \u0093seeks,\u0094 \u0093believes,\u0094 \u0093estimates,\u0094 \u0093expects,\u0094 \u0093target,\u0094\n\u0093projects,\u0094 \u0093outlook,\u0094 \u0093forecast,\u0094 \u0093will,\u0094 \u0093may,\u0094 \u0093could,\u0094 \u0093should,\u0094 \u0093can\u0094\nand similar references to future periods. Forward-looking statements are not\nbased on\nhistorical facts but instead represent our current expectations and\nassumptions regarding our business, the economy and other future conditions.\nInvestors are urged to not unduly rely on forward-looking statements as\nactual results could differ\nmaterially from expectations. Forward-looking statements speak only as of the\ndate made, and we do not undertake to update them to reflect changes or\nevents that occur after that date.\n\nFor more information about factors that could cause actual results to differ\nmaterially from expectations, refer to the\n\u0093Forward-Looking Statements\u0094 discussion in our Annual Report on Form 10-K for\nthe year ended December\n31, 2023, as well as to our other reports filed with the SEC and available on\nits website at www.sec.gov, including the discussion under \u0093Risk Factors\u0094 set\nforth herein and in our Annual Report on Form 10-K for the year ended\nDecember 31, 2023.\n\n1\n\nABOUT WELLS FARGO & COMPANY\n\nWe are a leading financial services company organized under the laws of the\nState of Delaware and registered as a financial\nholding company and a bank holding company under the Bank Holding Company Act\nof 1956, as amended. We provide a diversified set of banking, investment and\nmortgage products and services, as well as consumer and commercial finance,\nthrough our four\nreportable operating segments: consumer banking and lending, commercial\nbanking, corporate and investment banking, and wealth and investment\nmanagement.\n\nWe are a separate and distinct legal entity from our banking and other\nsubsidiaries. A significant source of funds to pay\ndividends on our common and preferred stock and debt service on our debt is\ndividends from our subsidiaries. Various federal and state statutes and\nregulations limit the amount of dividends that our banking and other\nsubsidiaries may pay to us\nwithout regulatory approval.\n\nThis prospectus incorporates business and financial information about Wells\nFargo that is\nnot included in or delivered with this prospectus. This information is\navailable to you without charge upon written or oral request. See \u0093Where You\nCan Find More Information.\u0094\n\nWe have not authorized any person to give any information or make any\nrepresentation that is different from, or in addition to, that contained in\nthis prospectus or in any information that we incorporate by reference into\nthis prospectus. We take no responsibility for, and can provide no assurance\nas to the reliability of, any other information that others may give you.\n\nWe do not imply by the delivery to you of this prospectus or the sale of any\nWells Fargo common stock hereunder that there has been no change in the\naffairs of Wells Fargo since the date of this prospectus or that the\ninformation in this prospectus is correct as of any time subsequent to the\ndate of this prospectus.\n\nInformation on the website of Wells Fargo or any subsidiary of Wells Fargo is\nnot part of this prospectus, and you should not rely on that information in\nmaking your investment decision unless that information is also in this\nprospectus or has been incorporated by reference into this prospectus.\n\n2\n\nABOUT THE PLAN The following questions and answers contain all of the terms\nand conditions of Wells Fargo Direct (the \u0093 Plan\u0094). For additional\ninformation concerning the Plan you may contact Equiniti Trust Company, LLC\n(\u0093 EQ Shareowner Services\u0094 or the \u0093 Plan Administrator\u0094), at 877-840-0492.\n                                   \n  1.  What is Wells Fargo Direct?  \n                                   \nWells Fargo Direct is a direct stock purchase and dividend reinvestment plan\nthat enables new investors to make an initial investment in Wells Fargo\ncommon stock and existing investors to increase their holdings of Wells Fargo\ncommon stock. Participants can purchase Wells Fargo common stock with\noptional cash investments and cash dividends.\n                                          \n  2.  What features does the Plan offer?  \n                                          \n                                                                             \n      Initial investment. If you are not a Wells Fargo stockholder, you can  \n      make an initial investment in                                          \n      Wells Fargo common stock, starting with as little as $250, or $25 if   \n      you sign up for recurring automatic bank withdrawals.                  \n                                                                             \n                                                                             \n      Optional cash investments. You can increase your holdings of Wells     \n      Fargo common stock through optional                                    \n      cash investments of $25 or more. You can make optional cash            \n      investments by check or by authorizing one-time or recurring           \n      automatic bank withdrawals.                                            \n                                                                             \n                                                                             \n      Automatic dividend reinvestment. You can increase your holdings of     \n      Wells Fargo common stock through                                       \n      automatic reinvestment of your cash dividends. You can elect to        \n      reinvest all or a percentage of your dividends.                        \n                                                                             \n                                                                             \n      Automated transactions. You can execute many of your Plan              \n      transactions online or by phone if you have                            \n      established automated privileges.                                      \n                                                                             \n                                                                             \n      Share safekeeping. You can deposit your Wells Fargo common stock       \n      certificates for safekeeping by the                                    \n      Plan Administrator.                                                    \n                                                                             \nRefer to Question 6 for details on fees charged for these transactions and\nservices.\n                                                                             \n  3.  How do I enroll in Wells Fargo Direct if I am a Wells Fargo            \n      stockholder?                                                           \n                                                                             \nIf you are a Wells Fargo stockholder of record \u0096 that is, your shares are\nregistered in your name, not your broker\u0092s or bank\u0092s name \u0096 you can enroll\nthrough shareowneronline.com(see Question 14) or by submitting an Account\nAuthorization Formby mail (see Question 22).\n                                                                    \n  4.  How do I enroll if my shares are held other than in my name?  \n                                                                    \nIf your Wells Fargo shares are registered in the name of a bank, broker or\nother nominee (otherwise referred to as being held in \u0093street name\u0094), simply\narrange for the bank, broker or other nominee to register in your name the\nnumber of shares of Wells Fargo common stock that you want to participate in\nthe Plan. You can then enroll as a stockholder of record, as described in\nQuestion 3 above. Alternatively, if you do not want to re-registeryour\nshares, you can enroll in the Plan in the same way as someone who is not\ncurrently a Wells Fargo stockholder, as described in Question 5 below. 3\n                                                                        \n  5.  How do I enroll if I am not currently a Wells Fargo stockholder?  \n                                                                        \nIf you do not currently have any Wells Fargo common stock registered in your\nname, you can enroll through shareowneronline.com(see Question 14) or by\nsubmitting an Account Authorization Formby mail (see Question 22). When you\nenroll, you will be required to pay a one-timeaccount set-upfee of $10, and\neither make an initial investment of at least $250 (but not more than\n$120,000) or authorize recurring automatic bank withdrawals of at least $25\neach. If you authorize recurring automatic bank withdrawals and are enrolling\nby mail, you must make your first investment of at least $25 by check. Your\ncheck for your initial investment and account set-upfee must be made payable\nto \u0093EQ Shareowner Services\u0094 in U.S. dollars drawn on a U.S. or Canadian\nfinancial institution. Regulations in certain countries may limit or prohibit\nparticipation in this type of plan. Persons residing outside the United\nStates who wish to participate in Wells Fargo Direct should first determine\nwhether they are subject to any governmental regulation prohibiting their\nparticipation.\n                                                        \n  6.  What are the fees associated with participation?  \n                                                        \nFees\n                                                                             \n  Investment fees                                                            \n  Initial enrollment (new investors only)                            $10.00  \n  Dividend reinvestment                                        Company Paid  \n  Check investment                                                    $3.00  \n  One-time automatic investment                                       $2.50  \n  Recurring automatic investment                                      $1.00  \n  Dividend purchase trading commission per                            $0.03  \n  share                                                                      \n  Optional cash purchase trading commission                                  \n  per                                                                 $0.03  \n  share                                                                      \n                                                Sales fees                   \n  Batch Order                                                        $15.00  \n  Market Order                                                       $25.00  \n  Limit Order per transaction (Day/GTD/GTC)                          $30.00  \n  Stop Order                                                         $30.00  \n  Sale trading commission per share when                                     \n  submitted                                                           $0.06  \n  through shareowneronline.com                                               \n  Sale trading commission per share when                                     \n  submitted                                                           $0.12  \n  in writing or by telephone                                                 \n  Direct deposit of sale proceeds                                     $5.00  \n                                                Other fees                   \n  Certificate issuance                                         Company Paid  \n  Certificate deposit                                          Company Paid  \n  Returned check / Rejected automatic bank                  $35.00 per item  \n  withdrawals                                                                \n  Prior year duplicate statements                           $15.00 per year  \n                                                                             \nWe can change the fee structure of the Plan at any time. We will give you\nnotice of any fee changes prior to the changes becoming effective. For cash\ninvestment and dividend reinvestment transactions, transaction fees and\nbrokerage commissions are deducted from the amount invested. For sale\ntransactions, transaction fees and brokerage commissions are deducted from\nthe sale proceeds. 4\n                                             \n  7.  How can I purchase additional shares?  \n                                             \nYou can make additional cash investments in the Plan at any time either by\ncheck or by authorizing one-timeor recurring automatic bank withdrawals from\na U.S. or Canadian financial institution. The dollars you invest will go\ntowards purchasing whole and fractional shares. Each investment can be for as\nlittle as $25. Your total investment for any calendar year is limited to\n$120,000. For purposes of applying the $120,000 annual maximum, we will\ncombine all investments, including initial and additional investments, but we\nwill exclude dividend reinvestments. Check\u0096 To make an investment by check,\ncomplete and return a Transaction Request Form(attached to your account\nstatement) together with your payment. The check must be made payable to \u0093EQ\nShareowner Services\u0094 in U.S. dollars and drawn on a U.S. or Canadian\nfinancial institution. Cash, money orders, traveler\u0092s checks or third party\nchecks are not accepted. The Plan Administrator must receive your payment at\nleast one (1) business day prior to an investment date (see Question 10);\notherwise, your payment will be invested on the next investment date. A\nrefund request for an optional cash investment made by check must be received\nin writing by the Plan Administrator not less than two (2) trading days\nbefore such amount is to be invested. One-timeautomatic withdrawal\u0096 You can\nmake a one-timeautomatic withdrawal from a designated checking or savings\naccount at a U.S. or Canadian financial institution by signing on to\nshareowneronline.com, by telephone or by sending an Account Authorization\nFormby mail (see Question 22). Recurring automatic withdrawals\u0096 You can make\nregular investments with automatic monthly or semi-monthly withdrawals from a\ndesignated checking or savings account at a U.S. or Canadian financial\ninstitution. You can authorize automatic monthly or semi-monthly investments\nby signing on to shareowneronline.com, by telephone or by sending an Account\nAuthorization Formby mail (see Question 22). Requests are processed and\nbecome effective as promptly as administratively possible. Once the automatic\nwithdrawal is initiated, funds will be debited from your designated bank\naccount on or about the 15th and/or the 30th of each month. The funds will be\ninvested on the next investment date (see Question 10) that is at least three\n(3) business days after the withdrawal is made. Changes in or a\ndiscontinuation of automatic withdrawals can be made online, by telephone or\nby using the Transaction Request Formattached to your statement. To be\neffective with respect to a particular investment date, the Plan\nAdministrator must receive a change request at least 15 trading days prior to\nthe investment date. You may obtain a return of any cash investment upon\nrequest received by the Plan Administrator on or before the second business\nday prior to the date on which it is to be invested. Purchases may be subject\nto certain fees and conditions (see Question 6). All common stock purchased\nunder this Plan will be held by the Plan Administrator for the benefit of all\nparticipants together in its name or in the name of its nominee. The Plan\nAdministrator shall have no liability in connection with any inability to\npurchase common stock, the timing of any purchases or the value of Wells\nFargo common stock acquired for the participant\u0092s account. If any optional\ncash investment, including payment by check or automatic withdrawal, is\nreturned for any reason, the Plan Administrator will remove from the\nparticipant\u0092s account any common stock purchased with such funds, and will\nsell these shares. The Plan Administrator may also sell additional common\nstock in the account to recover a returned funds fee for each optional cash\ninvestment returned unpaid for any reason and may sell additional shares as\nnecessary to cover any market loss incurred by the Plan Administrator. 5\n\nParticipants\u0092 funds held by the Plan Administrator will not earn interest.\nDuring the period that an optional cash investment is pending, the collected\nfunds in the possession of the Plan Administrator may be invested in certain\nPermitted Investments. For purposes of this Plan, \u0093Permitted Investments\u0094\nshall mean the Plan Administrator may hold the funds uninvested or invested\nin select Wells Fargo deposit products. The risk of any loss from such\nPermitted Investments shall be the responsibility of the Plan Administrator.\nInvestment income from such Permitted Investments shall be retained by the\nPlan Administrator. Purchases by Wells Fargo employees and affiliates must be\nmade in compliance with Wells Fargo\u0092s Insider Trading Policy. In addition to\nother limitations, the Insider Trading Policy provides that the employee or\naffiliate may not trade in Wells Fargo\u0092s common stock if in possession of\nmaterial, non-publicinformation about Wells Fargo.\n                                                  \n  8.  What are my dividend reinvestment options?  \n                                                  \nThe Plan Administrator will apply all or a portion of your dividends, as\nelected (less any applicable fee), to purchase additional whole or fractional\nshares. Dividends are invested as soon as administratively possible on or\nfollowing the dividend payment date, and no later than 30 trading days\nfollowing the dividend payable date. Depending on the number of shares being\npurchased and the current trading volume, a purchase may be executed in\nmultiple transactions that may occur on more than one day. Should this occur,\nthe price will be the weighted average of all trades executed. The\nreinvestment option you elect will apply to all your Wells Fargo shares \u0096\nwhether held in certificate form, in direct registration or in the Plan. If\nyou do not select an option, the Plan Administrator will default your choice\nto full reinvestment.\n                                                                             \n      Full dividend reinvestment. If you elect full dividend reinvestment,   \n      all cash dividends payable on                                          \n      shares held in the Plan, along with any shares held in physical        \n      certificate form or through book-entry Direct Registration Shares      \n      (\u0093DRS\u0094), will be used to purchase additional shares. You will not        \n      receive cash dividends from us;                                        \n      instead, all dividends will be reinvested. Whole and fractional        \n      shares will be allocated to your Plan account. (RD)                    \n                                                                             \n                                                                             \n      Partial dividend reinvestment by percentage. You may elect to          \n      reinvest a portion of the dividend and                                 \n      receive the remainder in cash. The percentage elected will be applied  \n      against the total shares held in the Plan, along with any shares held  \n      in physical certificate form or held through DRS. You may elect        \n      percentages from 10%-90%, in increments of 10%. The cash portion of    \n      dividends will be sent by check unless you have elected to have those  \n      dividends deposited directly to a designated bank account. To          \n      authorize direct deposit,                                              \n      complete Section 6 of the Account Authorization Form. (RX%)            \n                                                                             \nAn example of partial reinvestment by percentage: A participant has a total\nof 150 shares. The participant chooses to have 50% of the total dividend\nreinvested. This will equate to 75 shares having dividends reinvested and 75\nshares having dividends paid in cash.\n                                                                             \n      No Dividend Reinvestment. If you elect no dividend reinvestment, the   \n      Plan Administrator will pay to                                         \n      you, in cash or by direct deposit, cash dividends paid on all your     \n      Wells Fargo shares. To authorize direct deposit, complete Section 6    \n      of the Account Authorization Form. (RP)                                \n                                                                             \nYou may change your reinvestment option at any time online, by telephone or\nby sending written notice to the Plan Administrator (See Question 22).\nNotices received on or before a dividend record date will be effective for\nthat cash dividend. Notices received after a dividend record date will not be\neffective until after that cash dividend has been paid. 6\n                                \n  9.  When are dividends paid?  \n                                \nHistorically, Wells Fargo has paid dividends on the first day of March, June,\nSeptember and December to stockholders of record on the first or second\nFriday of February, May, August and November, respectively. The dividend\npayment date and dividend record date may change in the future. To have your\ncash dividends reinvested, the Plan Administrator must receive your Account\nAuthorization Formauthorizing dividend reinvestment on or before the dividend\nrecord date. The payment of dividends on Wells Fargo common stock is at the\ndiscretion of Wells Fargo\u0092s Board of Directors. There is no guarantee that\nWells Fargo will pay dividends in the future. The timing and amount of future\ndividends, if any, will depend on earnings, cash requirements, the financial\ncondition of Wells Fargo and its subsidiaries, applicable government\nregulations and other factors deemed relevant by the Wells Fargo Board of\nDirectors.\n                                                          \n  10.  When does the Plan Administrator purchase shares?  \n                                                          \nOptional Cash Investments.Optional cash investments are made:\n                                                                             \n      Except as noted below, generally within five (5) trading days from     \n      receipt of your investment amount or,                                  \n      if the New York Stock Exchange is not open, the next business day the  \n      Exchange is open, or                                                   \n                                                                             \n                                                                             \n      If the investment occurs in any week in which a cash dividend is       \n      paid, on the dividend payment date or, if the                          \n      New York Stock Exchange is not open on the dividend payment date, the  \n      next business day the Exchange is open.                                \n                                                                             \nDividend Reinvestment.Cash dividends are reinvested on the applicable\ndividend payment date or, if the New York Stock Exchange is not open on the\ndividend payment date, the next business day the Exchange is open.\nInvestments may be postponed if necessary to comply with Regulation M under\nthe Securities Exchange Act of 1934, as amended (the \u0093 Exchange Act\u0094), or\nother applicable provisions of securities law. Shares are purchased and sold\nfor the Plan on specified dates or during specified periods. As a result, you\ndo not have any control over the price at which shares are purchased or sold\nfor your account, and you may pay a higher purchase price or receive a lower\nsales price than if you had purchased or sold the shares outside of the Plan.\nYou bear the risk of fluctuations in the price of Wells Fargo common stock.\nNo interest is paid on funds held by the Plan Administrator pending their\ninvestment. All optional cash investments, including the initial cash\ninvestment, are subject to collection by the Plan Administrator of the full\nface value in U.S. funds. All transactions under this Plan are subject to\ncompliance by Wells Fargo and you with all applicable legal requirements and\nall applicable regulations of any stock exchange on which Wells Fargo common\nstock may be \u0093listed.\u0094\n                                                        \n  11.  How does the Plan Administrator buy the shares?  \n                                                        \nThe Plan Administrator may purchase Wells Fargo common stock from Wells Fargo\nor use an independent agent to buy the shares in the open market or in\nnegotiated transactions. We determine the method. We currently use an\nindependent agent to buy Plan shares, but we can change this at any time\nwithout notice to you, subject to legal restrictions on how often we change\nthe method. The method used by the Plan Administrator will impact the\ndetermination of the price at which your shares are purchased (see Question\n12). 7\n                                                                       \n  12.  At what price will the Plan Administrator purchase the shares?  \n                                                                       \nOpen Market Purchases.If the shares are purchased in the open market or in a\nnegotiated transaction, your purchase price will be the weighted average\npurchase price per share for all shares purchased for that investment date.\nThe independent agent purchases shares as soon as administratively possible,\nand generally not more than five (5) business days, after the applicable\ninvestment date. Purchases from Wells Fargo.If the shares are purchased from\nWells Fargo, your purchase price will be the New York Stock Exchange-only\nclosing price of Wells Fargo common stock for that investment date. If the\nNew York Stock Exchange is closed on that date, then the price will be the\nNew York Stock Exchange-only closing price of Wells Fargo common stock for\nthe next business day the Exchange is open. The Plan Administrator may\ncommingle your funds with those of other participants for purposes of\nforwarding purchase orders to the independent agent. Also, the Plan\nAdministrator may offset purchase and sale orders for the same investment\ndate, forwarding to the independent agent the net purchase or sale\nrequirement. Because the prices at which shares are purchased under the Plan\nare beyond your control, you may lose any advantage otherwise available from\nbeing able to select the timing of your investment.\n                                                  \n  13.  Can I execute Plan transactions by phone?  \n                                                  \nIf you have established automated privileges for your account, you can\nperform the following transactions by calling the Plan Administrator:\n                                                                             \n      sell some or all of the shares credited to your account under the      \n      Plan;                                                                  \n                                                                             \n                                                                             \n      change your dividend reinvestment option (for example, from full to    \n      partial reinvestment);                                                 \n                                                                             \n                                                                   \n      change the amount of or stop automatic bank withdrawals; or  \n                                                                   \n                                                 \n      terminate your participation in the Plan.  \n                                                 \nCertain restrictions may apply. To establish automated privileges, please\ncontact the Plan Administrator and request an Automated Request Authorization\nForm.\n                                                                             \n  14.  Can I enroll, view my account information, and execute transactions   \n       online?                                                               \n                                                                             \nThe Plan Administrator maintains a website at shareowneronline.comthat allows\nyou to enroll online, view your account balance, recent Plan transactions and\nother helpful information, and update your personal information. See Question\n22.\n                                                     \n  15.  How often will I receive account statements?  \n                                                     \nIf you are a shareowner of record owning less than 100 shares, the Plan\nAdministrator will send you an annual account statement detailing all of your\ntransactions for the year. If you are a shareowner of record owning 100\nshares or more, the Plan Administrator will send you quarterly account\nstatements following each dividend reinvestment purchase. The Plan\nAdministrator will also send you an account statement as soon as\nadministratively possible after each optional cash investment and after any\ntransfer, sale or withdrawal of Plan shares. If you prefer, you may elect to\nhave your statements and other information sent to you automatically by\ninitiating eDelivery through shareowneronline.cominstead of receiving these\nmaterials by mail. If you elect electronic delivery 8\n\nof materials, you will receive an email at the address you provide us\nnotifying you of the availability of the materials and instructing you on how\nto view and act on them. In addition, you can review information about your\naccount online at any time at shareowneronline.com. Account statements\nprovide participants with records of their purchases and sales and other\nimportant information and should be retained for tax purposes.\n                                                              \n  16.  Will I receive stock certificates for my Plan shares?  \n                                                              \nEach share purchase is credited to your Plan account. Your account statement\nwill show the number of shares of Wells Fargo common stock, including any\nfractional share, credited to your account. You will not receive a\ncertificate for your Plan shares unless you request one (provided Wells Fargo\nis currently providing certificates). You can request a certificate (provided\nWells Fargo is currently providing certificates) by submitting your request\nin writing to the Plan Administrator (see Question 22). Certificates for\nfractional shares are never issued.\n                                          \n  17.  Can I deposit stock certificates?  \n                                          \nYes, you can deposit Wells Fargo stock certificates registered in your name\nat any time, including when you first enroll. To use this service, you must\nsend your certificates to the Plan Administrator with a properly completed\nTransaction Request Formattached to your statement (see Question 22).\nCertificated shares that you deposit with the Plan Administrator are credited\nto your Plan account and thereafter are treated as if they were acquired\nunder the Plan. You are responsible for maintaining your own records of the\ncost basis of certificated shares deposited with the Plan Administrator.\nPlease do not endorse your certificates prior to mailing.You are strongly\nurged to send your certificates by certified or registered mail, insuring\nthem for 5% of the current market value of the Wells Fargo common stock\nrepresented by the certificates. Regardless of the method used, you bear the\nfull risk of loss if the certificates are lost or stolen. Choosing\nregistered, express or certified mail alone will not provide you with full\nprotection if the certificates are lost or stolen. Replacement transaction\nfees may also apply. For questions regarding mailing in your certificates,\ncontact the Plan Administrator (see Question 22).\n                                                       \n  18.  Can I transfer my Plan shares to someone else?  \n                                                       \nYou can transfer your Plan shares to a Plan account of another person,\nsubject to compliance with any applicable laws. If the person to whom the\nshares are gifted or transferred is not a Plan participant, the Plan\nAdministrator will automatically open an account for the person and enroll\nhim or her in the Plan. To do this, simply execute a Stock Power Formand\nreturn it to the Plan Administrator. Your signature on the Stock Power\nFormmust be medallion guaranteed by an eligible financial institution or\nbroker. You can obtain a Stock Power Formonline at shareowneronline.comor by\ncalling the Plan Administrator. If you request to transfer all shares in your\nPlan account between a dividend record date and payment date, your transfer\nrequest will be processed and a separate dividend check will be mailed to the\nparticipant. You cannot pledge or grant a security interest in your Plan\nshares or transfer your Plan shares outside of the Plan unless certificates\nrepresenting the shares have been issued to you.\n                                      \n  19.  How do I sell my Plan shares?  \n                                      \nYou can sell some or all of your Plan shares by submitting the appropriate\ninformation on a Transaction Request Formor by submitting a written request\nto the Plan Administrator. If you have previously 9\n\nestablished automated privileges, you can sell the shares through\nshareowneronline.com(see Question 14) or by contacting the Plan Administrator\nby phone (see Question 22). You may instruct the Plan Administrator to sell\nshares under the Plan through a Batch Order, Market Order, Day Limit Order,\nGood-\u0091Til-Date/CanceledLimit Order or Stop Order. Batch Order (online,\ntelephone, mail)\u0096 Requests to sell shares are aggregated and the total of all\nshares are sold on the open market. Batch Order sale requests will be\ncompleted by the Plan Administrator no later than five (5) business days\nafter the request. The price per share sold will not be known until the sales\nare completed and will always be the weighted-average price for all shares\nsold for the Plan on the trade date. Once entered, a Batch Order request\ncannot be cancelled. Market Order (online or telephone)\u0096 During market hours,\nsale requests will be promptly submitted by the Plan Administrator to a\nbroker. The sale will be at the prevailing market price when the trade is\nexecuted. Once entered, a Market Order request cannot be canceled. Sale\nrequests submitted near the close of the market may be executed on the next\ntrading day, along with other requests received after market close. Day Limit\nOrder (online or telephone)\u0096 Sale requests for a Day Limit Order will be\npromptly submitted by the Plan Administrator to a broker. The sale will be\nexecuted when and if the stock reaches, or exceeds the specified price on the\nday the order was placed. The request will be automatically canceled if the\nprice is not met by the end of the trading day. Good-\u0091Til -Date/Canceled\n(GTD/GTC) Limit Order (online or telephone)\u0096 Requests to sell shares with a\nGTD and GTC Limit Order will be promptly submitted by the Plan Administrator\nto a broker. The sale will be executed when and if the stock reaches, or\nexceeds the specified price at any time while the order remains open (up to\nthe date requested or 90 days for GTC). The request is automatically canceled\nif the price is not met by the end of the order period. Stop Order (online or\ntelephone) \u0096Requests to sell shares will be promptly submitted by the Plan\nAdministrator to a broker for a Stop Order. The sale will be executed when\nthe stock reaches a specified price, at which time the order becomes a Market\nOrder and the sale will be at the prevailing market price when the trade is\nexecuted. The price specified in the order must be below the current market\nprice (generally used to limit a market loss). If you select a Batch Order,\nplease be aware:\n                                                                             \n      The Plan Administrator may match or offset your sale order against     \n      one or more purchase orders of other Plan                              \n      participants. If your sale order is offset against purchase orders,    \n      your sale proceeds are based on the weighted average price at which    \n      the net purchase order is filled.                                      \n                                                                             \n                                                                             \n      If the Plan Administrator does not offset your order, the independent  \n      agent executes the order on your behalf                                \n      in the open market or in a negotiated transaction. The independent     \n      agent may sell Plan shares to Wells Fargo. If the independent agent    \n      executes your order in the open market or in a negotiated              \n      transaction, the proceeds are based on the weighted                    \n      average price at which the shares are sold.                            \n                                                                             \nIf you wish to sell any shares currently held in certificate form, you may\nsend them in for deposit to your Plan account and then proceed with the sale.\nAfter settlement of the sale, the Plan Administrator will send you a check\nfor the proceeds of the sale net of brokerage commissions and transaction\nfees charged by the Plan Administrator or if you choose, you may have your\nproceeds, minus brokerage commissions and transaction fees, directly\ndeposited to your bank account. Refer to Question 6 for a discussion of\nbrokerage commissions and transaction fees. 10\n\nIf you submit a Transaction Request Formfrom your account statement to sell\nall or part of your Plan shares, and you are requesting the net proceeds to\nbe automatically deposited to a bank checking or savings account, you must\nprovide a voided blank check for a checking account or a blank savings\ndeposit slip for a savings account. If you are unable to provide a voided\ncheck or deposit slip, your written request must have your signature(s)\nmedallion guaranteed by an eligible financial institution for direct deposit.\nRequests for automatic deposit of net sale proceeds that do not provide the\nrequired documentation will not be honored and a check for the net proceeds\nwill be issued. The price of Wells Fargo common stock fluctuates on a daily\nbasis. The price may rise or fall after you submit your request to sell and\nprior to the ultimate sale of your shares. The price risk will be borne\nsolely by you. You cannot revoke your request to sell once it is made. The\nWells Fargo Insider Trading Policy provides that employees and affiliates of\nWells Fargo may not trade in Wells Fargo\u0092s common stock if in possession of\nmaterial, non-publicinformation about the company. Share sales by employees,\naffiliates and Section 16 officers must be made in compliance with Wells\nFargo\u0092s Insider Trading Policy.\n                                                          \n  20.  How can I terminate my participation in the Plan?  \n                                                          \nYou can terminate your participation in the Plan at any time by contacting\nthe Plan Administrator. You can submit your request for termination by\ntelephone or through the mail (see Question 22). For your convenience, a\nTransaction Request Formis attached to your statement. Complete the form by\nfilling in the required fields and indicating your intention to terminate\nyour participation in the Plan. Following termination, all future dividends\nwill be paid to you in cash. Retain shares\u0096 If you elect to keep your shares,\nthe whole shares held in your Plan account will be moved to book-entry DRS.\nAny fractional shares will be sold at the market price, and you will receive\na check (less any fees) for the proceeds. Sell shares\u0096 If you choose to sell\nall of your shares, your sale proceeds, less applicable withholding taxes and\ntransaction fees, will be remitted to you via check. You can also choose to\nhave them directly deposited into your bank account. If you terminate your\nparticipation in the Plan but do not indicate your preference to retain or\nsell your shares, the Plan shares will be moved to book-entry DRS form until\nthe Plan Administrator receives further instructions. If you have authorized\nrecurring automatic bank withdrawals, the Plan Administrator must receive\nyour request at least 15 business days before the next scheduled investment\ndate to ensure that the request is effective for that investment date. If\nyour request is received on or after a dividend record date but before the\ndividend payment date, your termination will be processed as soon as\nadministratively possible, and a separate dividend check will be mailed to\nyou. After termination, you can re-enrollin the Plan online or by submitting\na new Account Authorization Formand complying with all other enrollment\nprocedures (see Questions 3, 4, 5, and 6). To minimize unnecessary Plan\nadministrative costs and to encourage use of the Plan as a long-term\ninvestment vehicle, Wells Fargo reserves the right to deny participation in\nthe Plan to previous participants who Wells Fargo or the Plan Administrator\nbelieves have been excessive in their enrollment and termination.\n                                                                             \n  21.  Who is the Plan Administrator and what does the Plan Administrator    \n       do?                                                                   \n                                                                             \nEquiniti Trust Company, LLC (\u0093 EQ Shareowner Services\u0094) currently is the Plan\nAdministrator. 11\n\nThe Plan Administrator forwards participants\u0092 funds to the independent agent\nfor open market purchases. The Plan Administrator also keeps account records,\nsends account statements to participants and performs other administrative\nduties related to the Plan. The Plan Administrator is responsible for\npurchasing and selling Wells Fargo common stock for participants\u0092 Plan\naccounts, including the selection of the broker through which Plan\ntransactions are made. Neither Wells Fargo nor the Plan Administrator has any\ncontrol over the times or prices at which the independent agent purchases or\nsells Wells Fargo common stock in the open market.\n                                                 \n  22.  How do I contact the Plan Administrator?  \n                                                 \nInternet: shareowneronline.com Available 24 hours a day, 7 days a week for\naccess to your account information and answers for many common questions and\ngeneral inquiries. To register for online access: If you are an existing,\nregistered shareholder: 1. Go to shareowneronline.com 2. Click Registerthen I\nwant to register for online access 3. Select Wells Fargo & Companyand enter\nyour EQ Account Number 4. Select your Authentication* method 5. Follow the\nsteps to provide your information, create your secure profile, and access\nyour online account *If you need your Authentication ID to continue, select\nAuthentication IDand Please send my Authentication ID, then click Send ID.\nFor security, this number is required for first time sign on. If you are a\nnew investor: 1. Go to shareowneronline.com 2. Select Registerthen I want to\ninvest in a Company 3. Select Wells Fargo & Company 4. Select Invest in this\ncompany, and follow the instructions to buy shares Email Login to your\naccount at shareowneronline.comand select Contact Us. Telephone\n1-877-840-0492Toll-Free 651-450-4064outside the United States Customer Care\nSpecialists are available Monday through Friday, from 7:00 a.m. to 7:00 p.m.\nCentral Time. You may also access your account information 24 hours a day, 7\ndays a week using our automated voice response system. Written correspondence\nand deposit of certificated shares: EQ Shareowner Services P.O. Box 64856 St.\nPaul, MN 55164-0856 12\n\nCertified and overnight delivery EQ Shareowner Services 1110 Centre Pointe\nCurve, Suite 101 Mendota Heights, MN 55120-4100\n                                                                             \n  23.  What are the material U.S. federal income tax consequences of         \n       participating in the Plan?                                            \n                                                                             \nThe U.S. federal income tax consequences of participating in the Plan are as\nfollows:\n                                                                             \n      Cash dividends reinvested under the Plan are taxable to you as if      \n      they had been paid to you in cash on the                               \n      applicable dividend payment date. In addition, you may be treated as   \n      having received income in the amount of any brokerage commissions or   \n      other fees paid by Wells Fargo on your behalf.                         \n                                                                             \n                                                                             \n      The tax basis of shares purchased with reinvested dividends or         \n      optional cash investments generally is the                             \n      amount you paid to acquire the shares, including the amount of any     \n      brokerage commissions or other fees that you pay or that are paid by   \n      Wells Fargo on your behalf. Your holding period for shares purchased   \n      under the Plan generally will begin on the                             \n      day following the date on which those shares are credited to your      \n      Plan account.                                                          \n                                                                             \n                                                                             \n      You do not realize taxable income from the transfer of shares to your  \n      Plan account or from the withdrawal of                                 \n      whole shares from your Plan account. You will, however, generally      \n      realize gain or loss from the receipt of cash instead of any           \n      fractional Plan share. You will also realize gain or loss when your    \n      Plan shares are sold. The amount of the gain or loss                   \n      generally will be the difference between the amount you receive for    \n      the shares and the tax basis of the shares.                            \n                                                                             \n                                                                             \n      The Plan Administrator reports dividend income to participants and     \n      the Internal Revenue Service                                           \n      (\u0093IRS\u0094) on Form 1099-DIV and may report income in the amount of any      \n      brokerage commissions or other fees paid by Wells Fargo on your        \n      behalf on Form 1099-MISC. The Plan Administrator reports the           \n      proceeds from the sale of Plan shares to the selling participants and  \n      the IRS on Form 1099-B. The Plan Administrator reports dividend        \n      income to a foreign person (nonresident alien individual or foreign    \n      entity)                                                                \n      and the IRS on Form 1042-S.                                            \n                                                                             \n                                                                             \n      Dividends and sale proceeds are generally subject to federal backup    \n      withholding if you fail to certify a                                   \n      taxpayer identification number to the Plan Administrator. Any amount   \n      withheld as backup withholding tax will be allowable as a refund or    \n      credit against your U.S. federal income tax liability. Dividends       \n      payable to participants residing in certain                            \n      foreign countries may also be subject to federal withholding, as       \n      discussed below. In any case in which federal income taxes are         \n      required to be withheld, the Plan Administrator reinvests or pays to   \n      you, as the case may be, an amount equal to the                        \n      dividends or sale proceeds less the amount of tax withheld. For IRS    \n      reporting purposes, the amount of any dividend withheld is included    \n      in your dividend income.                                               \n                                                                             \nThis Plan assumes that each participant will use the first-in, first-out(\u0093\nFIFO\u0094) method when determining the tax basis of any shares sold. Participants\nmay designate their preference for a different method of determining the tax\nbasis of shares by identifying this preference in writing to the Plan\nAdministrator. Participants may designate their preference for specific\nidentification tax basis at any time. A foreign person (nonresident alien\nindividual or foreign entity) is subject to U.S. federal income tax\nwithholding at a 30% rate under Chapter 3 of the U.S. Internal Revenue Code\nof 1986, as amended, (\u0093 IRC\u0094) on the gross amount of certain payments of U.S.\nsource income including dividends, unless the beneficial owner of the payment\ndemonstrates that it is entitled to a reduced rate of, or exemption from,\nwithholding tax under an income tax treaty by providing the relevant Form\nW-8.Accounts owned by certain foreign entities that fail to comply with\nvarious U.S. information reporting and due diligence requirements (generally\nrelating to ownership by U.S. persons of interests in or accounts with those\nentities) under Chapter 4 of the IRC, frequently referred to as \u0093FATCA,\u0094 may\nbe subject to 30% withholding on all 13\n\napplicable U.S. sourced income, including dividends. An intergovernmental\nagreement between the United States and an applicable foreign country may\nmodify these requirements. Foreign persons\nshould consult with their tax advisors or counsel as to which tax\ncertification form they are required to provide and for more specific\ninformation regarding the withholding requirements under Chapters 3 and 4\n(FATCA) of the IRC.\n\nThe discussion above is only a summary of the important U.S. federal income\ntax consequences of your participation in the Plan. The summary is based on\nthe IRC, United States Treasury Regulations, administrative rulings and court\ndecisions, as in effect as of the date of this prospectus, all of which are\nsubject to change at any time, possibly with retroactive effect. This summary\nis not a complete description of all of the tax consequences of your\nparticipation in the Plan. For example, it does not address any state, local\nor foreign tax consequences of your participation. You should consult your\nown tax advisor about the tax consequences of your participation in the Plan.\n\n14\n\nOTHER PLAN INFORMATION\n\nStock Dividends, Stock Splits, and Distribution of Rights. Any stock\ndividends or stock splits distributed by Wells\nFargo on common stock held by the Plan Administrator for you will be credited\nto your account. Cash dividends paid on the shares issued as stock dividends\nor stock splits will be processed in accordance with the dividend\nreinvestment option you have\nelected.\n\nIf Wells Fargo makes available to its shareholders any rights to subscribe\nfor additional shares of common stock,\nthe rights to subscribe will be based on any shares held both in and outside\nof the Plan. Any new shares distributed by Wells Fargo resulting from the\nexercise of the rights will be issued directly to you.\n\nDividend and Voting Rights. Dividend and voting rights of shares purchased\nunder the Plan commence upon settlement of\nthe transaction. Shares purchased on or within one (1) business day prior to\na dividend record date are considered \u0093ex-dividend\u0094 and therefore not\nentitled to payment of that dividend.\n\nVoting of Plan Shares. You will receive voting materials and have the sole\nright to vote the Wells Fargo common stock\nrepresented by the shares held for you in the Plan. If you do not provide\ndirection for voting, the Plan shares will not be voted.\n\nYou are encouraged to read all voting materials carefully. Votes may be\nsubmitted online, by telephone or by returning a\nsigned, dated proxy card. Your shares will be voted in accordance with the\nmost recent submitted instructions.\n\nLimitation of Liability. The Plan Administrator, its nominee and Wells Fargo\nshall have no responsibility beyond the\nexercise of ordinary care for any action taken or omitted pursuant to the\nPlan, nor shall they have any duties, responsibilities or liabilities except\nsuch as are expressly set forth herein.\n\nIn administering the Plan, neither Wells Fargo, the Plan Administrator nor\nany broker selected by the Plan Administrator shall\nbe liable for any good faith act or omission to act, including, but not\nlimited to any claim of liability (i) arising out of the failure to terminate\na participant\u0092s account upon such participant\u0092s death prior to receipt of a\nnotice\nin writing of such death, (ii) with respect to the prices or times at which\ncommon stock are purchased or sold, or (iii) as to the value of the common\nstock acquired for participants. Buying and selling common stock are subject\nto\ninvestment risk. The price may fall or rise during the period between a\nrequest for investment or sale, its receipt by the Plan Administrator, and\nthe ultimate transaction in the open market. Any decision to purchase or sell\nsecurities through the\nPlan must be made by the participant based upon his or her own research and\njudgment. The price risk will be borne solely by the participant.\n\nThe Plan Administrator is acting solely as agent for Wells Fargo and owes no\nduties, fiduciary or otherwise, to any other\nperson by reason of this Plan, and no implied duties, fiduciary or otherwise,\nshall be read into this Plan. The Plan Administrator undertakes to perform\nsuch duties and only such duties as are expressly set forth herein, to be\nperformed by it, and\nno implied covenants or obligations shall be read into this Plan against the\nPlan Administrator or Wells Fargo.\n\nIn the\nabsence of negligence or willful misconduct on its part, the Plan\nAdministrator, whether acting directly or through agents or attorneys, shall\nnot be liable for any action taken, suffered, or omitted or for any error of\njudgment made by it in the\nperformance of its duties hereunder. In no event shall the Plan Administrator\nbe liable for special, indirect or consequential loss or damage of any kind\nwhatsoever (including but not limited to lost profit), even if the Plan\nAdministrator has been\nadvised of the likelihood of such loss or damage and regardless of the form\nof action.\n\nThe Plan Administrator shall:\n(i) not be required to and shall make no representations and have no\nresponsibilities as to the validity, accuracy, value or genuineness of any\nsignatures or endorsements, other than its own; and (ii) not be obligated to\ntake any legal\naction hereunder that might, in its judgment, involve any expense or\nliability, unless it has been furnished with reasonable indemnity.\n\nThe Plan Administrator shall not be responsible or liable for any failure or\ndelay in the performance of its obligations under\nthis Plan arising out of or caused, directly or indirectly, by circumstances\nbeyond its reasonable\n\n15\n\ncontrol, including, without limitation, acts of God; earthquakes; fires;\nfloods; wars; civil or military disturbances; sabotage; epidemics; riots;\ninterruptions, loss or malfunctions of\nutilities; computer (hardware or software) or communications services;\naccidents; labor disputes; acts of civil or military authority or\ngovernmental actions; it being understood that the Plan Administrator shall\nuse reasonable efforts which are\nconsistent with accepted practices in the stock investment plan industry to\nresume performance as soon as administratively possible under the\ncircumstances.\n\nThe Plan Administrator is authorized to choose a broker at its sole\ndiscretion to facilitate purchases and sales of Wells Fargo\ncommon stock by Plan participants. The Plan Administrator will furnish the\nname of the registered broker utilized in share transactions within a\nreasonable time upon written request from the participant.\n\nWells Fargo and the Plan Administrator may agree from time to time to\namendments and modifications of the Plan.\n\nThe Plan Administrator may, for various reasons, require a transaction\nrequest to be submitted in writing. Contact the Plan\nAdministrator (see Question 22) to determine if a particular request,\nincluding any sales request, must be submitted in writing.\n\nAny notice, instruction, request, election or direction that is required or\npermitted under the Plan shall become effective\nwhen received by the Plan Administrator. Such notice, instruction, request,\nelection or direction shall be mailed to the address set forth in this\nprospectus.\n\nExcept as otherwise expressly provided herein, participants may not sell,\npledge, hypothecate or otherwise assign or transfer\nthe participant\u0092s account any interest therein or any cash or shares credited\nto the participant\u0092s account. No attempt at any such sale, pledge,\nhypothecation or other assignment or transfer shall be effective. Nothing\nherein shall affect\na shareholder\u0092s rights in respect to shares for which certificate(s) have\nbeen received.\n\nThe Terms and Conditions of\nthe Plan and the Account Authorization Form and the Transaction Request\nFormshall be governed by the laws of the State of New York.\n\nWells Fargo reserves the right to interpret and regulate the Plan as it deems\nnecessary or advisable in connection with the\nPlan\u0092s operations. This means Wells Fargo can refuse to process participant\nrequested transactions to the extent Wells Fargo deems necessary or advisable\nto comply with applicable laws.\n\nModification or Termination of the Plan. Wells Fargo can suspend, modify or\nterminate the Plan at any time in whole or\nin part or with respect to participants in certain jurisdictions. Notice of\nany suspension, material modification or termination will be sent to all\naffected participants.\n\nDenial or Termination of Participation by Wells Fargo. At the direction of\nWells Fargo, the Plan Administrator may\nterminate a participant\u0092s participation in the Plan if the participant does\nnot own at least one full share in the participant\u0092s name or held through the\nPlan. Wells Fargo also reserves the right to deny, modify, suspend or\nterminate\nparticipation in the Plan by otherwise eligible persons to the extent Wells\nFargo deems it advisable or necessary in its discretion to comply with\napplicable laws or to eliminate practices that are not consistent with the\npurposes of the Plan.\nParticipants whose participation in the Plan is terminated will have their\nfull Plan shares converted to direct registration and will receive a check\nless any service fees and broker commissions for any fractional Plan share.\n\n16\n\nWHERE YOU CAN FIND MORE INFORMATION Registration Statement We have filed a\nregistration statement on Form S-3to register with the SEC the Wells Fargo\ncommon stock to be offered for purchase by Plan participants. This prospectus\nis part of that registration statement. The registration statement, including\nthe exhibits to the registration statement, contains additional relevant\ninformation about us and our common stock. As allowed by SEC rules, this\nprospectus does not contain all of the information you can find in the\nregistration statement or the exhibits to the registration statement. Wells\nFargo\u0092s SEC Filings We file annual, quarterly and current reports, proxy\nstatements and other information with the SEC. Our SEC filings are available\nto the public on the SEC\u0092s website at https://www.sec.gov. Information about\nus is also available on our website at https://www.wellsfargo.com.\nInformation on our website does not constitute part of, and is not\nincorporated by reference in, this prospectus. Information Incorporated by\nReference We \u0093incorporate by reference\u0094 into this prospectus the information\nwe file with the SEC, which means that we can disclose important information\nto you by referring you to those documents. The information incorporated by\nreference is an important part of this prospectus. Information that we file\nsubsequently with the SEC will automatically update this prospectus. In other\nwords, in the case of a conflict or inconsistency between information set\nforth in this prospectus and/or information incorporated by reference into\nthis prospectus, you should rely on the information contained in the document\nthat was filed later. We incorporate by reference the documents listed below\nand any filings we make with the SEC under Sections 13(a), 13(c), 14, or\n15(d) of the Exchange Act (i) after the initial filing of the registration\nstatement that contains this prospectus and prior to effectiveness of such\nregistration statement, and (ii) on or after the date of this prospectus and\nprior to the time that we sell all the securities offered by this prospectus\n(other than any documents or any portions of any documents that are not\ndeemed \u0093filed\u0094 under the Exchange Act in accordance with the Exchange Act and\napplicable SEC rules):\n                                                                             \n      Annual Report on Form                                                  \n      10-K for the year ended December                                       \n      31, 2023, including information specifically incorporated by           \n      reference into our Form 10-K from our 2023 Annual Report to            \n      Stockholders;                                                          \n ─────────────────────────────────────────────────────────────────────────── \n                                                                             \n                                                        \n      Current Reports on Form 8-K filed on January 12,  \n      2024, January                                     \n      23, 2024, January                                 \n      24, 2024, January                                 \n      25, 2024 and February 6, 2024; and                \n ────────────────────────────────────────────────────── \n                                                        \n                                                                             \n      Exhibit                                                                \n      99(e) to our Quarterly Report on Form 10-Q for the quarter ended       \n      March 31, 2003, which contains a description of Wells Fargo common     \n      stock, including any amendment or report filed to update such          \n      description.                                                           \n ─────────────────────────────────────────────────────────────────────────── \n                                                                             \nDocuments Available Without Charge\nFrom Wells Fargo Wells Fargo will\nprovide, without charge, copies of any\nreport incorporated by reference into\nthis prospectus, excluding exhibits\nother than those that are specifically\nincorporated by reference in this\nprospectus. You can obtain a copy of\nany document incorporated by reference\nby writing or calling Wells Fargo as\nfollows: Office of the Corporate\nSecretary Wells Fargo & Company Three\nWells Fargo Center 401 S. Tryon Street\nCharlotte, NC 28202 Phone: (704)\n374-3234 17\n\nUSE OF PROCEEDS\n\nWe will receive proceeds from\npurchases of our common stock through\nthe Plan only if the purchases are\nmade directly from us\nrather than by the independent agent\nin the open market. We are unable to\nestimate the aggregate amount of these\nproceeds. We will use any such\nproceeds for general corporate\npurposes.\n\nEXPERTS\n\nThe consolidated financial statements\nof Wells Fargo & Company and\nSubsidiaries as of December 31, 2023\nand 2022,\nand for each of the years in the\nthree-year period ended December 31,\n2023, and management\u0092s assessment of\nthe effectiveness of internal control\nover financial reporting as of\nDecember 31, 2023 have been\nincorporated by reference\nherein in reliance upon the reports of\nKPMG LLP, independent registered\npublic accounting firm, incorporated\nby reference herein, and upon the\nauthority of said firm as experts in\naccounting and auditing.\n\nLEGAL OPINIONS\n\nAnita Minicucci, Lead Counsel at Wells\nFargo has rendered an opinion\nregarding the legality of the shares\nof Wells Fargo common\nstock being offered pursuant to the\nPlan. Ms. Minicucci owns, or has the\nright to acquire, a number of shares\nof our common stock which represents\nless than 0.1% of the total\noutstanding common stock.\n\nINDEMNIFICATION\n\nAs permitted by law and Wells Fargo\u0092s\nRestated Certificate of Incorporation,\ndirectors and executive officers of\nWells\nFargo & Company are entitled to\nindemnification under certain\ncircumstances against liabilities and\nexpenses incurred in connection with\nlegal proceedings in which they become\ninvolved as a result of serving as\nsuch director and officer.\nInsofar as indemnification for\nliabilities arising under the\nSecurities Act of 1933 may be\npermitted to directors, officers or\npersons controlling Wells Fargo\npursuant to the foregoing provisions,\nWells Fargo has been informed that in\nthe opinion of\nthe SEC such indemnification is\nagainst public policy as expressed in\nthe Act and is, therefore,\nunenforceable.\n\n18\n\nWells Fargo & Company 420 Montgomery\nStreet San Francisco, California 94104\n1-866-249-3302 Wells Fargo Direct ®\nDirect Purchase and Dividend\nReinvestment Plan CUSIP# 949746101\nPROSPECTUS , 2024\n\nPART II INFORMATION NOT REQUIRED IN\nPROSPECTUS\n                                                          \n  Item 14.  Other Expenses of Issuance and Distribution.  \n                                                          \nThe following is an estimate, subject to future contingencies, of the\nexpenses to be incurred by the Registrant in connection with the issuance and\ndistribution of the securities being registered:\n                                                \n  SEC Registration Fee              $30,204.50  \n  Accounting Fees*                   30,000.00  \n  Printing and Mailing Expenses*     12,000.00  \n  Miscellaneous*                      6,000.00  \n  Total*                            $78,204.50  \n                                                \n*Estimated pursuant to instruction to Item 511 of Regulation S-K.\n                                                        \n  Item 15.  Indemnification of Directors and Officers.  \n                                                        \nSection 145 of the Delaware General Corporation Law authorizes\nindemnification of directors and officers of a Delaware corporation under\ncertain circumstances against expenses, judgments and the like in connection\nwith litigation. Article Fourteenth of the Registrant\u0092s Restated Certificate\nof Incorporation, as amended, provides for broad indemnification of directors\nand officers. Wells Fargo also maintains insurance coverage relating to\ncertain liabilities of directors and officers.\n                       \n  Item 16.  Exhibits.  \n                       \nThe exhibits to this Registration Statement are listed on the Exhibit Index\nto this Registration Statement, which Exhibit Index is hereby incorporated\nherein by reference.\n                           \n  Item 17.  Undertakings.  \n                           \n                                                      \n  (a)  The undersigned Registrant hereby undertakes:  \n                                                      \n                                                                             \n       To file, during any period in which offers or sales are being made,   \n  (1)  a post-effective amendment to this                                    \n       Registration Statement:                                               \n                                                                             \n                                                                             \n  (i)  To include any prospectus required by Section 10(a)(3) of the         \n       Securities Act of 1933;                                               \n                                                                             \n                                                                             \n        To reflect in the prospectus any facts or events arising after the   \n        effective date of the Registration                                   \n        Statement (or the most recent post-effective amendment thereof)      \n        which, individually or in the aggregate, represent a fundamental     \n        change in the information set forth in the Registration Statement.   \n        Notwithstanding the foregoing, any increase or                       \n        decrease in volume of securities offered (if the total dollar value  \n  (ii)  of securities offered would not exceed that which was registered)    \n        and any deviation from the low or high end of the estimated maximum  \n        offering range may be reflected in the form of                       \n        prospectus filed with the Commission pursuant to Rule 424(b) if, in  \n        the aggregate, the changes in volume and price represent no more     \n        than a 20 percent change in the maximum aggregate offering price     \n        set forth in the \u0093Calculation of Filing                               \n        Fee Table\u0094 in the effective Registration Statement;                   \n                                                                             \n                                                                             \n         To include any material information with respect to the plan of     \n  (iii)  distribution not previously disclosed in the                        \n         Registration Statement or any material change to such information   \n         in the Registration Statement;                                      \n                                                                             \nprovided, however,that paragraphs (a)(1)(i), (a)(1)(ii) and (a)(1)(iii) do\nnot apply if the information required to be included in a post-effective\namendment by those paragraphs is contained in reports filed with or furnished\nto the Commission by the Registrant pursuant to section 13 or section15(d) of\nthe Securities Exchange Act of 1934 that are incorporated by reference in the\nRegistration Statement, or is contained in a form of prospectus filed\npursuant to Rule 424(b) that is part of the Registration Statement. II-1\n                                                                             \n       That, for the purpose of determining any liability under the          \n       Securities Act of 1933, each such                                     \n  (2)  post-effective amendment shall be deemed to be a new Registration     \n       Statement relating to the securities offered therein, and the         \n       offering of such securities at that time shall be deemed to be the    \n       initial bona fide offering thereof.                                   \n                                                                             \n                                                                             \n       To remove from registration by means of a post-effective amendment    \n  (3)  any of the securities being registered                                \n       which remain unsold at the termination of the offering.               \n                                                                             \n                                                                             \n  (4)  That, for the purpose of determining liability under the Securities   \n       Act of 1933 to any purchaser:                                         \n                                                                             \n                                                                             \n       Each prospectus filed by the Registrant pursuant to Rule 424(b)(3)    \n  (i)  shall be deemed to be part of the                                     \n       Registration Statement as of the date the filed prospectus was        \n       deemed part of and included in the Registration Statement; and        \n                                                                             \n                                                                             \n        Each prospectus required to be filed pursuant to Rule 424(b)(2),     \n        (b)(5), or (b)(7) as part of a Registration                          \n        Statement in reliance on Rule 430B relating to an offering made      \n        pursuant to Rule 415(a)(1)(i), (vii), or (x) for the purpose of      \n        providing the information required by Section 10(a) of the           \n        Securities Act of 1933 shall be deemed to be                         \n        part of and included in the Registration Statement as of the         \n        earlier of the date such form of prospectus is first used after      \n        effectiveness or the date of the first contract of sale of           \n        securities in the offering described in the prospectus. As           \n        provided in Rule 430B, for liability purposes of the issuer and any  \n        person that is at that date an underwriter, such date shall be       \n        deemed to be a new effective date of the Registration Statement      \n  (ii)  relating to the securities in the Registration                       \n        Statement to which that prospectus relates, and the offering of      \n        such securities at that time shall be deemed to be the initial bona  \n        fide offering thereof. Provided, however, that no statement made in  \n        a Registration Statement or                                          \n        prospectus that is part of the Registration Statement or made in a   \n        document incorporated or deemed incorporated by reference into the   \n        Registration Statement or prospectus that is part of the             \n        Registration Statement will, as to a purchaser with a time           \n        of contract of sale prior to such effective date, supersede or       \n        modify any statement that was made in the Registration Statement or  \n        prospectus that was part of the Registration Statement or made in    \n        any such document immediately prior to such                          \n        effective date.                                                      \n                                                                             \n                                                                             \n       That, for the purpose of determining liability of the Registrant      \n  (5)  under the Securities Act of 1933 to any                               \n       purchaser in the initial distribution of the securities:              \n                                                                             \nThe undersigned Registrant undertakes that in a primary offering of\nsecurities of the undersigned Registrant pursuant to this Registration\nStatement, regardless of the underwriting method used to sell the securities\nto the purchaser, if the securities are offered or sold to such purchaser by\nmeans of any of the following communications, the undersigned Registrant will\nbe a seller to the purchaser and will be considered to offer or sell such\nsecurities to such purchaser:\n                                                                             \n       Any preliminary prospectus or prospectus of the undersigned           \n  (i)  Registrant relating to the offering required to                       \n       be filed pursuant to Rule 424;                                        \n                                                                             \n                                                                             \n        Any free writing prospectus relating to the offering prepared by or  \n  (ii)  on behalf of the undersigned Registrant                              \n        or used or referred to by the undersigned Registrant;                \n                                                                             \n                                                                             \n         The portion of any other free writing prospectus relating to the    \n  (iii)  offering containing material information                            \n         about the undersigned Registrant or its securities provided by or   \n         on behalf of the undersigned Registrant; and                        \n                                                                             \n                                                                             \n        Any other communication that is an offer in the offering made by     \n  (iv)  the undersigned Registrant to the                                    \n        purchaser.                                                           \n                                                                             \n                                                                             \n       The undersigned Registrant hereby undertakes that, for purposes of    \n       determining any liability under the                                   \n  (b)  Securities Act of 1933, each filing of the Registrant\u0092s annual report  \n       pursuant to Section 13(a) or Section 15(d) of the Securities          \n       Exchange Act of 1934 (and, where applicable, each filing of an        \n       employee                                                              \n                                                                             \nII-2\n                                                                             \n  benefit plan\u0092s annual report pursuant to Section 15(d) of the Securities    \n  Exchange Act of 1934) that is incorporated by reference in the             \n  Registration Statement shall be deemed to be a                             \n  new Registration Statement relating to the securities offered therein,     \n  and the offering of such securities at that time shall be deemed to be     \n  the initial bona fide offering thereof.                                    \n                                                                             \n                                                                             \n       Insofar as indemnification for liabilities arising under the          \n       Securities Act of 1933 may be permitted to                            \n       directors, officers, and controlling persons of the Registrant        \n       pursuant to the foregoing provisions, or otherwise, the Registrant    \n       has been advised that in the opinion of the Securities and Exchange   \n       Commission such indemnification is against public                     \n       policy as expressed in the Securities Act of 1933 and is, therefore,  \n       unenforceable. In the event that a claim for indemnification against  \n       such liabilities (other than the payment by the Registrant of         \n  (c)  expenses incurred or paid by a director, officer,                     \n       or controlling person of the Registrant in the successful defense of  \n       any action, suit or proceeding) is asserted by such director,         \n       officer, or controlling person in connection with the securities      \n       being registered, the Registrant will, unless in the                  \n       opinion of its counsel the matter has been settled by controlling     \n       precedent, submit to a court of appropriate jurisdiction the          \n       question whether such indemnification by it is against public policy  \n       as expressed in the Securities Act of 1933 and will                   \n       be governed by the final adjudication of such issue.                  \n                                                                             \nII-3\n\nEXHIBIT INDEX\n                                                                             \n                    Description                                              \n                    Restated Certificate of                                  \n                    Incorporation                                            \n                    of Wells Fargo (incorporated                             \n                    by reference to Exhibit 3(a)                             \n                    to Wells Fargo\u0092s Quarterly                                \n                    Report on Form 10-Q for the                              \n                    quarter ended September 30,                              \n                    2023 filed October 31, 2023)                             \n                    By-Laws of Wells Fargo                                   \n                    (incorporated by reference                               \n                    to Exhibit 3.1 to Wells                                  \n  Exhibit Number    Fargo\u0092s Current Report on                                 \n  4(a)              Form 8-K filed January 24,      Form of                  \n  4(b)              2024)                           Filing                   \n ─────────────────────────────────────────────────────────────────────────── \n                    Opinion of Anita Minicucci,                              \n  5                 Lead Counsel, Wells Fargo       Electronic Transmission  \n                    Legal Department                                         \n  23(a)             Consent of Anita Minicucci      Electronic Transmission  \n                    (included in Exhibit 5)                                  \n  23(b)             Consent of KPMG LLP             Electronic Transmission  \n  24                Powers of Attorney              Electronic Transmission  \n  107               Filing Fee Table                Electronic Transmission  \n                                                                             \nE-1\n\nSIGNATURES Pursuant to the requirements of the Securities Act of 1933, the\nRegistrant certifies that it has reasonable grounds to believe that it meets\nall of the requirements for filing on Form S-3and has duly caused this\nRegistration Statement to be signed on its behalf by the undersigned,\nthereunto duly authorized, in the City of New York, State of New York, on\nFebruary 28, 2024.\n                                                                     \n       WELLS FARGO & COMPANY                                         \n  By:                         /s/ Charles W. Scharf                  \n                              Charles W. Scharf                      \n                              President and Chief Executive Officer  \n                                                                     \nPursuant to the requirements of the Securities Act of 1933, this Registration\nStatement has been signed on February 28, 2024 by the following persons in\nthe capacities with Wells Fargo & Company indicated:\n                                                                             \n  /s/ Charles W. Scharf          President and Chief Executive Officer       \n  Charles W. Scharf              (Principal Executive Officer)               \n  /s/ Michael P. Santomassimo    Senior Executive Vice President and Chief   \n  Michael P. Santomassimo        Financial Officer                           \n                                 (Principal Financial Officer)               \n  /s/ Muneera S. Carr            Executive Vice President, Chief Accounting  \n  Muneera S. Carr                Officer and Controller                      \n                                 (Principal Accounting Officer)              \n                                                                             \n                                                                    \n  STEVEN D. BLACK            )                                      \n  MARK A. CHANCY             )                                      \n  CELESTE A. CLARK           )                                      \n  THEODORE F. CRAVER, JR.    )                                      \n  RICHARD K. DAVIS           )                                      \n  WAYNE M. HEWETT            )    All of the Board of Directors of  \n  CECELIA G. MORKEN          )    Wells Fargo & Company*            \n  MARIA R. MORRIS            )                                      \n  FELICIA F. NORWOOD         )                                      \n  RICHARD B. PAYNE, JR.      )                                      \n  RONALD L. SARGENT          )                                      \n  CHARLES W. SCHARF          )                                      \n  SUZANNE M. VAUTRINOT       )                                      \n                                                                    \n*Charles W. Scharf, by signing his name hereto, does hereby sign this\ndocument on behalf of each of the directors named above pursuant to powers of\nattorney duly executed by the directors named and filed with the Securities\nand Exchange Commission on behalf of such directors.\n                         \n  /s/ Charles W. Scharf  \n  Charles W. Scharf      \n  Attorney-in-Fact       \n                         \n"
}