{
  "title": "76% of Gen Z Canadians expecting a tax return are ready to invest it but many are unsure how TFSAs fit in",
  "url": "https://td.mediaroom.com/2025-04-23-76-of-Gen-Z-Canadians-expecting-a-tax-return-are-ready-to-invest-it-but-many-are-unsure-how-TFSAs-fit-in",
  "date": "",
  "short_description": "",
  "content": "New TD survey reveals nearly a third of Gen Z still unclear on TFSAs, potentially missing out on long-term, tax-free growth\nTORONTO\n,\nApril 23, 2025\n/CNW/ - As tax refunds land in Canadians' bank accounts, a new TD survey reveals that Gen Z is leading the charge when it comes to investing their returns—but many may be leaving money on the table.\nAccording to the survey, three-quarters\n(76 per cent)\nof Gen Z Canadians expecting a tax return this year say they plan to invest it, outpacing both Millennials\n(60 per cent)\nand Gen X (\n48 per cent\n). Yet despite this enthusiasm, only half\n(51 per cent)\nsay they have a TFSA (Tax-Free Savings Account) and among those that don't, nearly one-third\n(30 per cent)\nsay it's because they don't understand how it works – a knowledge gap that could potentially be costing them valuable growth opportunities.\n\"A TFSA isn't just a savings account—it's a gateway to long-term, tax-free growth,\" says\nPat Giles\n, Vice President, Saving & Investing Journey at TD. \"For young Canadians, the earlier you start, the more powerful the impact. Even small, consistent contributions can build serious financial confidence over time, making sure your money is working as hard as you are.\"\nEconomic pressures are pushing Canadians to rethink their financial and investment strategies.\nTD's survey also finds that\n90 per cent\nof Canadians are shifting their financial strategies in response to external pressures—like inflation and rising costs of living. Two-thirds\n(67 per cent)\nsay those pressures are directly impacting how they'll use their tax refund this year.\nAmong Canadians expecting a tax return:\n53 per cent\nplan to invest their refund in their future;\n44 per cent\nwill contribute to a TFSA;\n31 per cent\nwill add to an RRSP.\nBut among those without a TFSA, the barriers are clear:\n51 per cent\nsay they don't have enough money to contribute;\n20 per cent\ncite confusion about how TFSAs work;\n14 per cent\nprefer other savings vehicles.\nGiles emphasizes that a TFSA doesn't require a big upfront investment. \"You don't need thousands of dollars to get started. Even small contributions add up and they grow tax-free. Speaking with a TD Personal Banker can help make it feel manageable and aligned to your financial goals.\"\nTFSAs: More than a piggy bank\nCurrent TFSA holders are using the account in diverse ways:\n29 per cent\nuse it for both short-term savings and long-term investing;\n28 per cent\nfocus on long-term growth (e.g., retirement);\n21 per cent\nprioritize tax-efficient investing;\n18 per cent\nuse it as a short-term savings tool.\nUnderstanding your investing options\nNo matter how Canadians are looking to invest in their future, having the right information is key to making confident financial decisions. TD offers a range of tools and resources to help Canadians learn more about TFSAs and other investment options including:\nBooking an appointment with a\nTD Personal Banker\nfor personalized guidance on saving and investing strategies.\nUsing\nTD Goal Builder\n, where a TD Personal Banker can provide personalized investment advice to help customers work toward their financial goals.\nThe\nTD Ready Advice Hub\nwhich has information and articles available on a variety of financial topics and investing.\nWith tax season in full swing, the message is clear: Gen Z is ready to take control of their financial future—but understanding the tools available is key to making the most of every dollar.\nAbout TD Bank Group\nThe Toronto-Dominion Bank and its subsidiaries are collectively known as TD Bank Group (\"TD\" or the \"Bank\"). TD is the sixth largest bank in North America by assets and serves over 27.9 million customers in four key businesses operating in a number of locations in financial centres around the globe: Canadian Personal and Commercial Banking, including TD Canada Trust and TD Auto Finance Canada; U.S. Retail, including TD Bank, America's Most Convenient Bank®, TD Auto Finance U.S., and TD Wealth (U.S.); Wealth Management and Insurance, including TD Wealth (Canada), TD Direct Investing, and TD Insurance; and Wholesale Banking, including TD Securities and TD Cowen. TD also ranks among the world's leading online financial services firms, with more than 17 million active online and mobile customers. TD had\n$2.09 trillion\nin assets on\nJanuary 31, 2025\n. The Toronto-Dominion Bank trades under the symbol \"TD\" on the\nToronto\nand New York Stock Exchanges.\nAbout the TD Survey\nThis survey was undertaken by\nThe Harris Poll Canada\n. It ran overnight on\nMarch 21\nst\n, 2025, with 1,544 randomly selected Canadian adults who are\nMaru Voice Canada\nonline panellists. The results have been weighted by age, gender, region and education (and in\nQuebec\n, language) to match the population, according to census data. This is to ensure the sample is representative of the entire adult population of Canada. For comparison purposes, a probability sample of this size has an estimated margin of error (which measures sampling variability) of ±2.5per cent, 19 times out of 20. Discrepancies in or between totals when compared to the data tables are due to rounding.\nSOURCE  TD Canada Trust",
  "id": "2025-04-23-76-of-Gen-Z-Canadians-expecting-a-tax-return-are-ready-to-invest-it-but-many-are-unsure-how-TFSAs-fit-in",
  "company": "Toronto-Dominion Bank Group",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "td",
  "raw_content_type": "html"
}