{
  "title": "TD Asset Management Inc. and iCapital Network Canada Ltd. have collaborated to bring a Global Infrastructure strategy to eligible Canadian accredited investors",
  "url": "https://td.mediaroom.com/2025-05-07-TD-Asset-Management-Inc-and-iCapital-Network-Canada-Ltd-have-collaborated-to-bring-a-Global-Infrastructure-strategy-to-eligible-Canadian-accredited-investors",
  "date": "",
  "short_description": "",
  "content": "New iCapital fund provides access to a portfolio of direct private infrastructure assets\nTORONTO\n,\nMay 7, 2025\n/CNW/ - TD Asset Management Inc. (\"TDAM\") today announced a new way for investors to access private global infrastructure investments. Eligible Canadian accredited investors will now have access to TDAM's institutionally available infrastructure strategy, the TD Greystone Infrastructure Fund (\nCanada\n) L.P. (the \"Institutional Fund\"), through a collaboration with iCapital Network Canada Ltd. (\"iCapital\nCanada\n\"), a global financial technology platform driving access to alternative investments for the wealth and asset management industries. The\nTD Greystone Infrastructure iCapital Canada Access Fund\n(the \"Access Fund\"), managed by iCapital\nCanada\n, invests substantially all its assets in TDAM's Institutional Fund and is available to eligible Canadian accredited investors.\nPrivate Infrastructure is a growing part of institutional and high-net-worth portfolios that can provide diversification benefits, enhanced returns, lower volatility and inflation protection. TDAM's Institutional Fund has a 10+ year track record and a portfolio of private infrastructure assets with over 500 projects across 7 countries. The Institutional Fund invests in infrastructure that delivers essential services for an economy offering accredited investors potential stability and growth during times of uncertainty and over the long-term.\n\"At a time of global uncertainty, we are excited to work with iCapital to provide access to our institutional portfolio of infrastructure assets to eligible Canadian accredited investors and advisor-led market. We have been managing the Institutional Fund for more than 10 years and have built a high-quality portfolio of private infrastructure that can provide inflation protection, long-term contracted revenues and diversification, benefiting client portfolios. We believe this structure allows retail investors to participate alongside institutions with the same underlying infrastructure portfolio and assets,\" said\nJeffrey Mouland\n, Managing Director, Head of Global Infrastructure Investments, TDAM.\n\"We're thrilled to collaborate with TDAM to provide eligible Canadian accredited investors with easy and transparent access to alternatives,\" said Tom Johnston, Managing Director, Head of Client Solutions Canada at iCapital. \"This collaboration solidifies iCapital's position as a trusted technology partner to deliver a comprehensive digital investing experience for\nCanada's\nleading wealth advisors and asset managers.\"\nTDAM's infrastructure investment team takes a hands-on approach to provide a portfolio of operating infrastructure, with potential for long-term revenues and inflation protection. They have significant experience in private infrastructure and actively manage the portfolio through oversight of development, construction, and procurement activities, board representation, as well as financing. The Access Fund provides access to the Institutional Fund which provides diversification across each of these projects and creates what we believe is an attractive allocation to the infrastructure asset class for investment portfolios.\nThe TD Greystone Infrastructure Fund is comprised of the TD Greystone Infrastructure Fund (Global Master) SCSp, the TD Greystone Infrastructure Fund (\nCanada\n) L.P., the TD Greystone Infrastructure Fund (\nCanada\n) L.P. II, the TD Greystone Infrastructure Fund (Cayman Feeder) L.P. and the TD Greystone Infrastructure Fund (Luxembourg Feeder) SCSp. Each of the Feeder Funds act as a feeder fund in a master-feeder structure and invests all or substantially all of its assets in the TD Greystone Infrastructure Fund (Global Master) SCSp. The Master Fund is priced monthly in USD and includes any working capital within the Master Fund, as well as the current USD value of the most recent valuation of the underlying investments. Valuations of the investments held in the Master Fund are done on a quarterly basis in the local currency of the investment. Interim valuations may be done as the result of specific situations. At each monthly pricing period, the investment valuations are converted to USD at the rate in effect of the pricing date. Effective\nFebruary 1, 2024\n, the Master Fund redomiciled from the\nCayman Islands\nto\nLuxembourg\n. Historical performance prior to that time reflects the performance of the TD Greystone Infrastructure Fund (Global Master) L.P. Thereafter, the performance reflects the TD Greystone Infrastructure Fund (Global Master) SCSp. The Feeder Funds are priced monthly in U.S. dollars and include working capital held within the Feeder Funds as well as the updated monthly value of the units held in the Master Fund. The value of the Feeder Funds investment in the Master Fund is determined based on the updated monthly price of the Master Fund.\n®The TD logo and other TD trademarks are the property of The Toronto-Dominion Bank or its subsidiaries.\nAbout TD Asset Management Inc.\nTD Asset Management Inc. (\"TDAM\"), a member of TD Bank Group, is a North American investment management firm. TDAM offers investment solutions to corporations, pension funds, endowments, foundations and individual investors. Additionally, TDAM manages assets on behalf of almost 2 million retail investors and offers a broadly diversified suite of investment solutions including mutual funds, professionally managed portfolios and corporate class funds. Asset management businesses at TD manage\n$496 billion\nin assets. Aggregate statistics are as of\nMarch 31, 2025\nfor TDAM and Epoch Investment Partners, Inc. TDAM operates in\nCanada\nand Epoch Investment Partners, Inc. operates in\nthe United States\n. Both entities are affiliates and are wholly-owned subsidiaries of The Toronto-Dominion Bank.\nAbout iCapital\niCapital powers the world's alternative investment marketplace, offering a complete suite of tools, end-to-end enterprise solutions, data management and distribution capabilities, and an innovative operating system. iCapital is the trusted technology partner to financial advisors, wealth managers, asset managers, as well as other participants in this ecosystem, and offers unrivaled access, technology, and education to incorporate alternative assets into core portfolio strategies for their clients. As of\nFebruary 28, 2025\n, iCapital had USD\n$880 billion\nof global volume activity on its platform.\nFor more information, visit\nhttps://icapital.com\n| Twitter (X):\n@icapitalnetwork\n| LinkedIn:\nhttps://www.linkedin.com/company/icapital-network-inc/\nIMPORTANT INFORMATION\nThis announcement does not constitute an offer to sell or the solicitation of an offer to buy any securities nor shall there be any sale of securities in any jurisdiction in which any offer, solicitation or sale would be unlawful prior to registration or qualification of such securities under the securities laws of any such jurisdiction.\n\"iCapital\" and \"iCapital Network\" are registered trademarks of Institutional Capital Network, Inc. Additional information is available upon request.\n© 2025 Institutional Capital Network, Inc. All Rights Reserved.\nSOURCE  TD Asset Management Inc.",
  "id": "2025-05-07-TD-Asset-Management-Inc-and-iCapital-Network-Canada-Ltd-have-collaborated-to-bring-a-Global-Infrastructure-strategy-to-eligible-Canadian-accredited-investors",
  "company": "Toronto-Dominion Bank Group",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "td",
  "raw_content_type": "html"
}