{
  "title": "TD Auto Finance Canada Achieves its Eighth Consecutive J.D. Power Award: Thank You to Clients and Colleagues",
  "url": "https://td.mediaroom.com/2025-05-06-TD-Auto-Finance-Canada-Achieves-its-Eighth-Consecutive-J-D-Power-Award-Thank-You-to-Clients-and-Colleagues",
  "date": "",
  "short_description": "",
  "content": "R\nanked\n#1 in Dealer Satisfaction among Non-Captive Non-Prime Lenders with Retail Credit\nTORONTO\n,\nMay 6, 2025\n/CNW/ - TD Auto Finance Canada (TDAF) is proud to be named #1 in Dealer Satisfaction among Non-Captive Non-Prime Lenders with Retail Credit in the J.D. Power 2025 Canada Dealer Financing Satisfaction Study. For two years in a row, TDAF won two Dealer Satisfaction segments, and has now achieved its eighth consecutive J.D. Power award in the non-captive non-prime segment.\nJ.D. Power, the premier source of benchmark ratings, has been leveraging its methodology to provide unbiased, independent ratings since 1968. The automotive benchmark study, now in its 27\nth\nyear, captures responses from 5,974 finance evaluations across three segments, all from new-vehicle dealerships in\nCanada\nand was fielded in\nFebruary 2025\n.\n\"At TDAF, our clients are at the centre of everything we do. I am exceptionally proud of this team and the results we have achieved together,\" said\nMichael McGhee\n, Senior Vice President and Head, TD Auto Finance Canada. \"Achieving our eighth consecutive J.D. Power award is remarkable, and I want to offer a wholehearted and sincere thank you to all our clients for their trust.\"\nThe Canada Dealer Financing Satisfaction Study measures satisfaction across four factors with TD ranking first for all factors including finance provider offerings, funding process, credit staff relationships, and sales representative relationship.\nAbout TD Bank Group\nThe Toronto-Dominion Bank and its subsidiaries are collectively known as TD Bank Group (\"TD\" or the \"Bank\"). TD is the sixth largest bank in North America by assets and serves over 27.9 million customers in four key businesses operating in a number of locations in financial centres around the globe: Canadian Personal and Commercial Banking, including TD Canada Trust and TD Auto Finance Canada; U.S. Retail, including TD Bank, America's Most Convenient Bank®, TD Auto Finance U.S., and TD Wealth (U.S.); Wealth Management and Insurance, including TD Wealth (\nCanada\n), TD Direct Investing, and TD Insurance; and Wholesale Banking, including TD Securities and TD Cowen. TD also ranks among the world's leading online financial services firms, with more than 17 million active online and mobile customers. TD had $2.09 trillion in assets on January 31, 2025. The Toronto-Dominion Bank trades under the symbol \"TD\" on the Toronto and New York Stock Exchanges.\nAbout J.D. Power\nJ.D. Power\nis a global leader in consumer insights, advisory services, and data and analytics. A pioneer in the use of big data, artificial intelligence (AI) and algorithmic modeling capabilities to understand consumer behaviour, J.D. Power has been delivering incisive industry intelligence on customer interactions with brands and products for more than 55 years. The world's leading businesses across major industries rely on J.D. Power to guide their customer-facing strategies.\nJ.D. Power has offices in\nNorth America\n,\nEurope\nand\nAsia Pacific\n. To learn more about the company's business offerings, visit\nJDPower.com/business\n.\nSOURCE  TD Bank Group",
  "id": "2025-05-06-TD-Auto-Finance-Canada-Achieves-its-Eighth-Consecutive-J-D-Power-Award-Thank-You-to-Clients-and-Colleagues",
  "company": "Toronto-Dominion Bank Group",
  "year": "",
  "quarter": "",
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "td",
  "raw_content_type": "html"
}