{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-06-13",
  "accession_number": "0001193125-24-160404",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-160404-index.html",
  "text": "SPDR ®SERIES TRUST\n\nSPDR Bloomberg Emerging Markets USD Bond ETF\n\n(the \u0093Fund\u0094)\n\nSupplement dated June 13, 2024 to the Prospectus, Summary Prospectus and Statement of Additional Information\n(\u0093SAI\u0094), each dated\nOctober 31, 2023, as may be supplemented from time to time.\n\nEffective immediately, James Kramer and Joanna Madden are replaced as portfolio managers of the Fund by\nRobert Golcher. Accordingly, effective immediately, the Prospectus, Summary Prospectus and SAI are revised\nas follows:\n                                                                                                            \n      All references to James Kramer and Joanna Madden as portfolio managers of the Fund in the             \n  1)  Prospectus,                                                                                           \n      Summary Prospectus and SAI are deleted.                                                               \n                                                                                                            \n                                                                                                        \n  2)  The \u0093PORTFOLIO MANAGERS\u0094 section for the Fund beginning on page 27 of the Prospectus and page 5 of  \n      the Summary Prospectus is deleted and replaced with the following:                                \n                                                                                                        \nThe professionals primarily responsible for the day-to-day management of the Fund are Jennifer Taylor,\nRobert Golcher and Kheng Siang Ng. Ms. Taylor and Mr. Golcher are part of State Street Global Advisors\nLimited\n(\u0093SSGA LTD\u0094), an affiliate of the Adviser, and provide portfolio management services through a personnel-\nsharing arrangement between the Adviser and SSGA LTD. Mr. Ng is part of State Street Global Advisors\nSingapore Limited\n(\u0093SSGA Singapore\u0094), an affiliate of the Adviser, and provides portfolio management services through a\npersonnel-sharing arrangement between the Adviser and SSGA Singapore.\n\nJennifer Taylor is the Head of Emerging Market Debt and a Senior Portfolio Manager in the Global Fixed\nIncome Beta Solutions Group at SSGA LTD.\nShe joined SSGA LTD in 2022.\n\nRobert Golcher is a Vice President and a Senior Portfolio Manager in the Fixed Income Beta Solutions Team at\nSSGA LTD. He joined SSGA LTD in 2013.\n\nKheng Siang Ng, CFA, is a Vice President, the Asia Pacific Head of the Fixed Income Beta\nSolutions Team at SSGA Singapore, and the Head of SSGA Singapore. He joined SSGA Singapore in 2005.\n                                                                                                            \n      The \u0093Portfolio Managers\u0094 table on page 157 of the Prospectus and beginning on page 48 of the SAI        \n  3)  is revised in accordance with the Fund\u0092s new portfolio management team listed in item 2 above. In      \n      addition, the following biography for Mr. Golcher is added beneath the portfolio managers table on    \n      page 157 of the Prospectus:                                                                           \n                                                                                                            \nRobert Golcher is a Vice President and a Senior Portfolio Manager on the Emerging Markets Debt Team within\nthe Fixed\nIncome Beta Solutions Team at SSGA LTD. He joined SSGA LTD in 2013 after eleven years at the Bank of\nEngland, where he worked in a variety of roles associated with the management of the UK\u0092s Foreign Exchange\nReserves. Initially at SSGA LTD, he\nmanaged portfolios in the Rates and Aggregate space prior to moving on to manage Emerging Markets Debt in\n2016. Mr. Golcher holds a Bachelor of Science in Economics from the University of Nottingham and the\nInvestment Management Certificate\n(IMC).\n                                                                                                   \n      The following is added to the \u0093Other Accounts Managed as of June 30, 2023\u0094 table beginning on  \n  4)  page 50 of the SAI:                                                                          \n ───────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                   \n                                                                                                            \n                                           Other                                                            \n             Registe…                     Pooled                                                     Total  \n             Investm…         Assets    Investm…         Assets                     Assets          Assets  \n  Portfo…     Company        Managed     Vehicle        Managed       Other        Managed         Managed  \n  Manager    Accounts       (billio…    Accounts       (billio…    Accounts       (billio…       (billion…  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n  Robert                                                                                                    \n  Golche…           1    $      1.87           2    $      1.71           3    $      1.62    $       5.20  \n  \u0086,\u0086\u0086\u0086                                                                                                         \n                                                                                                            \n                                                                          \n  *  There are no performance-based fees associated with these accounts.  \n                                                                          \n                                                                   \n    Information for Mr. Golcher is provided as of April 30, 2024.  \n ───────────────────────────────────────────────────────────────── \n                                                                   \n                                                                                                            \n    Mr. Golcher is part of SSGA LTD and provides portfolio management services to the SPDR Bloomberg        \n    Emerging                                                                                                \n    Markets USD Bond ETF through a personnel-sharing arrangement between the Adviser and SSGA LTD.          \n                                                                                                            \n                                                                                        \n    As of April 30, 2024, Mr. Golcher did not beneficially own any shares of the Fund.  \n ────────────────────────────────────────────────────────────────────────────────────── \n                                                                                        \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE\n\n061324SUPP1\n"
}