{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-08-20",
  "accession_number": "0001193125-24-203463",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-203463-index.html",
  "text": "Important Notice Regarding Change in Benchmark Index SPDR ®Series Trust SPDR Dow Jones ®REIT ETF (the\n“Fund”) Supplement dated August 20, 2024to the Prospectus and Summary Prospectus, each dated October 31,\n2023, as may be supplemented from time to time Effective September 20, 2024 (the “Effective Date”), the\nFund’s benchmark index will change. Please note the differences between the Old Benchmark Index and the New\nBenchmark Index are limited to a capping to the weighting of market capitalization of individual REITs, and\nthe aggregate of all REITs in the Index as described in Section 2 below. Accordingly, as of the Effective\nDate:\n                                                                                                            \n  1.  All references to the Fund’s benchmark index in the Prospectus and Summary Prospectus (except for     \n      the benchmark index in the Average Annual Total Return Table) are deleted and replaced as follows:    \n                                                                                                            \n                                                                               \n  Old Benchmark Index Name            New Benchmark Index Name                 \n  Dow Jones U.S. Select REIT Index    Dow Jones U.S. Select REIT Capped Index  \n                                                                               \n                                                                                                            \n  2.  The third paragraph in “THE FUND’S PRINCIPAL INVESTMENT STRATEGY” section in the Prospectus and       \n      Summary Prospectus is deleted and replaced with the following:                                        \n                                                                                                            \nThe Index is designed to provide a measure of real estate securities that serve as proxies for direct real\nestate investing, in part by excluding securities whose value is not always closely tied to the value of the\nunderlying real estate. The reason for the exclusions is that performance of such securities may be driven\nby factors other than the value of real estate. The Index is a market capitalization weighted index of\npublicly traded real estate investment trusts (“REITs”) and is comprised of companies whose charters are the\nequity ownership and operation of commercial and/or residential real estate and which operate under the REIT\nAct of 1960. To be included in the Index, a company must be both an equity owner and operator of commercial\nand/or residential real estate. Businesses excluded from the Index include: those classified under the Dow\nJones REIT/RESI Industry Classification Hierarchy and/or Global Industry Classification Standard (GICS) as\n“Specialty” ( i.e., REIT types that cannot be easily classified within the Hierarchy, including timber\nREITs, railroad REITs and tower REITs), hybrid REITS, mortgage REITs, real estate finance companies,\nmortgage brokers and bankers, commercial and residential real estate brokers and estate agents, home\nbuilders, large landowners and subdividers of unimproved land, as well as companies that have more than 25%\nof their assets in direct mortgage investments. A company must have a minimum float-adjusted market\ncapitalization of at least $200 million at the time of its inclusion, and at least 75% of the company’s\ntotal revenue must be derived from the ownership and operation of real estate assets. A stock must have a\nmedian daily value traded of at least $5 million for the three-months prior to the rebalancing reference\ndate. The Index is generally rebalanced quarterly, and returns are calculated on a buy and hold basis except\nas necessary to reflect the occasional occurrence of Index changes in the middle of the month. Each REIT in\nthe Index is weighted by its float-adjusted market capitalization (i.e., each security is weighted to\nreflect the attainable market capitalization of the security which reflects that portion of securities\nshares that are accessible to investors), subject to the following constraints applied at each rebalancing:\n(i) no single company’s weight can exceed 10%, and (ii) the aggregate weight of all companies weighing above\n4.5% cannot exceed 22.5%. In addition, each company’s weight in the Index is reviewed daily and when the sum\nof companies with a weight greater than 5% exceeds 25%, additional capping is performed, effective after the\nclose of business on the next trading day. The Index is priced daily and is a total return (price and\nincome) benchmark. As of July 31, 2024, the Index comprised 102 REITs. PLEASE RETAIN THIS SUPPLEMENT FOR\nFUTURE REFERENCE 082024SUPP1\n"
}