{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-09-16",
  "accession_number": "0001193125-24-219488",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-219488-index.html",
  "text": "Important Notice Regarding Change in Investment Objective, Benchmark Index and Related Matters SPDR ®Series\nTrust SPDR Bloomberg Emerging Markets USD Bond ETF (the “Fund”) Supplement dated September 16, 2024to the\nProspectus and Summary Prospectus each dated October 31, 2023, as may be supplemented from time to time\nEffective on or about October 31, 2024 (the “Effective Date”), the Fund’s investment objective, benchmark\nindex and principal investment strategy will change. Accordingly, as of the Effective Date:\n                                                                                                            \n      All references to the Fund’s benchmark index in the Prospectus and Summary Prospectus (except for     \n  1.  the benchmark index in the Average Annual Total Returns Table in the Prospectus and Summary           \n      Prospectus) are deleted and replaced as follows:                                                      \n                                                                                                            \n                                                                                                            \n  Current                                   New                                                             \n  Benchmark Index                           Benchmark Index                                                 \n  Bloomberg Emerging USD Bond Core Index    Bloomberg Emerging Market USD Sovereign and Sovereign Owned     \n                                            Index                                                           \n                                                                                                            \n                                                                                                            \n  2.  The section entitled “INVESTMENT OBJECTIVE” beginning on page 22 of the Prospectus and page 1 of the  \n      Summary Prospectus is deleted and replaced with the following:                                        \n                                                                                                            \nThe SPDR Bloomberg Emerging Markets USD Bond ETF (the “Fund”) seeks to provide investment results that,\nbefore fees and expenses, correspond generally to the price and yield performance of an index that tracks\nfixed and floating-rate US dollar-denominated debt issued by sovereign and quasi-sovereign emerging market\nissuers.\n                                                                                                            \n  3.  The section entitled“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”beginningon page 22 of the Prospectus   \n      and page 1 of the Summary Prospectus is deleted and replaced with the following:                      \n                                                                                                            \nIn seeking to track the performance of the Bloomberg Emerging Market USD Sovereign and Sovereign Owned Index\n(the “Index”), the Fund employs a sampling strategy, which means that the Fund is not required to purchase\nall of the securities represented in the Index. Instead, the Fund may purchase a subset of the securities in\nthe Index in an effort to hold a portfolio of securities with generally the same risk and return\ncharacteristics of the Index. The quantity of holdings in the Fund will be based on a number of factors,\nincluding asset size of the Fund. Based on its analysis of these factors, SSGA Funds Management, Inc. (“SSGA\nFM” or the “Adviser”), the investment adviser to the Fund, either may invest the Fund’s assets in a subset\nof securities in the Index or may invest the Fund’s assets in substantially all of the securities\nrepresented in the Index in approximately the same proportions as the Index, as determined by the Adviser to\nbe in the best interest of the Fund in pursuing its objective. Under normal market conditions, the Fund\ngenerally invests substantially all, but at least 80%, of its total assets in the securities comprising the\nIndex and in securities that the Adviser determines have economic characteristics that are substantially\nidentical to the economic characteristics of the securities that comprise the Index. In addition, in seeking\nto track the Index, the Fund may invest in debt securities that are not included in the Index, cash and cash\nequivalents or money market instruments (including money market funds advised by the Adviser). In seeking to\ntrack the Index, the Fund’s assets may be concentrated in an industry or group of industries, but only to\nthe extent the Index concentrates in a particular industry or group of industries. Swaps and futures\ncontracts (each, a type of derivative instrument) may be used by the Fund in seeking performance that\ncorresponds to its Index and in managing cash flows. The Index is designed to measure the performance of\nfixed and floating-rate US dollar-denominated debt issued by emerging market sovereigns, as well as\ngovernment guaranteed emerging market issuers and 100% government owned emerging market issuers (i.e.,\nquasi-sovereign emerging market issuers). An emerging market is a country that the World Bank Income group\nclassifies as low/middle income or the International Monetary Fund (IMF) classifies as a non‑advanced\ncountry. In addition, the Index Provider (defined below) may classify a country as an emerging market based\non factors such as investability concerns, the presence of capital controls, and/or geographic\nconsiderations. The Index includes bonds of any credit quality with a minimum par amount outstanding of $1\nbillion, a remaining maturity of at least one year and an original maturity of greater than two and a half\nyears. SEC‑registered, Rule 144A and Regulation S bonds are each eligible for inclusion in the Index. As of\nAugust 31, 2024, there were approximately 630 securities in the Index. The Index is calculated by the Index\nProvider (as defined below) using a capped weighting methodology. At each rebalance, each constituent\ncountry within the Index is capped at 5% with respect to the total par amount outstanding of the Index. Any\ncountry weight exceeding the 5% limit will be redistributed on a pro rata basis to the bonds of all other\ncountries in the Index that are below the 5% cap. The Index is rebalanced and reconstituted monthly on the\nlast business day of the month. The Index is sponsored by Bloomberg Index Services Limited (the “Index\nProvider”), which is not affiliated with the Fund or the Adviser. The Index Provider determines the\ncomposition of the Index, relative weightings of the securities in the Index and publishes information\nregarding the market value of the Index.\n                                                                                                            \n      The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section beginning on page 23 of the Prospectus and     \n  4.  page 2 of the Summary Prospectus is updated to add the following risk as a principal risk of the      \n      Fund.                                                                                                 \n                                                                                                            \nVariable and Floating Rate Securities Risk:During periods of increasing interest rates, changes in the\ncoupon rates of variable or floating rate securities may lag behind the changes in market rates or may have\nlimits on the maximum increases in coupon rates. Alternatively, during periods of declining interest rates,\nthe coupon rates on such securities will typically readjust downward resulting in a lower yield. In\naddition, investment in derivative variable rate securities, such as inverse floaters, whose rates vary\ninversely with market rates of interest, or range floaters or capped floaters, whose rates are subject to\nperiodic or lifetime caps, or in securities that pay a rate of interest determined by applying a multiple to\nthe variable rate, involves special risks as compared to investment in a fixed-rate security and may involve\nleverage. Floating rate notes are generally subject to legal or contractual restrictions on resale, may\ntrade infrequently, and their value may be impaired when the Fund needs to liquidate such securities.\n                                                                                                            \n  5.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Variable and Floating Rate Securities Risk” is a principal risk of the Fund.            \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 091624SUPP1\n"
}