{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2025-02-03",
  "accession_number": "0001193125-25-018505",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-25-018505-index.html",
  "text": "SPDR ®SERIES TRUST SPDR ®Bloomberg Enhanced Roll Yield Commodity Strategy No K‑1 ETF (the “Fund”) Supplement\ndated February 3, 2025to the Prospectus and Summary Prospectus, each dated September 4, 2024, as may be\nsupplemented from time to time Effective immediately, the Fund’s underlying index, the Bloomberg Enhanced\nRoll Yield Total Return Index (the “Index”), will change the way it calculates returns on cash collateral by\nusing the Secured Overnight Financing Rate (commonly referred to as SOFR) instead of U.S. Treasury Bills.\nAccordingly, effective immediately, the third paragraph in “ THE FUND ’ S PRINCIPAL INVESTMENT STRATEGY ”\nsection in the Prospectus and Summary Prospectus is replaced in its entirety with the following: The Index\nmeasures the performance of a diversified, liquid and cost-effective long exposure to the broad commodities\nmarket through synthetic positions in futures contracts, with no single commodity or sector dominating the\nIndex. The Index is calculated on a total return basis, which reflects the returns on a fully collateralized\ninvestment in the Index. This combines the returns of the Index with the returns on cash collateral based on\nthe Secured Overnight Financing Rate (SOFR). The Index methodology selects commodities that are both\nsufficiently significant to the world economy as measured by liquidity and tradable through a qualifying\nrelated futures contract. Commodity futures contracts normally specify a certain date for the delivery of\nthe underlying physical commodity. To avoid the effects of the delivery process on Index performance and to\nmaintain a long futures position, the Index embeds a “rolling” process. In a rolling process, nearby futures\ncontracts are sold and contracts that have not yet reached the delivery period are purchased. The Index is\ncomposed of three to four futures contracts for each commodity, which are rolled each month to a new set of\nfutures contracts, and each contract for a specific commodity is equally weighted. The contract rolls take\nplace over the first ten business days of each month. In addition, the seventh paragraph in “THE FUND’S\nPRINCIPAL INVESTMENT STRATEGY” section in the Prospectus and Summary Prospectus is replaced with the\nfollowing to reflect the commodities eligible for inclusion in the Index: As of January 30, 2025, the\nfollowing commodities were eligible for inclusion in the Index: agricultural (Chicago Wheat, Kansas Wheat,\nSoybeans, Soybean Meal, Soybean Oil, Corn, Cocoa, Cotton, Coffee, and Sugar), energy (Brent Crude Oil,\nGasoil, WTI Crude Oil, Heating Oil, Natural Gas, and Gasoline), industrial metals (Copper, LME Copper, Zinc,\nTin, Nickel, Lead, and Aluminum), livestock (Live Cattle, Lean Hogs, and Feeder Cattle) and precious metals\n(Gold, Platinum, and Silver). In seeking to track the Index, the Fund’s assets may be concentrated in an\nindustry or group of industries, but only to the extent that the Index concentrates in a particular industry\nor group of industries. As of January 30, 2025, the Fund had significant exposure to precious metals\ncommodities, industrial metals commodities, agricultural commodities, and energy commodities.\n                             PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE                             \n                                                                                                 020325SUPP1\n"
}