{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-12-15",
  "accession_number": "0001193125-23-296710",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-296710-index.html",
  "text": "SPDR ®SERIES TRUST SPDR S&P Kensho New Economies Composite ETF (the “Fund”) Supplement dated December 15,\n2023to the Prospectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time\nto time Effective after the close of trading on December 15, 2023 (the “Effective Date”), changes were made\nto the methodology for the Fund’s underlying index, the S&P Kensho New Economies Index. As a result, as of\nthe Effective Date, “THE FUND’S PRINCIPAL INVESTMENT STRATEGY” section in the Prospectus and Summary\nProspectus is replaced in its entirety with the following: In seeking to track the performance of the S&P\nKensho New Economies Composite Index (the “Index”), the Fund employs a sampling strategy, which means that\nthe Fund is not required to purchase all of the securities represented in the Index. Instead, the Fund may\npurchase a subset of the securities in the Index in an effort to hold a portfolio of securities with\ngenerally the same risk and return characteristics of the Index. The quantity of holdings in the Fund will\nbe based on a number of factors, including asset size of the Fund. Based on its analysis of these factors,\nSSGA Funds Management, Inc. (“SSGA FM” or the “Adviser”), the investment adviser to the Fund, either may\ninvest the Fund’s assets in a subset of securities in the Index or may invest the Fund’s assets in\nsubstantially all of the securities represented in the Index in approximately the same proportions as the\nIndex, as determined by the Adviser to be in the best interest of the Fund in pursuing its objective. Under\nnormal market conditions, the Fund generally invests substantially all, but at least 80%, of its total\nassets in the securities comprising the Index. In addition, in seeking to track the Index, the Fund may\ninvest in equity securities that are not included in the Index, cash and cash equivalents or money market\ninstruments, such as repurchase agreements and money market funds (including money market funds advised by\nthe Adviser). In seeking to track the Index, the Fund’s assets may be concentrated in an industry or group\nof industries, but only to the extent that the Index concentrates in a particular industry or group of\nindustries. Futures contracts (a type of derivative instrument) may be used by the Fund in seeking\nperformance that corresponds to the Index and in managing cash flows. The Index is comprised of U.S.-listed\nequity securities (including depositary receipts) of companies domiciled across developed and emerging\nmarkets worldwide. The Index is designed to capture companies whose products and services are driving\ninnovation and transforming the global economy through the use of existing and emerging technologies, and\nrapid developments in robotics, automation, artificial intelligence, connectedness and processing power\n(“New Economies companies”). In particular, the Index comprises the components included in the New Economy\nSubsector Indexes (each, an “Underlying Index”) developed by S&P Dow Jones Indices LLC (the “Index\nProvider”). Each Underlying Index is comprised of securities of New Economies companies in a specific\nsector. As of December 15, 2023, the Index was comprised of 25 Underlying Indexes. The constituents of each\nUnderlying Index are determined by a classification standard produced by the Index Provider. The\nclassification standard utilizes an automated scan of companies’ most recent regulatory filings with the\nU.S. Securities and Exchange Commission on Form 10‑K, Form 20‑F, Form 40‑F, or Form S‑1 filing, as\napplicable, maintained in the S&P Market Intelligence United Document Repository, to identify specific\n\nsearch terms and phrases that describe a company as producing products and services related to the\nparticular segment targeted by the Underlying Index. The resulting list of eligible securities for each\nUnderlying Index is then filtered by eliminating companies that do not include in their regulatory filings a\nreference to a product or service that (i) is related to a search term or phrase and (ii) is used in a\nmanner that is within the scope of the Underlying Index’s objective. Each Underlying Index then screens the\nremaining securities to remove securities that are not listed on NYSE, NASDAQ, or CBOE exchanges (or an\naffiliate of one of those exchanges) or do not meet certain minimum liquidity thresholds. The Index\nProvider’s Index Committee then reviews each remaining eligible constituent to verify the rules of the\nautomated scan were implemented correctly. Underlying Index constituents are then categorized as either\n“Core” or “Non‑Core.” A company is categorized as Core if its products and services related to the\nUnderlying Index’s objective are identified in its regulatory filings as principal components of the\ncompany’s strategy. Products and services are deemed to be principal components of a company’s strategy if\nthe company’s regulatory filing disclosures regarding such products and services are determined to be\nsufficiently prominent according to a proprietary algorithm of the Index Provider which calculates\nprominence based on the frequency and position of such disclosures within regulatory filings. A company may\nalso be categorized as Core if the Index Provider determines that the majority of the company’s revenue is\nderived from products and services related to the Underlying Index’s objective as indicated by the company’s\nreported business segments, which is assessed by scanning the S&P Capital IQ Database for annual fiscal year\nrevenue segment reporting. All other companies are categorized as Non‑Core, including companies whose\nproducts and services are identified as forming a necessary component of the supply chain of the segment\ntargeted by the Underlying Index. Each Underlying Index’s exposure is then tilted towards Core Index\nConstituents. The weight of each security in the Index is based on the relative weight given to each\nUnderlying Index in the Index. The relative weight of each Underlying Index is determined by a proprietary\nprocess comparing the ratio of the average daily returns divided by the standard deviation of daily returns\namong the Underlying Indexes. Underlying Indexes with larger ratios are weighted more heavily than\nUnderlying Indexes with smaller ratios. The weight of each security in each Underlying Index is then\nmultiplied by the relative weight of the respective Underlying Index in the Index to determine the\nsecurity’s initial weight in the Index. The final constituent security weight is subject to liquidity and\ndiversification adjustments. The Index is reconstituted and rebalanced after the close of trading on the\nthird Friday in June with a reference date as of the close of the last trading day in May. In addition, the\nIndex is rebalanced after the close of trading on the third Friday of December with a reference date as of\nthe close of the last trading day in November. In connection with the December rebalance, Index constituents\nare also evaluated for continued inclusion in the Index if a new eligible regulatory filing has been filed\nsince the last reconstitution review. As of December 15, 2023, the Index comprised 437 securities. The Index\nProvider is not affiliated with the Fund or the Adviser. The Index Provider establishes and maintains rules\nwhich are used to determine the composition of the Index and relative weightings of the securities in the\nIndex.\n                             PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE                             \n                                                                                                 121523SUPP6\n"
}