{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2025-04-03",
  "accession_number": "0001193125-25-072451",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-25-072451-index.html",
  "text": "SPDR ®SERIES TRUST SPDR Nuveen Bloomberg High Yield Municipal Bond ETF (the “Fund”) Supplement dated April  \n3, 2025to the Prospectus, Summary Prospectus, and Statement of Additional Information (“SAI”), each dated   \nOctober 31, 2024, as may be supplemented from time to time Effective June 1, 2025 (the “Effective Date”),   \nthe Fund’s benchmark index will change. Accordingly, as of the Effective Date:                              \n                                                                                                            \n      All references to the Fund’s name and benchmark index in the Prospectus, Summary Prospectus and SAI   \n  1.  (except for the benchmark index in the Average Annual Total Return Table in the Prospectus and        \n      Summary Prospectus) are deleted and replaced as follows:                                              \n                                                                                                            \n                                                                                                            \n  Current Fund Name         Current                    New Fund Name              New Benchmark             \n                            Benchmark Index                                       Index                     \n  SPDR Nuveen Bloomberg     Bloomberg Municipal        SPDR Nuveen ICE High       ICE US Select High Yield  \n  High Yield                Yield Index                Yield Municipal Bond       Crossover Municipal       \n  Municipal Bond ETF                                   ETF                        Index                     \n                                                                                                            \n                                                                                                            \n  2.  The third and fourth paragraphs in“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”section in the Fund’s     \n      Prospectus and Summary Prospectus are deleted and replaced with the following:                        \n                                                                                                            \nThe Index is market capitalization-weighted and designed to measure the performance of lower-rated (A3/A+ or\nlower) and unrated U.S. dollar-denominated tax‑exempt debt publicly issued in the U.S. domestic market by   \nU.S. states, U.S. territories and their political subdivisions. Bonds included in the Index may include     \nprivate activity bonds, which are typically issued by or on behalf of local or state governments for the    \npurpose of financing the project of a private user. The Index is a blend of the following indices: (i) 70%  \nICE Core High Yield & Unrated Municipal Index; (ii) 20% ICE 1+ Year BBB AMT‑Free Broad National Municipal   \nIndex; and (iii) 10% ICE 1+ Year Single‑A AMT‑Free Broad National Municipal Index. Constituents of the ICE  \nCore High Yield & Unrated Municipal Index must be non‑rated or rated below investment grade (Ba1/BB+ or     \nlower) by Moody’s Investors Service, Inc. (“Moody’s”), Standard & Poor’s (“S&P”) and Fitch Ratings Inc.     \n(“Fitch”) (if rated by all three agencies, two of the three ratings must be Ba1/BB+ or lower; if rated by   \ntwo agencies, the lowest rating must be Ba1/BB+ or lower; and if rated by a single agency, the security must\nbe rated Ba1/BB+ or lower), have at least a $3 million currently outstanding face value, be issued as part  \nof a deal with an original offering size of at least $15 million, and have a remaining term to final        \nmaturity of at least one year. Constituents of the ICE 1+ Year BBB AMT‑Free Broad National Municipal Index  \nmust be rated Baa3, Baa2, or Baa1 by Moody’s or BBB‑, BBB, or BBB+ by S&P or Fitch (based on the middle     \nrating of the three agencies), have at least a $10 million currently outstanding face value, be issued as   \npart of a deal with an original offering size of at least $100 million, and have a remaining term to final  \nmaturity of at least one year. Constituents of the ICE 1+ Year Single‑A AMT‑Free Broad National Municipal   \nIndex must be rated A3, A2, or A1 by Moody’s or A‑, A, or A+ by S&P or Fitch, (based on the middle rating of\nthe three agencies) have at least a $10 million currently outstanding face value, be issued as part of a    \ndeal with an original offering size of at least $100 million, and have a remaining term to final maturity of\nat least one year. Only fixed-rate coupon bonds (including zero coupon bonds) are eligible for inclusion in \nthe Index. Securities included in the Index may include when-issued securities. Private placements, variable\nrate demand obligations, securities in legal default, floating rate debt, municipal commercial paper, and   \ndebt issued under the municipal liquidity facility are excluded from the Index. The Index is rebalanced and \nreconstituted on the last calendar day of each month. As of March 31, 2025, there were 15,344 securities in \nthe Index.                                                                                                  \n                                                                                                            \nThe Index is sponsored by ICE Data Indices, LLC (the “Index Provider”), which is not affiliated with the    \nFund, the Adviser or the Sub‑Adviser. The Index Provider determines the composition of the Index, relative  \nweightings of the securities in the Index and publishes information regarding the market value of the Index.\n                                                                                                            \n  3.  The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section in the Fund’s Prospectus and Summary           \n      Prospectus is updated to add the following risk as a principal risk of the Fund.                      \n                                                                                                            \nZero-Coupon Bond Risk:Zero-coupon bonds usually trade at a deep discount from their face or par values and  \nare subject to greater market value fluctuations from changing interest rates than debt obligations of      \ncomparable maturities that make current distributions of interest.                                          \n                                                                                                            \n  4.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Zero-Coupon Bond Risk” is a principal risk of the Fund.                                 \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 040325SUPP1                                              \n                                                                                                            \nSPDR ®SERIES TRUST SPDR Nuveen Bloomberg Short Term Municipal Bond ETF (the “Fund”) Supplement dated April  \n3, 2025 to the Prospectus, Summary Prospectus, and Statement of Additional Information (“SAI”), each dated  \nOctober 31, 2024, as may be supplemented from time to time Effective June 1, 2025 (the “Effective Date”),   \nthe Fund’s name, benchmark index and principal investment strategy will change. Accordingly, as of the      \nEffective Date:                                                                                             \n                                                                                                            \n      All references to the Fund’s name and benchmark index in the Prospectus, Summary Prospectus and SAI   \n  1.  (except for the benchmark index in the Average Annual Total Return Table in the Prospectus and        \n      Summary Prospectus) are deleted and replaced as follows:                                              \n                                                                                                            \n                                                                                                            \n  Current Fund Name         Current                    New Fund Name              New Benchmark             \n                            Benchmark Index                                       Index                     \n  SPDR Nuveen Bloomberg     Bloomberg Managed Money    SPDR Nuveen ICE Short      ICE 1‑5 Year AMT‑Free US  \n  Short Term                Municipal Short Term       Term Municipal Bond ETF    Select Municipal Index    \n  Municipal Bond ETF        Index                                                                           \n                                                                                                            \n                                                                                                            \n  2.  The third and fourth paragraphs in“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”section in the Fund’s     \n      Prospectus and Summary Prospectus are deleted and replaced with the following:                        \n                                                                                                            \nThe Index is designed to track the performance of U.S. dollar denominated investment grade, short-term      \ntax‑exempt debt publicly issued by U.S. states and territories, and their political subdivisions, in the    \nU.S. domestic market. The Index includes state and local general obligation bonds, revenue bonds,           \npre‑refunded bonds, and insured bonds. A general obligation bond is secured by the full faith and credit of \nits issuer. A revenue bond is payable from a specific source of revenue. A pre‑refunded bond is a revenue   \nbond that the issuer has allocated funds to fully retire. An insured bond is protected from issuer default  \nor rating downgrade by an insurance company. The Index also includes municipal lease obligations, which are \nsecurities issued by state and local governments and authorities to finance the acquisition of equipment and\nfacilities. They may take the form of a lease, an installment purchase contract, a conditional sales        \ncontract, or a participation interest in a lease or contract. The Index is a rules-based, market-           \ncapitalization weighted index engineered for the tax‑exempt bond market. All bonds in the Index must be U.S.\ndollar denominated and have an average rating of Baa3/BBB‑ or higher by the following statistical ratings   \nagencies: Moody’s Investors Service, Inc., S&P Global Ratings and Fitch Ratings Inc. In addition, to be     \nincluded in the Index, a security must (i) not be subject to alternative minimum tax; (ii) have a fixed     \ncoupon schedule; (iii) have a remaining term to final maturity between 1 and 5 years; (iv) have at least 18 \nmonths to final maturity at the time of issuance; and (v) meet the following minimum size requirements: (a) \nhave a minimum current amount outstanding of $5 million for bonds with an initial term to final maturity of \nless than 3 years; (b) have a minimum current amount outstanding of $7 million for bonds with an initial    \nterm to final maturity of 3 to 15 years; and (c) have a minimum current amount outstanding of $10 million   \nfor bonds with an initial term to final maturity of 15 or more years. Securities included in the Index may  \ninclude when-issued securities and zero‑coupon bonds. Secondarily insured bonds, Rule 144A bonds, bonds     \nissued under the municipal liquidity facility or a municipal commercial paper program are excluded from the \nIndex. In addition, the Index excludes health bonds, single-family housing bonds, multi-family housing      \nbonds, and tobacco bonds, as well as bonds issued for purposes of charter schools, prepaid gas or electric  \ncontracts,                                                                                                  \n                                                                                                            \nfor‑profit industrial development, or pollution control. The Index is rebalanced and reconstituted monthly  \non the last calendar day of the month. As of March 31, 2025, there were 13.623 securities in the Index. The \nIndex is sponsored by ICE Data Indices, LLC (the “Index Provider”), which is not affiliated with the Fund,  \nthe Adviser or the Sub‑Adviser. The Index Provider determines the composition of the Index, relative        \nweightings of the securities in the Index and publishes information regarding the market value of the Index.\n                                                                                                            \n  3.  The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section in the Fund’s Prospectus and Summary           \n      Prospectus is updated to add the following risk as a principal risk of the Fund.                      \n                                                                                                            \nZero-Coupon Bond Risk:Zero-coupon bonds usually trade at a deep discount from their face or par values and  \nare subject to greater market value fluctuations from changing interest rates than debt obligations of      \ncomparable maturities that make current distributions of interest.                                          \n                                                                                                            \n  4.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Zero-Coupon Bond Risk” is a principal risk of the Fund.                                 \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 040325SUPP2                                              \n                                                                                                            \nSPDR ®SERIES TRUST SPDR Nuveen Bloomberg Municipal Bond ETF (the “Fund”) Supplement dated April 3, 2025 to  \nthe Prospectus, Summary Prospectus, and Statement of Additional Information (“SAI”), each dated October 31, \n2024, as may be supplemented from time to time Effective June 1, 2025 (the “Effective Date”), the Fund’s    \nname, benchmark index and principal investment strategy will change. Accordingly, as of the Effective Date: \n                                                                                                            \n      All references to the Fund’s name and benchmark index in the Prospectus, Summary Prospectus and SAI   \n  1.  (except for the benchmark index in the Average Annual Total Return Table in the Prospectus and        \n      Summary Prospectus) are deleted and replaced as follows:                                              \n                                                                                                            \n                                                                                                           \n  Current Fund Name        Current Benchmark                 New Fund Name         New Benchmark           \n                           Index                                                   Index                   \n  SPDR Nuveen Bloomberg    Bloomberg Municipal               SPDR Nuveen ICE       ICE AMT‑Free US         \n  Municipal Bond ETF       Managed Money 1‑25 Years Index    Municipal Bond ETF    Select Municipal Index  \n                                                                                                           \n                                                                                                            \n  2.  The third, fourth and fifth paragraphs in“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”section in the     \n      Fund’s Prospectus and Summary Prospectus are deleted and replaced with the following:                 \n                                                                                                            \nThe Index is designed to track the performance of U.S. dollar denominated investment grade tax‑exempt debt  \npublicly issued by U.S. states and territories, and their political subdivisions, in the U.S. domestic      \nmarket. The Index includes state and local general obligation bonds, revenue bonds, pre-refunded bonds, and \ninsured bonds. A general obligation bond is secured by the full faith and credit of its issuer. A revenue   \nbond is payable from a specific source of revenue. A pre‑refunded bond is a revenue bond that the issuer has\nallocated funds to fully retire. An insured bond is protected from issuer default or rating downgrade by an \ninsurance company. The Index also includes municipal lease obligations, which are securities issued by state\nand local governments and authorities to finance the acquisition of equipment and facilities. They may take \nthe form of a lease, an installment purchase contract, a conditional sales contract, or a participation     \ninterest in a lease or contract. The Index is a rules-based, market-capitalization weighted index engineered\nfor the tax‑exempt bond market. All bonds in the Index must be U.S. dollar denominated and have an average  \nrating of Baa3/BBB‑ or higher by the following statistical ratings agencies: Moody’s Investors Service,     \nInc., S&P Global Ratings, and Fitch Ratings Inc. In addition, to be included in the Index, a security must  \n(i) not be subject to alternative minimum tax; (ii) have a fixed coupon schedule; (iii) have at least one   \nyear remaining term to final maturity; (iv) have at least 18 months to final maturity at the time of        \nissuance; and (v) meet the following minimum size requirements: (a) have a minimum current amount           \noutstanding of $5 million for bonds with an initial term to final maturity of less than 3 years; (b) have a \nminimum current amount outstanding of $7 million for bonds with an initial term to final maturity of 3 to 15\nyears; and (c) have a minimum current amount outstanding of $10 million for bonds with an initial term to   \nfinal maturity of 15 or more years . Securities included in the Index may include when-issued securities and\nzero‑coupon bonds. Secondarily insured bonds, Rule 144A bonds, bonds issued under the municipal liquidity   \nfacility or a municipal commercial paper program are excluded from the Index. In addition, the Index        \nexcludes health bonds, single-family housing bonds, multi-family housing bonds, and tobacco bonds, as well  \nas bonds issued for purposes of charter schools, prepaid gas or electric contracts, for-profit industrial   \ndevelopment, or pollution control. The Index is rebalanced and reconstituted monthly on the last calendar   \nday of the month. As of March 31, 2025, there were 53,743 securities in the Index.                          \n                                                                                                            \nThe Index is sponsored by ICE Data Indices, LLC (the “Index Provider”), which is not affiliated with the    \nFund, the Adviser or the Sub‑Adviser. The Index Provider determines the composition of the Index, relative  \nweightings of the securities in the Index and publishes information regarding the market value of the Index.\n                                                                                                            \n  3.  The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section in the Fund’s Prospectus and Summary           \n      Prospectus is updated to add the following risk as a principal risk of the Fund.                      \n                                                                                                            \nZero-Coupon Bond Risk:Zero-coupon bonds usually trade at a deep discount from their face or par values and  \nare subject to greater market value fluctuations from changing interest rates than debt obligations of      \ncomparable maturities that make current distributions of interest.                                          \n                                                                                                            \n  4.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Zero-Coupon Bond Risk” is a principal risk of the Fund.                                 \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 040325SUPP3                                              \n"
}