{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-12-15",
  "accession_number": "0001193125-23-296718",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-296718-index.html",
  "text": "SPDR ®SERIES TRUST SPDR S&P Kensho Clean Power ETF (the “Fund”) Supplement dated December 15, 2023to the\nProspectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time to time\nEffective after the close of trading on December 15, 2023 (the “Effective Date”), changes were made to the\nmethodology for the Fund’s underlying index, the S&P Kensho Clean Power Index. As a result, as of the\nEffective Date, “THE FUND’S PRINCIPAL INVESTMENT STRATEGY” section in the Prospectus and Summary Prospectus\nis replaced in its entirety with the following: In seeking to track the performance of the S&P Kensho Clean\nPower Index (the “Index”), the Fund employs a sampling strategy, which means that the Fund is not required\nto purchase all of the securities represented in the Index. Instead, the Fund may purchase a subset of the\nsecurities in the Index in an effort to hold a portfolio of securities with generally the same risk and\nreturn characteristics of the Index. The quantity of holdings in the Fund will be based on a number of\nfactors, including asset size of the Fund. Based on its analysis of these factors, SSGA Funds Management,\nInc. (“SSGA FM” or the “Adviser”), the investment adviser to the Fund, either may invest the Fund’s assets\nin a subset of securities in the Index or may invest the Fund’s assets in substantially all of the\nsecurities represented in the Index in approximately the same proportions as the Index, as determined by the\nAdviser to be in the best interest of the Fund in pursuing its objective. Under normal market conditions,\nthe Fund generally invests substantially all, but at least 80%, of its total assets in the securities\ncomprising the Index. In addition, in seeking to track the Index, the Fund may invest in equity securities\nthat are not included in the Index, cash and cash equivalents or money market instruments, such as\nrepurchase agreements and money market funds (including money market funds advised by the Adviser). In\nseeking to track the Index, the Fund’s assets may be concentrated in an industry or group of industries, but\nonly to the extent that the Index concentrates in a particular industry or group of industries. Futures\ncontracts (a type of derivative instrument) may be used by the Fund in seeking performance that corresponds\nto the Index and in managing cash flows. The Index is comprised of U.S.-listed equity securities (including\ndepositary receipts) of companies domiciled across developed and emerging markets worldwide which are\nincluded in the Clean Power sector as determined by a classification standard produced by S&P Dow Jones\nIndices LLC (the “Index Provider”). The Index is designed to capture companies whose products and services\nare driving innovation behind clean power. In particular, the Index comprises the components of the S&P\nKensho Cleantech Index focused on clean energy technology (hardware, software, and construction and\ninstallation of materials used for capturing energy, as well as advanced energy storage devices), and the\nS&P Kensho Clean Energy Index focused on clean energy generation (generation and transmission of power\nderived from clean energy sources) (the “Underlying Indexes”) as of the Index’s reconstitution reference\ndate. The Underlying Indexes are subject to the following liquidity thresholds for each component: (i) must\nhave a share price of at least USD $1.00; (ii) must be issued by a company with a minimum float market\ncapitalization of at least $100 million; and (iii) must have a minimum three-month average daily traded\nvalue of at least $1 million. The S&P Kensho Cleantech Index seeks to track companies focused on building\ntechnologies or products that enable generation of energy in a clean manner (solar, wind, geothermal,\nhydrogen and hydroelectric). The S&P Kensho Clean Energy Index seeks to track companies focused on the\ngeneration and transmission of energy derived from clean sources (solar, wind, geothermal, hydrogen and\nhydroelectric).\n\nTo determine the constituents of the Underlying Indexes, the Index Provider’s classification standard\nutilizes an automated scan of companies’ most recent regulatory filings with the U.S. Securities and\nExchange Commission on Form 10‑K, Form 20‑F, Form 40‑F, or Form S‑1, as applicable, maintained in the S&P\nMarket Intelligence United Document Repository, to identify specific search terms and phrases that describe\na company as producing products and services related to the particular segment targeted by the Underlying\nIndex. The resulting list of eligible securities for each Underlying Index is then filtered by eliminating\ncompanies that do not include in their regulatory filings a reference to a product or service that (i) is\nrelated to a search term or phrase and (ii) is used in a manner that is within the scope of the Underlying\nIndex’s objective. Each Underlying Index then screens the remaining securities to remove securities that are\nnot listed on NYSE, NASDAQ, or CBOE exchanges (or an affiliate of one of those exchanges) or do not meet\ncertain minimum liquidity thresholds. The Index Provider’s Index Committee then reviews each remaining\neligible constituent to verify the rules of the automated scan were implemented correctly. Underlying Index\nconstituents are then categorized as either “Core” or “Non‑Core.” A company is categorized as Core if its\nproducts and services related to the Underlying Index’s objective are identified in its regulatory filings\nas principal components of the company’s strategy. Products and services are deemed to be principal\ncomponents of a company’s strategy if the company’s regulatory filing disclosures regarding such products\nand services are determined to be sufficiently prominent according to a proprietary algorithm of the Index\nProvider which calculates prominence based on the frequency and position of such disclosures within\nregulatory filings. A company may also be categorized as Core if the Index Provider determines that the\nmajority of the company’s revenue is derived from products and services related to the Underlying Index’s\nobjective as indicated by the company’s reported business segments, which is assessed by scanning the S&P\nCapital IQ Database for annual fiscal year revenue segment reporting. All other companies are categorized as\nNon‑Core, including companies whose products and services are identified as forming a necessary component of\nthe supply chain of the segment targeted by the Underlying Index. An Index constituent categorized as Core\nby at least one of the Underlying Indexes will be categorized as Core for purposes of the Index. At the time\nof each rebalance, to tilt the Index’s exposure toward Core Index Constituents, the Core Index Constituents\nare systematically overweighted relative to the Non‑Core Index Constituents. Each Core Index Constituent and\nNon‑Core Index Constituent is then equally weighted within the group of Core Index Constituents and Non‑Core\nIndex Constituents, respectively, subject to liquidity and diversification adjustments. The Index is\nreconstituted and rebalanced after the close of trading on the third Friday in June with a reference date as\nof the close of the last trading day in May. In addition, the Index is rebalanced after the close of trading\non the third Friday of December with a reference date as of the close of the last trading day in November.\nIn connection with the December rebalance, Index constituents are also evaluated for continued inclusion in\nthe Index if a new eligible regulatory filing has been filed since the last reconstitution review. As of\nDecember 15, 2023, the Index comprised 49 securities. The Index Provider is not affiliated with the Fund or\nthe Adviser. The Index Provider establishes and maintains rules which are used to determine the composition\nof the Index and relative weightings of the securities in the Index.\n                             PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE                             \n                                                                                                 121523SUPP4\n"
}