{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2025-05-12",
  "accession_number": "0001193125-25-116992",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-25-116992-index.html",
  "text": "SPDR ®SERIES TRUST SPDR Nuveen Bloomberg Short Term Municipal Bond ETF (the “Fund”) Supplement dated May 12,\n2025to the Prospectus, Summary Prospectus, and Statement of Additional Information (“SAI”), each dated      \nOctober 31, 2024, as may be supplemented from time to time This supplement replaces and supersedes the      \nsupplement dated April 3, 2025 Effective June 1, 2025 (the “Effective Date”), the Fund’s name, benchmark    \nindex and principal investment strategy will change. Accordingly, as of the Effective Date:                 \n                                                                                                            \n      All references to the Fund’s name and benchmark index in the Prospectus, Summary Prospectus and SAI   \n  1.  (except for the benchmark index in the Average Annual Total Return Table in the Prospectus and        \n      Summary Prospectus) are deleted and replaced as follows:                                              \n                                                                                                            \n                                                                                                            \n  Current Fund Name         Current                    New Fund Name              New Benchmark             \n                            Benchmark Index                                       Index                     \n  SPDR Nuveen Bloomberg     Bloomberg Managed Money    SPDR Nuveen ICE Short      ICE 1‑5 Year AMT‑Free     \n  Short Term                Municipal Short Term       Term Municipal Bond ETF    Broad Municipal Index     \n  Municipal Bond ETF        Index                                                                           \n                                                                                                            \n                                                                                                            \n  2.  The third and fourth paragraphs in“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”section in the Fund’s     \n      Prospectus and Summary Prospectus are deleted and replaced with the following:                        \n                                                                                                            \nThe Index is designed to track the performance of U.S. dollar denominated investment grade, short‑term      \ntax‑exempt debt publicly issued by U.S. states and territories, and their political subdivisions, in the    \nU.S. domestic market. The Index includes state and local general obligation bonds, revenue bonds,           \npre‑refunded bonds, and insured bonds. A general obligation bond is secured by the full faith and credit of \nits issuer. A revenue bond is payable from a specific source of revenue. A pre‑refunded bond is a revenue   \nbond that the issuer has allocated funds to fully retire. An insured bond is protected from issuer default  \nor rating downgrade by an insurance company. The Index also includes municipal lease obligations, which are \nsecurities issued by state and local governments and authorities to finance the acquisition of equipment and\nfacilities. They may take the form of a lease, an installment purchase contract, a conditional sales        \ncontract, or a participation interest in a lease or contract. The Index is a rules-based, market-           \ncapitalization weighted index engineered for the tax‑exempt bond market. All bonds in the Index must be     \nexempt from federal taxes, U.S. dollar denominated and have an average rating of Baa3/BBB‑ or higher by the \nfollowing statistical ratings agencies: Moody’s Investors Service, Inc., S&P Global Ratings and Fitch       \nRatings Inc. In addition, to be included in the Index, a security must (i) not be subject to alternative    \nminimum tax; (ii) have a fixed coupon schedule; (iii) have a remaining term to final maturity between 1 and \n5 years; (iv) have at least 18 months to final maturity at the time of issuance; and (v) meet the following \nminimum size requirements: (a) have a minimum current amount outstanding of $5 million for bonds with an    \ninitial term to final maturity of less than 3 years; (b) have a minimum current amount outstanding of $7    \nmillion for bonds with an initial term to final maturity of 3 to 15 years; and (c) have a minimum current   \namount outstanding of $10 million for bonds with an initial term to final maturity of 15 or more years.     \nSecurities included in the Index may include when-issued securities and zero‑coupon bonds. Secondarily      \ninsured bonds, Rule 144A bonds, bonds issued under the municipal liquidity facility or a municipal          \ncommercial paper program are excluded from the Index. The Index is rebalanced and reconstituted monthly on  \nthe last calendar day of the month. As of March 31, 2025, there were 14,330 securities in the Index.        \n                                                                                                            \nThe Index is sponsored by ICE Data Indices, LLC (the “Index Provider”), which is not affiliated with the    \nFund, the Adviser or the Sub‑Adviser. The Index Provider determines the composition of the Index, relative  \nweightings of the securities in the Index and publishes information regarding the market value of the Index.\n                                                                                                            \n  3.  The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section in the Fund’s Prospectus and Summary           \n      Prospectus is updated to add the following risk as a principal risk of the Fund.                      \n                                                                                                            \nZero-Coupon Bond Risk:Zero-coupon bonds usually trade at a deep discount from their face or par values and  \nare subject to greater market value fluctuations from changing interest rates than debt obligations of      \ncomparable maturities that make current distributions of interest.                                          \n                                                                                                            \n  4.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Zero-Coupon Bond Risk” is a principal risk of the Fund.                                 \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 051225SUPP1                                              \n                                                                                                            \nSPDR ®SERIES TRUST SPDR Nuveen Bloomberg Municipal Bond ETF (the “Fund”) Supplement dated May 12, 2025 to   \nthe Prospectus, Summary Prospectus, and Statement of Additional Information (“SAI”), each dated October 31, \n2024, as may be supplemented from time to time This supplement replaces and supersedes the supplement dated \nApril 3, 2025 Effective June 1, 2025 (the “Effective Date”), the Fund’s name, benchmark index and principal \ninvestment strategy will change. Accordingly, as of the Effective Date:                                     \n                                                                                                            \n      All references to the Fund’s name and benchmark index in the Prospectus, Summary Prospectus and SAI   \n  1.  (except for the benchmark index in the Average Annual Total Return Table in the Prospectus and        \n      Summary Prospectus) are deleted and replaced as follows:                                              \n                                                                                                            \n                                                                                                            \n  Current Fund Name     Current Benchmark               New Fund Name         New Benchmark                 \n                        Index                                                 Index                         \n  SPDR Nuveen           Bloomberg Municipal             SPDR Nuveen ICE       ICE 1+ Year AMT‑Free Broad    \n  Bloomberg             Managed Money 1‑25 Years        Municipal Bond ETF    Municipal Index               \n  Municipal Bond ETF    Index                                                                               \n                                                                                                            \n                                                                                                            \n  2.  The third, fourth and fifth paragraphs in“THE FUND’S PRINCIPAL INVESTMENT STRATEGY”section in the     \n      Fund’s Prospectus and Summary Prospectus are deleted and replaced with the following:                 \n                                                                                                            \nThe Index is designed to track the performance of U.S. dollar denominated investment grade tax‑exempt debt  \npublicly issued by U.S. states and territories, and their political subdivisions, in the U.S. domestic      \nmarket. The Index includes state and local general obligation bonds, revenue bonds, pre‑refunded bonds, and \ninsured bonds. A general obligation bond is secured by the full faith and credit of its issuer. A revenue   \nbond is payable from a specific source of revenue. A pre‑refunded bond is a revenue bond that the issuer has\nallocated funds to fully retire. An insured bond is protected from issuer default or rating downgrade by an \ninsurance company. The Index also includes municipal lease obligations, which are securities issued by state\nand local governments and authorities to finance the acquisition of equipment and facilities. They may take \nthe form of a lease, an installment purchase contract, a conditional sales contract, or a participation     \ninterest in a lease or contract. The Index is a rules-based, market-capitalization weighted index engineered\nfor the tax‑exempt bond market. All bonds in the Index must be exempt from federal taxes, U.S. dollar       \ndenominated and have an average rating of Baa3/BBB‑ or higher by the following statistical ratings agencies:\nMoody’s Investors Service, Inc., S&P Global Ratings, and Fitch Ratings Inc. In addition, to be included in  \nthe Index, a security must (i) not be subject to alternative minimum tax; (ii) have a fixed coupon schedule;\n(iii) have at least one year remaining term to final maturity; (iv) have at least 18 months to final        \nmaturity at the time of issuance; and (v) meet the following minimum size requirements: (a) have a minimum  \ncurrent amount outstanding of $5 million for bonds with an initial term to final maturity of less than 3    \nyears; (b) have a minimum current amount outstanding of $7 million for bonds with an initial term to final  \nmaturity of 3 to 15 years; and (c) have a minimum current amount outstanding of $10 million for bonds with  \nan initial term to final maturity of 15 or more years. Securities included in the Index may include when-   \nissued securities and zero‑coupon bonds. Secondarily insured bonds, Rule 144A bonds, bonds issued under the \nmunicipal liquidity facility or a municipal commercial paper program are excluded from the Index. The Index \nis rebalanced and reconstituted monthly on the last calendar day of the month. As of March 31, 2025, there  \nwere 58,389 securities in the Index.                                                                        \n                                                                                                            \nThe Index is sponsored by ICE Data Indices, LLC (the “Index Provider”), which is not affiliated with the    \nFund, the Adviser or the Sub‑Adviser. The Index Provider determines the composition of the Index, relative  \nweightings of the securities in the Index and publishes information regarding the market value of the Index.\n                                                                                                            \n  3.  The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section in the Fund’s Prospectus and Summary           \n      Prospectus is updated to add the following risk as a principal risk of the Fund.                      \n                                                                                                            \nZero-Coupon Bond Risk:Zero-coupon bonds usually trade at a deep discount from their face or par values and  \nare subject to greater market value fluctuations from changing interest rates than debt obligations of      \ncomparable maturities that make current distributions of interest.                                          \n                                                                                                            \n  4.  The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to       \n      reflect that “Zero-Coupon Bond Risk” is a principal risk of the Fund.                                 \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 051225SUPP2                                              \n"
}