{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-12-15",
  "accession_number": "0001193125-23-296716",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-296716-index.html",
  "text": "SPDR ®SERIES TRUST SPDR S&P Kensho Intelligent Structures ETF (the “Fund”) Supplement dated December 15,\n2023to the Prospectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time\nto time Effective after the close of trading on December 15, 2023 (the “Effective Date”), changes were made\nto the methodology for the Fund’s underlying index, the S&P Kensho Intelligent Infrastructure Index. As a\nresult, as of the Effective Date, “ THE FUND ’ S PRINCIPAL INVESTMENT STRATEGY ” section in the Prospectus\nand Summary Prospectus is replaced in its entirety with the following: In seeking to track the performance\nof the S&P Kensho Intelligent Infrastructure Index (the “Index”), the Fund employs a sampling strategy,\nwhich means that the Fund is not required to purchase all of the securities represented in the Index.\nInstead, the Fund may purchase a subset of the securities in the Index in an effort to hold a portfolio of\nsecurities with generally the same risk and return characteristics of the Index. The quantity of holdings in\nthe Fund will be based on a number of factors, including asset size of the Fund. Based on its analysis of\nthese factors, SSGA Funds Management, Inc. (“SSGA FM” or the “Adviser”), the investment adviser to the Fund,\neither may invest the Fund’s assets in a subset of securities in the Index or may invest the Fund’s assets\nin substantially all of the securities represented in the Index in approximately the same proportions as the\nIndex, as determined by the Adviser to be in the best interest of the Fund in pursuing its objective. Under\nnormal market conditions, the Fund generally invests substantially all, but at least 80%, of its total\nassets in the securities comprising the Index. In addition, in seeking to track the Index, the Fund may\ninvest in equity securities that are not included in the Index, cash and cash equivalents or money market\ninstruments, such as repurchase agreements and money market funds (including money market funds advised by\nthe Adviser). In seeking to track the Index, the Fund’s assets may be concentrated in an industry or group\nof industries, but only to the extent that the Index concentrates in a particular industry or group of\nindustries. Futures contracts (a type of derivative instrument) may be used by the Fund in seeking\nperformance that corresponds to the Index and in managing cash flows. The Index is comprised of U.S.-listed\nequity securities (including depositary receipts) of companies domiciled across developed and emerging\nmarkets worldwide which are included in the Intelligent Infrastructure sector as determined by a\nclassification standard produced by S&P Dow Jones Indices LLC (the “Index Provider”). The Index is designed\nto capture companies whose products and services are driving innovation behind intelligent infrastructure.\nIn particular, the Index comprises the components of the (i) S&P Kensho Smart Grids Index focused on power\ngrid technologies (with an emphasis on efficient management and use of\n\nenergy, and improved power grid reliability), transportation infrastructure (with an emphasis on enhancing\nthe efficiency of transportation infrastructure, as well as the new infrastructure capabilities required for\nalternative modes of transportation such as autonomous vehicles), and water infrastructure (with an emphasis\non water conversion and increasing the water supply), and (ii) the S&P Kensho Smart Buildings Index focused\non intelligent and connected home technologies and building automation infrastructure (the “Underlying\nIndexes”) as of the Index’s reconstitution reference date. The Underlying Indexes are subject to the\nfollowing liquidity thresholds for each component: (i) must have a share price of at least USD $1.00; (ii)\nmust be issued by a company with a minimum float market capitalization of at least $100 million; and (iii)\nmust have a minimum three-month average daily traded value of at least $1 million. The S&P Kensho Smart\nGrids Index seeks to track companies that provide next generation products and services related to power,\nwater and transportation infrastructures, or are a necessary component of the supply chain for such products\nand services. The S&P Kensho Smart Buildings Index seeks to track companies that produce products and\nservices that enable buildings to become more connected, intelligent and adaptive, or are a necessary\ncomponent of the supply chain for such products and services. To determine the constituents of the\nUnderlying Indexes, the Index Provider’s classification standard utilizes an automated scan of companies’\nmost recent regulatory filings with the U.S. Securities and Exchange Commission on Form 10‑K, Form 20‑F,\nForm 40‑F, or Form S‑1, as applicable, maintained in the S&P Market Intelligence United Document Repository,\nto identify specific search terms and phrases that describe a company as producing products and services\nrelated to the particular segment targeted by the Underlying Index. The resulting list of eligible\nsecurities for each Underlying Index is then filtered by eliminating companies that do not include in their\nregulatory filings a reference to a product or service that (i) is related to a search term or phrase and\n(ii) is used in a manner that is within the scope of the Underlying Index’s objective. Each Underlying Index\nthen screens the remaining securities to remove securities that are not listed on NYSE, NASDAQ, or CBOE\nexchanges (or an affiliate of one of those exchanges) or do not meet certain minimum liquidity thresholds.\nThe Index Provider’s Index Committee then reviews each remaining eligible constituent to verify the rules of\nthe automated scan were implemented correctly. Underlying Index constituents are then categorized as either\n“Core” or “Non‑Core.” A company is categorized as Core if its products and services related to the\nUnderlying Index’s objective are identified in its regulatory filings as principal components of the\ncompany’s strategy. Products and services are deemed to be principal components of a company’s strategy if\nthe company’s regulatory filing disclosures regarding such products and services are determined to be\nsufficiently prominent according to a proprietary algorithm of the Index Provider which calculates\nprominence based on the frequency and position of such disclosures within regulatory filings. A company may\nalso be categorized as Core if the Index Provider determines that the majority of the company’s revenue is\nderived\n\nfrom products and services related to the Underlying Index’s objective as indicated by the company’s\nreported business segments, which is assessed by scanning the S&P Capital IQ Database for annual fiscal year\nrevenue segment reporting. All other companies are categorized as Non‑Core, including companies whose\nproducts and services are identified as forming a necessary component of the supply chain of the segment\ntargeted by the Underlying Index. An Index constituent categorized as Core by at least one of the Underlying\nIndexes will be categorized as Core for purposes of the Index. To tilt the Index’s exposure toward Core\nIndex Constituents, at the time of each rebalance the aggregate weighting of Core Index Constituents is\nbased on the proportion of the number of Core Index Constituents, plus an overweight factor of up to 20%. At\nthe time of each rebalance, each Core Index Constituent and Non‑Core Index Constituent is equally weighted\nwithin the group of Core Index Constituents and Non‑Core Index Constituents, respectively, subject to\nliquidity and diversification adjustments. The Index is reconstituted and rebalanced after the close of\ntrading on the third Friday in June with a reference date as of the close of the last trading day in May. In\naddition, the Index is rebalanced after the close of trading on the third Friday of December with a\nreference date as of the close of the last trading day in November. In connection with the December\nrebalance, Index constituents are also evaluated for continued inclusion in the Index if a new eligible\nregulatory filing has been filed since the last reconstitution review. As of December 15, 2023, the Index\ncomprised 50 securities. The Index Provider is not affiliated with the Fund or the Adviser. The Index\nProvider establishes and maintains rules which are used to determine the composition of the Index and\nrelative weightings of the securities in the Index.\n                             PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE                             \n                                                                                                 121523SUPP5\n"
}