{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-04-26",
  "accession_number": "0001193125-24-116236",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-116236-index.html",
  "text": "SPDR ®SERIES TRUST\n\nSPDR Bloomberg 1-3Month T-BillETF\n\nSPDR Bloomberg 3-12Month T-BillETF\n\nSupplement dated April 26, 2024 to the Prospectus, Summary Prospectuses and Statement of Additional\n\nInformation (\u0093SAI\u0094), each dated October 31, 2023, as may be supplemented from time to time\n\nEffectively immediately, Todd Bean and Sean Lussier are replaced as portfolio managers of the SPDR Bloomberg\n1-3Month T-BillETF and the SPDR Bloomberg 3-12Month T-Bill ETF (each, a \u0093Fund\u0094, and collectively, the\n\u0093Funds\u0094) by James Kramer, Joanna Madden and Cynthia Moy. Accordingly, effective immediately, the Prospectus,\nSummary Prospectuses and SAI are revised as follows:\n                                                                                                            \n      All references to Todd Bean and Sean Lussier as a portfolio manager of the Funds in the Prospectus,   \n  1)  Summary                                                                                               \n      Prospectuses and SAI are deleted.                                                                     \n                                                                                                            \n                                                                                                            \n      The \u0093PORTFOLIO MANAGERS\u0094 section for the SPDR Bloomberg                                                 \n  2)  1-3 Month T-Bill ETF on page 4 of the Prospectus and Summary Prospectus is deleted and replaced with  \n      the following:                                                                                        \n                                                                                                            \nThe professionals primarily responsible for the day-to-day\nmanagement of the Fund are James Kramer, Joanna Madden and Cynthia Moy.\n\nJames Kramer is a Vice President of the Adviser and a Senior\nPortfolio Manager in the Fixed Income Beta Solutions Group. He joined the Adviser in 1996.\n\nJoanna Madden is a Vice President of the\nAdviser and a Portfolio Manager in the Fixed Income Beta Solutions Group. She joined the Adviser in 2003.\n\nCynthia Moy is a Principal of\nthe Adviser and a Portfolio Manager in the Fixed Income Beta Solutions Group. She joined the Adviser in\n2007.\n                                                                                                            \n      The \u0093PORTFOLIO MANAGERS\u0094 section for the SPDR Bloomberg                                                 \n  3)  3-12 Month T-Bill ETF on page 9 of the Prospectus, and page 4 of the Summary Prospectus, is deleted   \n      and replaced with the following:                                                                      \n                                                                                                            \nThe professionals primarily responsible for the day-to-day\nmanagement of the Fund are James Kramer, Joanna Madden and Cynthia Moy.\n\nJames Kramer is a Vice President of the Adviser and a Senior\nPortfolio Manager in the Fixed Income Beta Solutions Group. He joined the Adviser in 1996.\n\nJoanna Madden is a Vice President of the\nAdviser and a Portfolio Manager in the Fixed Income Beta Solutions Group. She joined the Adviser in 2003.\n\nCynthia Moy is a Principal of the Adviser and a Portfolio Manager in the Fixed Income Beta\nSolutions Group. She joined the Adviser in 2007.\n                                                                                                    \n  4)  The \u0093Portfolio Managers\u0094 table on page 157 of the Prospectus is revised in accordance with the  \n      Funds\u0092 new portfolio management teams listed in items 2 and 3 above.                           \n                                                                                                    \n                                                                                                    \n  5)  The \u0093Portfolio Management Team\u0094 table beginning on page 48 of the SAI is revised in accordance  \n      with the Funds\u0092 new portfolio management teams listed in items 2 and 3 above.                  \n                                                                                                    \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE\n\n042624SUPP1\n"
}