{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-02-22",
  "accession_number": "0001193125-24-042865",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-042865-index.html",
  "text": "SPDR ®Series Trust\n\nSupplement dated February 22, 2024 to the\n\nStatement of Additional Information (\u0093SAI\u0094) dated October 31, 2023,\n\nas may be supplemented from time to time\n\nEffective immediately, the following replaces the first paragraph in the\n\n\u0093GENERAL DESCRIPTION OF THE TRUST\u0094 section in the SAI:\n\nThe Trust is an open-end management investment company, registered under the Investment Company Act of 1940,\nas\namended (the \u00931940 Act\u0094). The Trust was organized as a Massachusetts business trust on June 12, 1998, and\nconsists of multiple investment series, including the Equity ETFs and Fixed Income ETFs (each, a \u0093Fund\u0094 and\ncollectively, the \u0093Funds\u0094). The SPDR Global Dow ETF was established on September 11, 2000.\n\nThe offering of each Fund\u0092s shares\n(\u0093Shares\u0094) is registered under the Securities Act of 1933, as amended (the \u0093Securities Act\u0094). The investment\nobjective of each Fund is to provide investment results that, before fees and expenses, correspond generally\nto the\ntotal return (or in the case of the Fixed Income ETFs, the price and yield performance) of a specified\nmarket index (each an \u0093Index\u0094 and together the \u0093Indexes\u0094). SSGA Funds Management, Inc. (\u0093SSGA FM\u0094 or the\n\u0093Adviser\u0094) serves as the investment adviser for each Fund and certain funds are sub-advised by a sub-adviser\nas further described herein (the \u0093Sub-Adviser\u0094). To the extent that a reference in this SAI refers to the\n\u0093Adviser,\u0094 such reference should also be read to refer to the Sub-Adviser where\nthe context requires.\n\nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE\n\n022224SUPP1\n"
}