{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-04-30",
  "accession_number": "0001193125-24-124158",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-124158-index.html",
  "text": "SPDR ®Series Trust SPDR S&P SmallCap 600 ESG ETF (the “Fund”) Supplement dated April 30, 2024to the\nProspectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time to time\nEffective immediately, the methodology for the S&P SmallCap 600 ESG Index (the “Index”) has been updated.\nAccordingly, effective immediately:\n                                                                                                            \n  1.  “THE FUND’S PRINCIPAL INVESTMENT STRATEGY” section beginning on page 23 of the Prospectus and page 1  \n      of the Summary Prospectus is deleted and replaced with the following:                                 \n                                                                                                            \nIn seeking to track the performance of the S&P SmallCap 600 ESG Index (the “Index”), the Fund employs a\nsampling strategy, which means that the Fund is not required to purchase all of the securities represented\nin the Index. Instead, the Fund may purchase a subset of the securities in the Index in an effort to hold a\nportfolio of securities with generally the same risk and return characteristics of the Index. The quantity\nof holdings in the Fund will be based on a number of factors, including asset size of the Fund. Based on its\nanalysis of these factors, SSGA Funds Management, Inc. (“SSGA FM” or the “Adviser”), the investment adviser\nto the Fund, either may invest the Fund’s assets in a subset of securities in the Index or may invest the\nFund’s assets in substantially all of the securities represented in the Index in approximately the same\nproportions as the Index, as determined by the Adviser to be in the best interest of the Fund in pursuing\nits objective. Under normal market conditions, the Fund generally invests substantially all, but at least\n80%, of its total assets in the securities comprising the Index. In addition, in seeking to track the Index,\nthe Fund may invest in equity securities that are not included in the Index, cash and cash equivalents or\nmoney market instruments, such as repurchase agreements and money market funds (including money market funds\nadvised by the Adviser). In seeking to track the Index, the Fund’s assets may be concentrated in an industry\nor group of industries, but only to the extent that the Index concentrates in a particular industry or group\nof industries. Futures contracts (a type of derivative instrument) may be used by the Fund in seeking\nperformance that corresponds to the Index and in managing cash flows. The Index is designed to measure the\nperformance of securities meeting certain sustainability criteria (criteria related to ESG factors), while\nmaintaining similar overall industry group weights as the S&P SmallCap 600 Index. The S&P SmallCap 600 Index\nmeasures the performance of the small-capitalization segment of the U.S. equity market. Securities eligible\nfor inclusion in the Index comprise all constituents of the S&P SmallCap 600 Index except for:\n                                                                                                            \n  •    Companies that meet any of the following Business Involvement Exclusions, based on revenue levels    \n       as determined by S&P Global, Inc. (an affiliate of the Index Provider (defined below)):              \n                                                                                                            \n                                                                                                            \n       Companies that derive any amount of revenue from manufacturing tobacco products, 5% or greater of    \n  •    their revenue from supplying products and services essential for the tobacco industry, or 5% or      \n       greater of their revenue from the distribution and/or retail sale of tobacco products;               \n                                                                                                            \n                                                                                                            \n       “Controversial Weapons Companies,” defined as companies that derive any amount of revenue from (i)   \n       manufacturing components intended solely for use in the production of and are essential for the      \n  •    functioning of anti-personnel mines, biological and chemical weapons, blinding laser weapons,        \n       cluster munitions, depleted uranium, incendiary weapons and nuclear weapons (collectively,           \n       “Controversial Weapons”), or (ii) products and/or services related to the sale, supply and transfer  \n       of Controversial Weapons;                                                                            \n                                                                                                            \n                                                                                                            \n  •    Companies that derive 5% or greater of their revenue from the extraction and/or production of        \n       fossil fuels from oil/tar sands;                                                                     \n                                                                                                            \n                                                                                                            \n       Companies that (i) derive any amount of revenue from the manufacturing of small arms weapons for     \n  •    civilian or non‑civilian use, or key components of assault weapons; or (ii) derive 5% or greater of  \n       their revenue from the retail or distribution of small arms weapons for civilian customers;          \n                                                                                                            \n                                                                                                            \n       Companies that derive 10% or greater of their revenue from (i) manufacturing, assembling, selling    \n  •    and transporting weapons, equipment, structures, and vehicles, or providing vehicle and equipment    \n       maintenance services and logistics and operations support, specifically for the purposes of warfare  \n       , or (ii) manufacturing and selling military weapon-related products; or                             \n                                                                                                            \n                                                                                                            \n  •    Companies that derive 5% or greater of their revenue from (i) owning and/or operating coal mines     \n       that engage in thermal coal mining or (ii) electricity generation using coal powered plants.         \n                                                                                                            \n                                                                                                    \n  •    Companies that hold 25% or greater ownership stakes (as determined by S&P Global, Inc.) in:  \n                                                                                                    \n                                                                                         \n  •    Companies that derive any amount of revenue from manufacturing tobacco products;  \n                                                                                         \n                                            \n  •    Controversial Weapons Companies; or  \n                                            \n                                                                                                            \n  •    Companies that derive any amount of revenue from the manufacturing of small arms weapons for         \n       civilian and non‑civilian use, or key components of assault weapons.                                 \n                                                                                                            \n                                                                                                            \n       Companies that are classified by Sustainalytics to be non‑compliant with the United Nations Global   \n       Compact (“UNGC”) principles (“Non‑Compliant UNGC Companies”). Non‑Compliant UNGC Companies are (i)   \n       companies found to have been responsible for egregious and severe violations of commonly accepted    \n  •    international norms related to human rights, labor rights, the environment and business ethics, or   \n       (ii) companies deemed to facilitate third parties in human rights violations due to their            \n       involvement in certain weapons with disproportional and/or non‑discriminatory impact on citizens     \n       and society;                                                                                         \n                                                                                                            \n                                                                                                            \n       Companies that (i) have an S&P Global ESG Score that falls within the worst 25% of scores from each  \n       Global Industry Classification Standard (GICS) industry group in the underlying universe of          \n  •    companies eligible for inclusion in the Index (the “Investment Universe”), or (ii) fall within the   \n       worst 10% of scores in the Investment Universe. If less than 75% of the weight of the Investment     \n       Universe remains eligible, constraints (i) and (ii) will be relaxed; or                              \n                                                                                                            \n                                                                                                            \n       Companies that do not have (i) coverage for determining tobacco-, controversial weapons-, oil        \n  •    sands-, small arms-, military weapons- and thermal coal-related involvement or compliance with UNGC  \n       principles; or (ii) an S&P Global ESG Score.                                                         \n                                                                                                            \nS&P Global ESG Scores are assigned by S&P Global, Inc., using its Corporate Sustainability Assessment, which\nis an annual evaluation of a company, based on ESG factors that S&P Global, Inc. determines are financially\nmaterial to the company, relative to its industry peer companies. After implementing the exclusion criteria\ndescribed above, the remaining companies are then ranked based on their S&P Global ESG Score. For each GICS\nindustry group, companies are selected for inclusion in the Index primarily in decreasing order of S&P\nGlobal ESG Score until approximately 75% of the float adjusted market capitalization of the industry group\nis reached. The Index is float-adjusted market capitalization weighted. A company’s float-adjusted market\ncapitalization is calculated by multiplying the number of shares readily available in the market by the\nprice of such shares. The Index is reconstituted and rebalanced annually on the last business day in April\nbased on information as of the last trading date in March. In addition, companies will be removed from the\nIndex (i) on the last business day of July, October and January, if found to meet a Business Involvement\nExclusion as of the last business day of the previous month, or (ii) on the third Friday of March, June,\nSeptember and December if found to be a Non‑Compliant UNGC Company as of the last business day of the\nprevious month. In addition, between Index rebalances, Index constituents may be removed from the Index for\ntheir involvement in economic crime and corruption, fraud, illegal commercial practices, human rights\nabuses, labor disputes, workplace safety catastrophic accidents, environmental disasters, and certain other\nactivities associated with environmental, social and governance risks. Any companies removed from the Index\non 2 account of such activities are not eligible for inclusion in the Index until one full calendar year\nfrom the next rebalancing of the Index. As of April 30, 2024, a significant portion of the Fund comprised\ncompanies in the technology sector, although this may change from time to time. As of April 30, 2024, the\nIndex comprised 405 stocks. The Index is sponsored by S&P Dow Jones Indices LLC (the “Index Provider”),\nwhich is not affiliated with the Fund or the Adviser. The Index Provider determines the composition of the\nIndex, relative weightings of the securities in the Index and publishes information regarding the market\nvalue of the Index.\n                                                                                                            \n      The “PRINCIPAL RISKS OF INVESTING IN THE FUND” section beginning on page 25 of the Prospectus and     \n  2.  page 3 of the Summary Prospectus is updated to delete the “Financial Sector Risk” and “Industrial     \n      Sector Risk” discussions and to add the following risk as principal risk of the Fund.                 \n                                                                                                            \nTechnology Sector Risk:Market or economic factors impacting technology companies and companies that rely\nheavily on technological advances could have a major effect on the value of the Fund’s investments. The\nvalue of stocks of technology companies and companies that rely heavily on technology is particularly\nvulnerable to rapid changes in technology product cycles, rapid product obsolescence, government regulation\nand competition, both domestically and internationally, including competition from foreign competitors with\nlower production costs. Stocks of technology companies and companies that rely heavily on technology,\nespecially those of smaller, less-seasoned companies, tend to be more volatile than the overall market.\nTechnology companies are heavily dependent on patent and intellectual property rights, the loss or\nimpairment of which may adversely affect profitability. Additionally, companies in the technology sector may\nface dramatic and often unpredictable changes in growth rates and competition for the services of qualified\npersonnel.\n                                                                                                            \n      The risk chart within the “ADDITIONAL RISK INFORMATION” section of the Prospectus is updated to (i)   \n  3.  remove “Financial Sector Risk” and “Industrial Sector Risk”, and (ii) reflect that “Technology        \n      Sector Risk” is a principal risk of the Fund. In addition, the “Financial Sector Risk” and            \n      “Industrial Sector Risk” discussions beneath the risk chart are deleted.                              \n                                                                                                            \nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 043024SUPP2\n"
}