{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2024-05-31",
  "accession_number": "0001193125-24-151720",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-24-151720-index.html",
  "text": "SPDR ®SERIES TRUST SPDR MSCI USA Climate Paris Aligned ETF (the “Fund”) Supplement dated May 31, 2024to the\nProspectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time to time The\nFund seeks to track the performance of the MSCI USA Climate Paris Aligned Index (the “Index”). Effective May\n31, 2024, the Index’s methodology has been updated to reflect the addition of certain constraints\nincorporated into the Index’s optimization process. As a result, effective immediately, the third through\neleventh paragraphs in “THE FUND’S PRINCIPAL INVESTMENT STRATEGY” section in the Prospectus and Summary\nProspectus are replaced with the following: The Index is designed to exceed the minimum standards for a\n“Paris-Aligned Benchmark” under the EU BMR. A Paris-Aligned Benchmark is designed to align with a principal\nobjective of the Paris Agreement (a binding international treaty agreement on climate change) to limit the\nincrease in the global average temperature to well below 2 degrees Celsius (preferably 1.5 degrees Celsius)\nabove pre‑industrial levels. The initial universe from which the Index selects constituents is the MSCI USA\nIndex (the “Parent Index”), which measures the performance of the large- and mid‑capitalization segments of\nthe U.S. equity market. To construct the universe of constituents eligible for inclusion in the Index (the\n“Eligible Universe”), the Parent Index is first screened to remove securities of issuers based on the\nfollowing exclusionary criteria:\n                                                                                                            \n       All companies producing cluster bombs, landmines, depleted uranium, chemical or biological weapons,  \n       blinding laser weapons, non‑detectable fragments or incendiary weapons; producing key components of  \n  •    cluster bombs, landmines, depleted uranium weapons, or chemical or biological weapons; owning 20%    \n       or more (50% for financial companies) of a weapons or components producer; or that are 50% or more   \n       owned by a company involved in weapons or components production.                                     \n                                                                                                            \n                                                                                                            \n  •    All companies assigned an MSCI ESG (environmental, social or governance) Controversy Score of 0 or   \n       that are not assigned an MSCI ESG Controversy Score.                                                 \n                                                                                                            \n                                                                                                            \n  •    All companies that produce tobacco or derive 5% or more aggregate revenue from the production,       \n       distribution, retail and supply of tobacco-related products.                                         \n                                                                                                            \n                                                                                  \n  •    All companies assigned an MSCI Environmental Controversy Score of 0 or 1.  \n                                                                                  \n                                                                                                            \n       All companies deriving 1% or more revenue from mining of thermal coal and its sale to external       \n  •    parties (excluding all revenue from metallurgical coal, coal mined for internal power generation,    \n       intracompany sales of mined thermal coal, and coal trading).                                         \n                                                                                                            \n                                                                                                            \n       All companies deriving 10% or more revenue from oil and gas related activities, including            \n  •    distribution/retail, equipment and services, extraction and production, petrochemicals, pipelines    \n       and transportation and refining (excluding biofuel production and sales and trading activities).     \n                                                                                                            \n                                                                                                            \n  •    All companies deriving 50% or more revenue from thermal coal based, liquid fuel based and natural    \n       gas based power generation.                                                                          \n                                                                                                            \n                                                                                                            \n       All companies that produce firearms and small arms ammunitions for civilian markets (excluding       \n  •    companies that cater to military, government and law enforcement markets) or derive 5% or more       \n       revenue from the production and distribution of firearms or small arms ammunition intended for       \n       civilian use.                                                                                        \n                                                                                                            \n                                                                                                            \n       All companies that (i) manufacture nuclear warheads and/or whole nuclear missiles; (ii) manufacture  \n  •    components that were developed or are significantly modified for exclusive use in nuclear warheads   \n       and/or nuclear missiles; (iii) manufacture or assemble delivery platforms that were developed or     \n       significantly modified                                                                               \n                                                                                                            \n                                                      \n  for the exclusive delivery of nuclear weapons;      \n  (iv) provide auxiliary services related to nuclear  \n  weapons; (v) manufacture components that were not   \n  developed or not significantly modified for         \n  exclusive use in nuclear warheads and/or nuclear    \n  missiles but can be used in nuclear weapons; (vi)   \n  manufacture or assemble delivery platforms that     \n  were not developed or not significantly modified    \n  for the exclusive delivery of nuclear weapons but   \n  have the capability to deliver nuclear weapons;     \n  and (vii) manufacture components for                \n  nuclear-exclusive delivery platforms.               \n                                                      \nThe Index Provider incorporates data drawn from a number of sources for applying the exclusionary screens.\nAn MSCI ESG Controversy Score provides an assessment of controversies concerning any negative environmental,\nsocial, and/or governance impact of a company’s operations, products, and services. To evaluate ESG\ncontroversies, the Index Provider monitors across five categories of ESG impact – environment, human rights\nand communities, labor rights and supply chain, customers and governance – and 28 sub‑categories. MSCI ESG\nControversy Scores fall on a 0‑10 scale, with 0 representing a company assessed as having involvement in\nvery severe controversies. An MSCI Environmental Controversy Score provides an assessment of controversies\nrelated to a company’s impact on the environment. Environmental controversies can relate to, among other\nthings, toxic emissions and waste, operational waste (non‑hazardous), energy and climate change, water\nstress, biodiversity and land use, and supply chain management. MSCI Environmental Controversy Scores fall\non a 0‑10 scale, with 0 and 1 representing a company having faced very severe and severe controversies\npertaining to environmental issues, respectively. The final portfolio of securities is constructed using an\noptimization process that seeks to select and weight securities from the Eligible Universe based on\nconstraints designed to (i) minimize the Index’s exposure to physical and transition risks of climate change\n(“transition and physical risk objectives”) and (ii) target exposure to sustainable investment opportunities\n(“transition opportunities objectives”). In addition, the optimization process also incorporates target\nconstraints to seek to minimize the risk of significant differences in constituent or sector weightings\nrelative to the Parent Index, while aiming to control for constituent turnover and minimize tracking error\nrelative to the Parent Index (“target diversification constraints”). The optimization process incorporates\nthe following Index-level constraints to achieve transition and physical risk objectives:\n                                                                                                            \n       At least 50% reduction in the weighted average of index constituents’ greenhouse gas (“GHG”)         \n       Intensity relative to the Parent Index, taking into account Scope 1, 2 and 3 emissions. Scope 1      \n       emissions are direct GHG emissions that occur from sources that are controlled or owned by an        \n       organization. Scope 2 emissions are indirect GHG emissions generated in the production of            \n  •    electricity consumed by the organization. Scope 3 emissions encompass all other indirect GHG         \n       emissions that are a consequence of the activities of the organization, but occur from sources not   \n       owned or controlled by the organization. GHG Intensity measures a company’s Scope 1, 2 and 3         \n       emissions relative to its enterprise value including cash. MSCI ESG Research uses a proprietary      \n       estimation model to calculate all Scope 3 emissions, and Scope 1 and Scope 2 emissions for           \n       companies who do not report GHG emissions.                                                           \n                                                                                                            \n                                                                                                            \n       At least 10% average reduction (per year) in GHG Intensity relative to GHG Intensity of the Index    \n  •    as of June 1, 2020.                                                                                  \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                            \n                                                                                                            \n       Aggregate exposure to High Climate Impact Sectors that is not less than the aggregate exposure in    \n  •    the Parent Index. High Impact Climate Sectors are defined by EU BMR as those sectors that are key    \n       to the low‑carbon transition.                                                                        \n                                                                                                            \n                                                                                                            \n       At least 20% increase, relative to the Eligible Universe, in the aggregate weight of companies (i)   \n       having one or more active carbon emissions reduction target(s) approved by the Science Based         \n  •    Targets initiative (SBTi), or (ii) companies that (a) publish emissions reduction targets, (b)       \n       publish their annual emissions levels, and (c) have reduced their GHG intensity by at least 7% over  \n       each of the last three years.                                                                        \n                                                                                                            \n                                                                                                            \n       At least 50% reduction in the weighted average of index constituents’ Potential Emissions Intensity  \n  •    relative to the Parent Index. Potential Emissions Intensity represents the sum of a company’s        \n       estimated carbon emissions assuming the company uses its owned coal, oil and gas reserves relative   \n       to the company’s enterprise value including cash.                                                    \n                                                                                                            \n                                                                                                            \n       Aggregate Climate Value‑at‑Risk (“VaR”) greater than or equal to ‑5% of the aggregate Climate VaR    \n  •    of the Parent Index. Climate VaR is designed to provide a forward looking assessment of the impacts  \n       of climate change on a company’s valuation based on various global average temperature warming       \n       scenarios.                                                                                           \n                                                                                                            \n                                                                                                            \n       At least 5% increase in the weighted average of index constituents’ Low Carbon Transition (LCT)      \n  •    Score relative to the Parent Index. The LCT Score seeks to identify a company’s exposure to and      \n       management of risk and opportunities related to low carbon transition.                               \n                                                                                                            \n                                                                                                            \n       At least 50% reduction in the weighted average of index constituents’ Physical Risk Climate VaR      \n       (Aggressive Scenario) relative to the Parent Index. Physical Climate VaR (Aggressive Scenario) is    \n  •    an assessment of a company’s “worst-case” (95th percentile) future costs arising from extreme        \n       weather events and the potential impact of such costs on the company’s future financial              \n       performance, assuming emissions and temperatures rise steadily, reaching approximately 4°C of        \n       global warming in 2100.                                                                              \n                                                                                                            \nThe optimization process incorporates the following Index-level constraints to achieve transition\nopportunities objectives:\n                                                                                                            \n  •    At least 5% increase in weighted average of index constituents’ LCT Score relative to Parent Index.  \n                                                                                                            \n                                                                                                            \n       At least 400% increase in the ratio of Weighted Average Green Revenue/Weighted Average Fossil        \n       Fuel-based Revenue relative to the Parent Index. Weighted Average Green Revenue represents the       \n       weighted average of index constituents’ percentage of revenue derived from alternative energy,       \n       energy efficiency, sustainable water, green building, pollution prevention, and sustainable          \n  •    agriculture. Weighted Average Fossil Fuel-based Revenue represents the weighted average of index     \n       constituents’ percentage of revenue derived from the mining of thermal coal (excluding               \n       metallurgical coal, coal mined for internal power generation, intra-company sales of mined thermal   \n       coal and revenue from coal trading) or its sale to external parties, extraction, production and      \n       refining of conventional and unconventional oil and gas, and power generation based on thermal       \n       coal, liquid fuel, and natural gas.                                                                  \n                                                                                                            \n                                                                                               \n  •    At least 100% increase in Weighted Average Green Revenue relative to the Parent Index.  \n                                                                                               \n                                                                                                            \n       An Index Implied Temperature Rise of 2 degrees Celsius or below. The Index Provider’s Implied        \n       Temperature Rise model estimates the Index constituents’ alignment to a specific global temperature  \n  •    rise scenario based on projected forward-looking emissions. Companies that do not have data          \n       available to calculate Implied Temperature Rise are still eligible for Index inclusion but are not   \n       considered for the Index Implied Temperature Rise calculation.                                       \n                                                                                                            \n                                                                                                            \n       Aggregate Cumulative Projected Emissions aligned with an Implied Temperature Rise of 1.5 degrees or  \n       below. Cumulative Projected Emissions is an estimation of a company’s total carbon emissions until   \n  •    2050, based on decarbonization assumptions. Companies that do not have data available to calculate   \n       Cumulative Projected Emissions are still eligible for Index inclusion but are not considered in the  \n       Index-level aggregation.                                                                             \n                                                                                                            \nThe Index’s optimization process incorporates information and data from internal and external (e.g.,\nissuers, government agencies and non‑profit organizations) sources, including research, reports,\npublications or public records. The Index is rebalanced and reconstituted on a semi-annual basis, as of the\nclose of the last business day of May and November. The optimization process described above is applied in\nconnection with the semi-annual Index review. During the semi-annual Index review, in the event the Index-\nlevel constraints are not met through the optimization process, certain target diversification constraints\nwill be relaxed until the Index-level constraints are achieved. As of May 31, 2024, a significant portion of\nthe Fund comprised companies in the technology sector, although this may change from time to time. As of May\n31, 2024, the Index comprised 254 stocks. The Index is sponsored by MSCI, Inc. (the “Index Provider”), which\nis not affiliated with the Fund or the Adviser. The Index Provider determines the composition of the Index,\nrelative weightings of the securities in the Index and publishes information regarding the market value of\nthe Index. PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE 053124SUPP1\n"
}