{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-11-09",
  "accession_number": "0001193125-23-274516",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-274516-index.html",
  "text": "SPDR ®SERIES TRUST\n\n(the \u0093Trust\u0094)\n\nSPDR S&P Internet ETF\n\n(the \u0093Fund\u0094)\n\nSupplement dated November 9, 2023\n\nto the Summary Prospectus, Prospectus and Statement of Additional Information\n\neach dated October 31, 2023, as may be supplemented from time to time\n\nOn November 8, 2023, at the recommendation of SSGA Funds Management, Inc., the Trust\u0092s investment adviser,\nthe Trust\u0092s Board of Trustees voted\nto close and liquidate the Fund.\n\nThe Fund will create and redeem creation units through January 2, 2024, which will also be the last day of\ntrading\nof the Fund\u0092s shares on the NYSE Arca, Inc., the Fund\u0092s principal U.S. listing exchange. The Fund will cease\noperations, liquidate its assets, and prepare to distribute proceeds to shareholders of record on or about\nJanuary 8, 2024\n(the \u0093Liquidation Date\u0094). Shareholders of record of the Fund remaining on the Liquidation Date will receive\ncash at the net asset value of their shares as of such date, which will include any net capital gains and\nnet investment income as\nof this date that had not been previously distributed.\n\nPrior to the Liquidation Date, the Fund will be in the process of closing down and liquidating its\nportfolio, which will result in the Fund not tracking its Index and increasing its holdings in cash and/or\ncash equivalents, which may not be consistent with the Fund\u0092s investment objective and strategy.\nShareholders of the Fund may sell their\nholdings on the NYSE Arca, Inc. prior to January 3, 2024. Customary brokerage charges may apply to such\ntransactions. From January 3, 2024 through the Liquidation Date, we cannot assure you that there will be a\nmarket for your shares.\n\nOn or about January 9, 2024, the Fund will distribute to its remaining shareholders a liquidating cash\ndistribution equal to the current net asset value\nof their shares. While Fund shareholders remaining on the Liquidation Date will not incur transaction fees,\nany liquidation proceeds paid to shareholders should generally be treated as received in exchange for shares\nand will therefore generally\ngive rise to a capital gain or loss depending on a shareholder\u0092s tax basis. Shareholders should contact\ntheir tax adviser to discuss the income tax consequences of the liquidation.\n\nShareholders can\ncall 1-866-787-2257 for additional information.\n\nPLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE\n\n110923SUPP1\n"
}