{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-12-15",
  "accession_number": "0001193125-23-296711",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-296711-index.html",
  "text": "SPDR ®SERIES TRUST SPDR S&P Kensho Future Security ETF (the “Fund”) Supplement dated December 15, 2023to the\nProspectus and Summary Prospectus, each dated October 31, 2023, as may be supplemented from time to time\nEffective after the close of trading on December 15, 2023 (the “Effective Date”), changes were made to the\nmethodology for the Fund’s underlying index, the S&P Kensho Future Security Index. As a result, as of the\nEffective Date, “ THE FUND ’ S PRINCIPAL INVESTMENT STRATEGY ” section in the Prospectus and Summary\nProspectus is replaced in its entirety with the following: In seeking to track the performance of the S&P\nKensho Future Security Index (the “Index”), the Fund employs a sampling strategy, which means that the Fund\nis not required to purchase all of the securities represented in the Index. Instead, the Fund may purchase a\nsubset of the securities in the Index in an effort to hold a portfolio of securities with generally the same\nrisk and return characteristics of the Index. The quantity of holdings in the Fund will be based on a number\nof factors, including asset size of the Fund. Based on its analysis of these factors, SSGA Funds Management,\nInc. (“SSGA FM” or the “Adviser”), the investment adviser to the Fund, either may invest the Fund’s assets\nin a subset of securities in the Index or may invest the Fund’s assets in substantially all of the\nsecurities represented in the Index in approximately the same proportions as the Index, as determined by the\nAdviser to be in the best interest of the Fund in pursuing its objective. Under normal market conditions,\nthe Fund generally invests substantially all, but at least 80%, of its total assets in the securities\ncomprising the Index. In addition, in seeking to track the Index, the Fund may invest in equity securities\nthat are not included in the Index, cash and cash equivalents or money market instruments, such as\nrepurchase agreements and money market funds (including money market funds advised by the Adviser). In\nseeking to track the Index, the Fund’s assets may be concentrated in an industry or group of industries, but\nonly to the extent that the Index concentrates in a particular industry or group of industries. Futures\ncontracts (a type of derivative instrument) may be used by the Fund in seeking performance that corresponds\nto the Index and in managing cash flows. The Index is comprised of U.S.-listed equity securities (including\ndepositary receipts) of companies domiciled across developed and emerging markets worldwide which are\nincluded in the Future Security sector as determined by a classification standard produced by S&P Dow Jones\nIndices LLC (the “Index Provider”). The Index is designed to capture companies whose products and services\nare driving innovation behind future security. In particular, the Index comprises the components of the S&P\nKensho Cyber Security Index and the S&P Kensho Smart Borders Index, and the military components of the S&P\nKensho Robotics Index, the S&P Kensho Drones Index, the S&P Kensho Space Index, the S&P Kensho\n\nWearables Index and the S&P Kensho Virtual Reality Index (the “Underlying Indexes”) as of the Index’s\nreconstitution reference date. The Underlying Indexes are subject to the following liquidity thresholds for\neach component: (i) must have a share price of at least USD $1.00; (ii) must be issued by a company with a\nminimum float market capitalization of at least $100 million; and (iii) must have a minimum three-month\naverage daily traded value of at least $1 million. The S&P Kensho Cyber Security Index seeks to track\ncompanies that focus on protecting enterprises and devices from unauthorized access via electronic means\nand, produce products and services that protect enterprises, homes and portable devices from unauthorized\naccess via electronic means, or are a necessary component of the supply chain for such products and\nservices. The S&P Kensho Smart Borders Index seeks to track companies that produce products and services\nthat secure borders and critical infrastructure, or are a necessary component of the supply chain for such\nproducts and services. The S&P Kensho Robotics Index seeks to track companies that produce products and\nservices to build robotic products and their subsystems, or are a necessary component of the supply chain\nfor such products and services. The S&P Kensho Drones Index seeks to track companies that produce products\nand services related to the remotely-operated or unmanned aerial, underwater and surface-level drones market\nand related subsystems, or are a necessary component of the supply chain for such products and services. The\nS&P Kensho Space Index seeks to track companies that produce products and services that enable space travel\nand exploration, or are a necessary component of the supply chain for such products and services. The S&P\nKensho Wearables Index seeks to track companies that produce products and services related to wearable\ntechnologies for consumer, military or medical uses, or are a necessary component of the supply chain for\nsuch products and services. The S&P Kensho Virtual Reality Index seeks to track companies that produce\nproducts and services related to virtual or augmented reality activities, or are a necessary component of\nthe supply chain for such products and services. To determine the constituents of the Underlying Indexes,\nthe Index Provider’s classification standard utilizes an automated scan of companies’ most recent regulatory\nfilings with the U.S. Securities and Exchange Commission on Form 10‑K, Form 20‑F, Form 40‑F, or Form S‑1, as\napplicable, maintained in the S&P Market Intelligence United Document Repository, to identify specific\nsearch terms and phrases that describe a company as producing products and services related to the\nparticular segment targeted by the Underlying Index. The resulting list of eligible securities for each\nUnderlying Index is then filtered by eliminating companies that do not include in their regulatory filings a\nreference to a product or service that (i) is related to a search term or phrase and (ii) is used in a\nmanner that is within the scope of the Underlying Index’s objective. Each Underlying Index then screens the\nremaining securities to remove securities that are not listed on NYSE, NASDAQ, or CBOE exchanges (or an\naffiliate of one of those exchanges) or do not meet certain minimum liquidity thresholds. The Index\nProvider’s Index Committee then reviews each remaining eligible constituent to verify the rules of the\nautomated scan were implemented correctly.\n\nUnderlying Index constituents are then categorized as either “Core” or “Non‑Core.” A company is categorized\nas Core if its products and services related to the Underlying Index’s objective are identified in its\nregulatory filings as principal components of the company’s strategy. Products and services are deemed to be\nprincipal components of a company’s strategy if the company’s regulatory filing disclosures regarding such\nproducts and services are determined to be sufficiently prominent according to a proprietary algorithm of\nthe Index Provider which calculates prominence based on the frequency and position of such disclosures\nwithin regulatory filings. A company may also be categorized as Core if the Index Provider determines that\nthe majority of the company’s revenue is derived from products and services related to the Underlying\nIndex’s objective as indicated by the company’s reported business segments, which is assessed by scanning\nthe S&P Capital IQ Database for annual fiscal year revenue segment reporting. All other companies are\ncategorized as Non‑Core, including companies whose products and services are identified as forming a\nnecessary component of the supply chain of the segment targeted by the Underlying Index. An Index\nconstituent categorized as Core by at least one of the Underlying Indexes will be categorized as Core for\npurposes of the Index. To tilt the Index’s exposure toward Core Index Constituents, at the time of each\nrebalance the aggregate weighting of Core Index Constituents is based on the proportion of the number of\nCore Index Constituents, plus an overweight factor of up to 20%. At the time of each rebalance, each Core\nIndex Constituent and Non‑Core Index Constituent is equally weighted within the group of Core Index\nConstituents and Non‑Core Index Constituents, respectively, subject to liquidity and diversification\nadjustments. The Index is reconstituted and rebalanced after the close of trading on the third Friday in\nJune with a reference date as of the close of the last trading day in May. In addition, the Index is\nrebalanced after the close of trading on the third Friday of December with a reference date as of the close\nof the last trading day in November. In connection with the December rebalance, Index constituents are also\nevaluated for continued inclusion in the Index if a new eligible regulatory filing has been filed since the\nlast reconstitution review. As of December 15, 2023, the Index comprised 59 securities. The Index Provider\nis not affiliated with the Fund or the Adviser. The Index Provider establishes and maintains rules which are\nused to determine the composition of the Index and relative weightings of the securities in the Index.\n                             PLEASE RETAIN THIS SUPPLEMENT FOR FUTURE REFERENCE                             \n                                                                                                 121523SUPP2\n"
}