{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "497",
  "filing_date": "2023-08-01",
  "accession_number": "0001193125-23-199424",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-23-199424-index.html",
  "text": "SPDR Series Trust SPDR ®Portfolio S&P 500 ETF\n(the “Fund”) Supplement dated August 1, 2023to\nthe Prospectus and Statement of Additional\nInformation (“SAI”), each dated October 31,\n2022, as may be supplemented from time to time\nEffective immediately, SSGA Funds Management,\nInc., the investment adviser to the Fund, has\nagreed to reduce the Fund’s management fee\nfrom 0.03% to 0.02% of the Fund’s average\ndaily net assets. Accordingly, effective\nimmediately, the fee table and example table\nin the “FEES AND EXPENSES OF THE FUND” section\non page 43 of the Prospectus are deleted and\nreplaced with the following: FEES AND EXPENSES\nOF THE FUND The table below describes the fees\nand expenses that you may pay if you buy, hold\nand sell shares of the Fund (“Fund Shares”).\nYou may pay other fees, such as brokerage\ncommissions and other fees to financial\nintermediaries, which are not reflected in the\ntable and Example below. ANNUAL FUND OPERATING\nEXPENSES (expenses that you pay each year as a\npercentage of the value of your investment):\n                                              \n  Management fees1                   0.02  %  \n  Distribution and service           None     \n  (12b‑1) fees                                \n  Other expenses                     0.00  %  \n  Total annual Fund operating        0.02  %  \n  expenses1                                   \n                                              \n                                              \n     The Fund’s “Management fees” and “Total  \n  1  annual Fund operating expenses” have     \n     been restated to reflect a reduction in  \n     the Fund’s management fee.               \n                                              \nEXAMPLE: This Example is intended to help you\ncompare the cost of investing in the Fund with\nthe cost of investing in other mutual funds.\nThe Example assumes that you invest $10,000 in\nthe Fund for the time periods indicated, and\nthen sell all of your Fund Shares at the end\nof those periods. The Example also assumes\nthat your investment has a 5% return each year\nand that the Fund’s operating expenses remain\nthe same. Although your actual costs may be\nhigher or lower, based on these assumptions\nyour costs would be:\n                                         \n  Year 1    Year 3    Year 5    Year 10  \n  $2            $6       $11        $26  \n                                         \nEffective immediately, all additional\nreferences in the Prospectus and SAI to the\nFund’s management fee are revised as indicated\nabove. PLEASE RETAIN THIS SUPPLEMENT FOR\nFUTURE REFERENCE 080123SUPP1\n"
}