{
  "cik": "0001064642",
  "registrant_name": "SPDR Series Trust",
  "form_type": "N-CSR",
  "filing_date": "2025-01-02",
  "accession_number": "0001193125-25-000259",
  "file_url": "https://www.sec.gov/Archives/edgar/data/1064642/0001193125-25-000259-index.html",
  "text": "SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM N-CSR CERTIFIED SHAREHOLDER REPORT OF        \nREGISTERED MANAGEMENT INVESTMENT COMPANIES Investment Company Act file number: 811-08839 SPDR ®SERIES TRUST \n(Exact name of registrant as specified in charter) One Iron Street, Boston, Massachusetts 02210 (Address of \nprincipal executive offices) (zip code) Andrew J. DeLorme, Esq. Chief Legal Officer c/o SSGA Funds          \nManagement, Inc. One Iron Street Boston, Massachusetts 02210 (Name and address of agent for service) Copy   \nto: W. John McGuire, Esq. Morgan, Lewis & Bockius LLP 1111 Pennsylvania Avenue, NW Washington, DC 20004     \nRegistrant’s telephone number, including area code: (617) 664-3920 Date of fiscal year end: October 31 Date \nof reporting period: October 31, 2024 Item 1. Report to Shareholders.                                       \n                                                         \n  (a)  The Report to Shareholders is attached herewith.  \n                                                         \nSPDR Bloomberg Enhanced Roll Yield Commodity Strategy No K-1 ETF CERY Principal Listing Exchange: NYSEArca  \nExchange Annual Shareholder Report October 31, 2024 This annual shareholder report contains important       \ninformation about the SPDR Bloomberg Enhanced Roll Yield Commodity Strategy No K-1 ETF (the \"Fund\") for the \nperiod of September 5, 2024 (commencement of operations) to October 31, 2024. You can find additional       \ninformation about the Fund, including the Prospectus, Statement of Additional Information, financial        \nstatements and other information at www.ssga.com/us/en/institutional/fund-finder?tab=documents&type=etfs.   \nYou can also request this information about the Fund by contacting us at 1-866-787-2257.                    \n                                                                                                            \nWhat were the Fund costs for the last year? (based on a hypothetical $10,000 investment)                    \n                                                                                                            \nThe dollar amount above reflects expenses paid since the commencement of operations. Expenses for the full  \nreporting period would be higher .                                                                          \n                                                                                                            \nHow did the Fund perform last year and what affected its performance? Performance information is not        \nprovided since the Fund has less than six months of operations.                                             \n                                                                                                            \nKey Fund Statistics as of 10/31/2024                                                                        \n                                                                                                            \nWhat did the Fund invest in as of 10/31/2024?                                                               \n                                                                                                            \nTop Holdings                                                                                                \n                                                                                                            \nIncludes holdings of the wholly-owned subsidiary.                                                           \n                                                                                                            \nAvailability of Additional Information For additional information about the Fund, including its Prospectus, \nStatement of Additional Information, financial statements, holdings and proxy information please visit:     \nwww.ssga.com/us/en/institutional/fund-finder?tab=documents&type=etfs. TSR AR CERY                           \n                        \n  (b)  Not applicable.  \n                        \n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 2. Code of Ethics.                                                                                 │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nAs of the end of the period covered by this report, the registrant has adopted a code of ethics that applies\nto the registrant’s principal executive officer, principal financial officer, principal accounting officer\nor controller, or persons performing similar functions, regardless of whether these individuals are employed\nby the registrant or a third party (the “Code of Ethics”). During the period covered by this report, no\nsubstantive amendments were made to the Code of Ethics. During the period covered by this report, the\nregistrant did not grant any waivers, including any implicit waivers, from any provision of the Code of\nEthics. The Code of Ethics is attached hereto as Exhibit 19(a)(1).\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 3. Audit Committee Financial Expert.                                                               │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n(a)(1) The Board of Trustees of the registrant has determined that the registrant has four Board members\nserving on the Audit Committee that possess the attributes identified in Instructions 2(b) of Item 3 to Form\nN-CSR to qualify as an “audit committee financial expert.”\n\n(2) Dwight Churchill, Clare Richer, Kristi Rowsell, James Ross, Sandra Sponem and Carl Verboncoeur are the\nregistrant’s audit committee financial experts. The Board also determined that each of the foregoing persons\nare not “interested person(s)” of the registrant as that term is defined in Section 2(a)(19) of the\nInvestment Company Act of 1940, as amended (the “1940 Act”).\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 4. Principal Accountant Fees and Services.                                                         │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n                    \n  (a)  Audit Fees.  \n                    \nFor the fiscal year ending October 31, 2024, the aggregate audit fees billed for professional services\nrendered by the registrant’s principal accountant, Ernst & Young, LLP (“EY”), were $28,525. Audit fees\ninclude the performance of the annual audits, security counts performed during the course of the period for\neach series of the registrant and routine regulatory filings (one for each SEC registrant).\n                            \n  (b)  Audit-Related Fees.  \n                            \nFor the fiscal year ending October 31, 2024, EY did not bill the registrant any fees for assurances and\nrelated services that are reasonably related to the performance of the audit of the registrant’s financial\nstatements and are not reported under paragraph (a) of this Item.\n                  \n  (c)  Tax Fees.  \n                  \nFor the fiscal year ending October 31, 2024, the aggregate tax fees billed for professional services\nrendered by EY were $4,380. Tax fees represent services related to the review of year-end distribution\nrequirements.\n                        \n  (d)  All Other Fees.  \n                        \nFor the fiscal year ended October 31, 2024, there were no fees billed for professional services rendered by\nEY for products and services provided by EY to the Trust, other than the services reported in paragraphs (a)\nthrough (c).\n\nFor the fiscal year ended October 31, 2024, the aggregate fees for professional services rendered by EY for\nproducts and services provided by EY to the Adviser and any entity controlling, controlled by, or under\ncommon control with the Adviser that provides ongoing services to the Trust that (i) relate directly to the\noperations and financial reporting of the Trust and (ii) were pre-approved by the Audit Committee were\napproximately $9,556,710.\n\n(e)(1) Audit Committee Pre-ApprovalPolicies and Procedures.\n\nThe registrant’s Audit Committee Charter states the following with respect to pre-approval procedures:\n\nBefore the independent auditors are engaged by the Trust to render audit, audit-related or permissible non-\naudit services, either:\n                                                                                                            \n       The Audit Committee shall pre-approve all audit, audit-related and permissible non-audit services    \n  (a)  provided to the Trust. The Audit Committee may delegate to one or more of its members the authority  \n       to grant pre-approvals. Any decision of any member to whom authority is delegated under this         \n       section shall be presented to the full Audit Committee at its next regularly scheduled meeting;      \n                                                                                                            \nor\n                                                                                                            \n       The engagement to render the audit, audit-related or permissible non-audit service is entered into   \n       pursuant to pre-approval policies and procedures established by the Audit Committee. Any such        \n  (b)  policies and procedures must (1) be detailed as to the particular service and (2) not involve any    \n       delegation of the Audit Committee’s responsibilities to the investment adviser. The Audit Committee  \n       must be informed of each service entered into pursuant to the policies and procedures. A copy of     \n       any such policies and procedures shall be attached as an exhibit to the Audit Committee Charter.     \n                                                                                                            \n                                                                                                            \n       Pre-Approval for a service provided to the Trust other than audit or audit-related services is not   \n       required if: (1) the aggregate amount of all such permissible non-audit services provided to the     \n       Trust constitutes not more than five percent (5%) of the total amount of revenues paid by the Trust  \n       to the independent auditors during the fiscal year in which the permissible non-audit services are   \n  (c)  provided; (2) such services were not recognized by the Trust at the time of the engagement to be     \n       permissible non-audit services; and (3) such services are promptly brought to the attention of the   \n       Audit Committee and are approved by the Audit Committee or by one or more members of the Audit       \n       Committee to whom authority to grant such approvals has been delegated by the Audit Committee prior  \n       to the completion of the audit.                                                                      \n                                                                                                            \n                                                                                                            \n       The Audit Committee shall pre-approve any permissible non-audit services proposed to be provided by  \n       the independent auditors to (a) the investment adviser and (b) any entity controlling, controlled    \n       by, or under common control with the investment adviser that provides ongoing services to the        \n  (d)  Trust, if the independent auditors’ engagement with the investment adviser or any such control       \n       persons relates directly to the operations and financial reporting of the Trust. It shall be the     \n       responsibility of the independent auditors to notify the Audit Committee of any permissible          \n       non-audit services that need to be pre-approved.                                                     \n                                                                                                            \nNotwithstanding the above, Pre-Approval for any permissible non-audit services under this Sub-section is not\nrequired if: (1) the aggregate amount of all such permissible non-audit services constitutes not more than\nfive percent (5%) of the total amount of revenues paid to the independent auditors by the Trust and any\nother entity that has its services approved under this Section (i.e., the investment adviser or any control\nperson) during the fiscal year in which the permissible non-audit services are provided; (2) such services\n\nwere not recognized by the Trust at the time of the engagement to be permissible non-audit services; and (3)\nsuch services are promptly brought to the attention of the Audit Committee and are approved by the Audit\nCommittee or by one or more members of the Audit Committee to whom authority to grant such approvals has\nbeen delegated by the Audit Committee prior to the completion of the audit.\n\n(e)(2) Percentage of Services.\n\nOne hundred percent of the services described in each of paragraphs (b) through (d) of this Item were\napproved by the registrant’s Audit Committee pursuant to paragraph (c)(7)(i)(C) of Rule 2-01 of Regulation\nS-X.\n\n(f) Not applicable.\n\n(g) The aggregate non-audit fees billed by EY for services rendered to the registrant, and rendered to the\nregistrant’s investment adviser (not including any sub-adviser whose role is primarily portfolio management\nand is subcontracted with or overseen by another investment adviser), and any entity controlling, controlled\nby, or under common control with the adviser were as follows:\n                                                                                     \n  Non audit services billed to:                                        FY 2024       \n  Registrant:                                                    (in millions)       \n  Investment Adviser:                                               See Item 4       \n  Other entities in the Investment Company Complex (1)(2):                   —  (c)  \n ─────────────────────────────────────────────────────────────────────────────────── \n  Audit Related Fees                                          $           18.5       \n  Tax Fees                                                    $            3.2       \n  All Other Fees                                              $           15.0       \n                                                                                     \n                                                   \n  (1)  Information is for the calendar year 2024.  \n                                                   \n                                                                                                            \n       Services under the caption Audit-Related Fees consisted principally of reports on the processing of  \n       transactions by servicing organizations, audits of employee benefit plan, non-statutory audits and   \n  (2)  due diligence procedures. Services under the caption Tax Fees consisted principally of expatriate,   \n       compliance and corporate tax advisory services. Services under the caption All Other Fees primarily  \n       related to statutory and financial statement audits and the requirement to opine on the design and   \n       operating effectiveness of internal control over financial reporting.                                \n                                                                                                            \n(h) EY notified the registrant’s Audit Committee of all non-audit services that were rendered by the\nindependent auditor to the Adviser and any entity controlling, controlled by, or under common control with\nthe Adviser that provides services to the registrant, which services were not required to be pre-approved\npursuant to paragraph (c)(7)(ii) of Rule 2-01 of Regulation S-X, allowing the registrant’s Audit Committee\nto consider whether such services were compatible with maintaining EY’s independence.\n\n(i) Not applicable.\n\n(j) Not applicable.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 5. Audit Committees of Listed Registrants.                                                         │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nThe registrant has an audit committee which was established by the Board of Trustees of the Trust in\naccordance with Section 3(a)(58)(A) of the Securities Exchange Act of 1934, as amended (the “1934 Act”). The\nmembers of the registrant’s Audit Committee are Dwight Churchill, Carolyn Clancy, Clare Richer, Kristi\nRowsell, James Ross, Sandra Sponem and Carl Verboncoeur.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 6. Investments.                                                                                    │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n(a) A Schedule of Investments for each applicable series of the registrant is included as a part of the\nreport to shareholders filed under Item 7(a) of this Form N-CSR.\n\n(b) Not applicable to the registrant.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 7. Financial Statements and Financial Highlights forOpen-EndManagement Investment Companies        │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n                                                                     \n  (a)  The registrant’s Financial Statements are attached herewith.  \n                                                                     \n                                                                                                            \n  (b)  The registrant’s Financial Highlights are included as part of the Financial Statements filed under   \n       Item 7(a) of this Form.                                                                              \n                                                                                                            \nConsolidated Annual Financial Statements and Other Information October 31, 2024 SPDR ®Series Trust - Fixed\nIncome Funds\n                                                \n  SPDR Bloomberg Enhanced Roll Yield Commodity  \n  Strategy No K-1 ETF                           \n                                                \nThe information contained in this report is intended for the general information of shareholders of the\nTrust. This report is not authorized for distribution to prospective investors unless preceded or\naccompanied by a current Trust prospectus which contains important information concerning the Trust. You may\nobtain a current prospectus and SAI from the Distributor by calling 1-866-787-2257 or visiting\nhttps://www.ssga.com .Please read the prospectus carefully before you invest.\n\nTABLE OF CONTENTS\n                                                          \n  Consolidated Schedule of Investments (N-CSR Item     1  \n  6)                                                      \n  SPDR Bloomberg Enhanced Roll Yield Commodity         1  \n  Strategy No K-1 ETF (CERY)                              \n  Consolidated Statement of Assets and Liabilities     3  \n  (N-CSR Item 7)                                          \n  Consolidated Statement of Operations (N-CSR Item     4  \n  7)                                                      \n  Consolidated Statements of Changes in Net Assets     5  \n  (N-CSR Item 7)                                          \n  Consolidated Financial Highlights  (N-CSR Item 7)    6  \n  Notes to Consolidated Financial Statements (N-CSR    7  \n  Item 7)                                                 \n  Report of Independent Registered Public Accounting  15  \n  Firm                                                    \n  Other Information (Unaudited)                       16  \n  Statement Regarding Basis for Approval of               \n  Investment Advisory Contract (Unaudited) (N-CSR     17  \n  Item 11)                                                \n                                                          \nChanges in and Disagreements with Accountants for Open-End Management Investment Companies (N-CSR Item 8) -\nNot Applicable Proxy Disclosures for Open-End Management Investment Companies (N-CSR Item 9) - Not\napplicable Remuneration Paid to Directors, Officers, and Others of Open-End Management Investment Companies\n(N-CSR Item 10) - Please see Statement of Operations in the Financial Statements under Item 7 above\n\nTable of Contents SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF CONSOLIDATED SCHEDULE OF\nINVESTMENTS October 31, 2024\n                                                                                                            \n  Security Description                                                                 Shares        Value  \n                        SHORT-TERM INVESTMENT — 99.7%                                                       \n                        State Street Institutional U.S. Government Money Market                             \n                        Fund, Class G Shares 4,86% (a) (b)                         91,580,312  $91,580,312  \n                        (Cost $91,580,312)                                                                  \n                        TOTAL INVESTMENTS — 99.7%                                               91,580,312  \n                        (Cost $91,580,312)                                                                  \n                        OTHER ASSETS IN EXCESS OF LIABILITIES — 0.3%                               279,361  \n                        NET ASSETS — 100.0%                                                    $91,859,673  \n                                                                                                            \n                                                                                                            \n       The Fund invested in certain money market funds managed by SSGA Funds Management, Inc. Amounts       \n       related to these investments during the period ended October 31, 2024 are shown in the Affiliate     \n  (a)  Table below.                                                                                         \n  (b)  The rate shown is the annualized seven-day yield at October 31, 2024.                                \n ────────────────────────────────────────────────────────────────────────────────────────────────────────── \n                                                                                                            \nTOTAL RETURN SWAPS\n                                                                                                            \n  Pay/…                                                                          Upfro…    Unrea…           \n  Total    Refer…    Float…    Payme…    Curre…    Notio…    Matur…    Count…    Payme…    Appre…    Value  \n  Retu…    Entity    Rate      Frequ…              Amount    Date      (OTC)     Paid/     (Depr…           \n                                                                                 Recei…                     \n           Bloom…                                                                                           \n           Enhan…    U.S.                                                                                   \n           Roll      Treas…    At                                      BNP                                  \n  Rece…    Yield     3         Matur…    USD       $2,50…    12/4/…    Parib…    $—        $96,3…    $96,…  \n           Index     Month                                             SA                                   \n           Total     Bill                                                                                   \n           Return                                                                                           \n           Bloom…                                                                                           \n           Enhan…    U.S.                                                                                   \n           Roll      Treas…    At                                      Citib…                               \n  Rece…    Yield     3         Matur…    USD       $20,0…    1/15/…    NA        $—        $(463…    $(46…  \n           Index     Month                                                                                  \n           Total     Bill                                                                                   \n           Return                                                                                           \n           Bloom…                                                                                           \n           Enhan…    U.S.                                              Bank                                 \n           Roll      Treas…    At                                      of                                   \n  Rece…    Yield     3         Matur…    USD       $20,0…    1/10/…    Ameri…    $—        $(463…    $(46…  \n           Index     Month                                             NA                                   \n           Total     Bill                                                                                   \n           Return                                                                                           \n           Bloom…                                                                                           \n           Enhan…    U.S.                                                                                   \n           Roll      Treas…    At                                      BNP                                  \n  Rece…    Yield     3         Matur…    USD       $30,2…    12/4/…    Parib…    $—        $(701…    $(70…  \n           Index     Month                                             SA                                   \n           Total     Bill                                                                                   \n           Return                                                                                           \n           Bloom…                                                                                           \n           Enhan…    U.S.                                                                                   \n           Roll      Treas…    At                                      JPMor…                               \n  Rece…    Yield     3         Matur…    USD       $20,0…    1/22/…    Secur…    $—        $(463…    $(46…  \n           Index     Month                                             LLC                                  \n           Total     Bill                                                                                   \n           Return                                                                                           \n           Bloom…                                                                                           \n           Enhan…    U.S.                                                                                   \n           Roll      Treas…    At                                      BNP                                  \n  Rece…    Yield     3         Matur…    USD       $1,10…    12/4/…    Parib…    $—        $(28,…    $(28…  \n           Index     Month                                             SA                                   \n           Total     Bill                                                                                   \n           Return                                                                                           \n  Total                                                                          $—        $(2,0…    $(2,…  \n                                                                                                            \nDuring the period ended October 31, 2024, the average notional value related to OTC swaps contracts was\n$48,262,336.\n\nSee accompanying notes to financial statements. 1\n\nTable of Contents SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF CONSOLIDATED SCHEDULE OF\nINVESTMENTS (continued) October 31, 2024\n\nThe following table summarizes the value of the Fund's investments according to the fair value hierarchy as\nof October 31, 2024.\n                                                                                                            \n                                     Level 1 –            Level 2 –    Level 3 –                            \n  Description                    Quoted Prices    Other Significant    Significant                   Total  \n                                                  Observable Inputs    Unobservable Inputs                  \n  ASSETS:                                                                                                   \n  INVESTMENTS:                                                                                              \n  Short-Term Investment            $91,580,312                   $—    $—                      $91,580,312  \n  OTHER FINANCIAL                                                                                           \n  INSTRUMENTS:                                                                                              \n  Total Return Swap Contracts                                                                               \n  - Unrealized                              $—              $96,384    $—                          $96,384  \n  Appreciation                                                                                              \n  Total Return Swap Contracts                                                                               \n  - Unrealized                               —           -2,121,422    —                        -2,121,422  \n  Depreciation                                                                                              \n  TOTAL OTHER FINANCIAL                     $—         $(2,025,038)    $—                     $(2,025,038)  \n  INSTRUMENTS:                                                                                              \n                                                                                                            \nAffiliate Table\n                                                                                                            \n          Number                                                 Change      Number                         \n          of         Value                 Procee…    Realiz…    in              of                         \n          Shares     at         Cost of       from    Gain       Unreal…     Shares    Value at    Divide…  \n          Held       9/5/24*    Purcha…     Shares    (Loss)     Apprec…       Held    10/31/24     Income  \n          at                                  Sold               Deprec…         at                         \n          9/5/24*                                                           10/31/…                         \n  State                                                                                                     \n  Street                                                                                                    \n  Insti…                                                                                                    \n  U.S.                                                                                                      \n  Gover…                                                                                                    \n  Money   —          $—         $94,50…    $2,920…    $—         $—         91,580…    $91,580…    $271,8…  \n  Market                                                                                                    \n  Fund,                                                                                                     \n  Class                                                                                                     \n  G                                                                                                         \n  Shares                                                                                                    \n                                                                                                            \n                                  \n  *  Commencement of operations.  \n                                  \nSee accompanying notes to financial statements. 2\n\nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED STATEMENT OF ASSETS AND LIABILITIES October 31, 2024\n                                                                  \n  ASSETS                                                          \n  Investments in affiliated issuers, at value        $91,580,312  \n  Net cash collateral on deposit at broker for swap    2,330,000  \n  contracts                                                       \n  Cash                                                     1,000  \n  Dividends receivable — affiliated issuers              263,057  \n  TOTAL ASSETS                                        94,174,369  \n  LIABILITIES                                                     \n  Payable for accumulated variation margin on swap     2,303,499  \n  contracts                                                       \n  Advisory fee payable                                    11,194  \n  Trustees’ fees and expenses payable                          3  \n  TOTAL LIABILITIES                                    2,314,696  \n  NET ASSETS                                         $91,859,673  \n  NET ASSETS CONSIST OF:                                          \n  Paid-in capital                                    $93,624,595  \n  Total distributable earnings (loss)                 -1,764,922  \n  NET ASSETS                                         $91,859,673  \n  NET ASSET VALUE PER SHARE                                       \n  Net asset value per share                               $25.95  \n  Shares outstanding (unlimited amount authorized,     3,540,000  \n  $0.01 par value)                                                \n  COST OF INVESTMENTS:                                            \n  Investments in affiliated issuers                   91,580,312  \n                                                                  \nSee accompanying notes to financial statements. 3\n\nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED STATEMENT OF OPERATIONS\n                                                                      \n                                                      For the Period  \n                                                            9/5/24*-  \n                                                            10/31/24  \n  INVESTMENT INCOME                                                   \n  Dividend income — affiliated issuers                      $271,838  \n  EXPENSES                                                            \n  Advisory fee                                                15,598  \n  Trustees’ fees and expenses                                      4  \n  TOTAL EXPENSES                                              15,602  \n  Expenses waived/reimbursed by the Adviser                   -3,880  \n  NET EXPENSES                                                11,722  \n  NET INVESTMENT INCOME (LOSS)                              $260,116  \n  REALIZED AND UNREALIZED GAIN (LOSS)                                 \n  Net realized gain (loss) on:                                        \n  Swap contracts                                            -278,461  \n  Net change in unrealized appreciation/depreciation                  \n  on:                                                                 \n  Swap contracts                                          -2,025,038  \n  NET REALIZED AND UNREALIZED GAIN (LOSS)                 -2,303,499  \n  NET INCREASE (DECREASE) IN NET ASSETS FROM            $(2,043,383)  \n  OPERATIONS                                                          \n                                                                      \n                                  \n  *  Commencement of operations.  \n                                  \nSee accompanying notes to financial statements. 4\n\nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED STATEMENT SOF CHANGES IN NET ASSETS\n                                                                      \n                                                      For the Period  \n                                                            9/5/24*-  \n                                                            10/31/24  \n  INCREASE (DECREASE) IN NET ASSETS FROM OPERATIONS:                  \n  Net investment income (loss)                              $260,116  \n  Net realized gain (loss)                                  -278,461  \n  Net change in unrealized appreciation/depreciation      -2,025,038  \n  Net increase (decrease) in net assets resulting         -2,043,383  \n  from operations                                                     \n  Net equalization credits and charges                       393,567  \n  FROM BENEFICIAL INTEREST TRANSACTIONS:                              \n  Proceeds from shares sold                               93,903,056  \n  Net income equalization                                   -393,567  \n  Net increase (decrease) in net assets from              93,509,489  \n  beneficial interest transactions                                    \n  Net increase (decrease) in net assets during the        91,859,673  \n  period                                                              \n  Net assets at beginning of period                                —  \n  NET ASSETS AT END OF PERIOD                            $91,859,673  \n  SHARES OF BENEFICIAL INTEREST:                                      \n  Shares sold                                              3,540,000  \n  Net increase (decrease) from share transactions          3,540,000  \n                                                                      \n                                  \n  *  Commencement of operations.  \n                                  \nSee accompanying notes to financial statements. 5\n\nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED FINANCIAL HIGHLIGHTS Selected data for a share outstanding throughout each period\n                                                         \n                                                For the  \n                                                 Period  \n                                               9/5/24*-  \n                                               10/31/24  \n  Net asset value, beginning of period           $25.00  \n  Income (loss) from investment operations:              \n  Net investment income (loss) (a)                 0.19  \n  Net realized and unrealized gain (loss) (b)      0.47  \n  Total from investment operations                 0.66  \n  Net equalization credits and charges (a)         0.29  \n  Net asset value, end of period                 $25.95  \n  Total return (c)                                3.79%  \n  Ratios and Supplemental Data:                          \n  Net assets, end of period (in 000s)           $91,860  \n  Ratios to average net assets:                          \n  Total expenses                               0.28%(d)  \n  Net expenses                                 0.21%(d)  \n  Net investment income (loss)                 4.67%(d)  \n  Portfolio turnover rate (e)                     0%(f)  \n                                                         \n                                                                                                            \n  *    Commencement of operations.                                                                          \n  (a)  Per share numbers have been calculated using average shares outstanding, which more appropriately    \n       presents the per share data for the year.                                                            \n       Amounts shown in this caption for a share outstanding may not accord with the change in aggregate    \n  (b)  gains and losses in securities for the fiscal period because of the timing of sales and repurchases  \n       of Fund shares in relation to fluctuating market values for the Fund.                                \n       Total return is calculated assuming a purchase of shares at net asset value on the first day and a   \n       sale at net asset value on the last day of each period reported. Distributions are assumed, for the  \n  (c)  purpose of this calculation, to be reinvested at net asset value per share on the respective         \n       payment dates of each distribution. Total returns for periods of less than one year are not          \n       annualized. Broker commission charges are not included in this calculation.                          \n  (d)  Annualized.                                                                                          \n  (e)  Portfolio turnover rate excludes securities received or delivered from in-kind processing of         \n       creations or redemptions.                                                                            \n  (f)  Not annualized.                                                                                      \n                                                                                                            \nSee accompanying notes to financial statements. 6\nTable of Contents                                                                                           \n                                                                                                            \n  SPDR SERIES TRUST                                                                                         \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \n  CONSOLIDATED NOTES TO FINANCIAL STATEMENTS                                                                \n                                                                                                            \n                                                                                                            \n  October 31, 2024                                                                                          \n                                                                                                            \n                                                                                                            \n  1.    Organization                                                                                        \n                                                                                                            \nSPDR Series Trust (the “Trust”), a Massachusetts business trust, registered under the Investment Company Act\nof 1940, as amended (“1940 Act”), is an open-end management investment company.                             \n                                                                                                            \nAs of October 31, 2024, the Trust consists of eighty-five (85) series, each of which represents a separate  \nseries of beneficial interest in the Trust. The Declaration of Trust permits the Board of Trustees of the   \nTrust (the “Board”) to authorize the issuance of an unlimited number of shares of beneficial interest at    \n$0.01 par value. The financial statements herein relate to the SPDR Bloomberg Enhanced Roll Yield Commodity \nStrategy No K-1 ETF (the \"Fund\"), a non-diversified investment company under the 1940 Act, formed on        \nSeptember 4, 2024 and commenced operations on September 5, 2024, and the State Street Enhanced Roll Yield   \nCommodity Cayman Ltd., a wholly-owned subsidiary of the Fund that is an exempted limited company organized  \nunder the laws of the Cayman Islands (the \"Subsidiary\").                                                    \n                                                                                                            \nUnder the Trust’s organizational documents, its officers and Trustees are indemnified against certain       \nliabilities arising out of the performance of their duties to the Trust. Additionally, in the normal course \nof business, the Trust enters into contracts with service providers that contain general indemnification    \nclauses. The Trust’s maximum exposure under these arrangements is unknown as this would involve future      \nclaims that may be made against the Trust that have not yet occurred.                                       \n                                                                                                            \n  2.    Summary of Significant Accounting Policies                                                          \n                                                                                                            \nThe following is a summary of significant accounting policies followed by the Trust in the preparation of   \nits financial statements:                                                                                   \n                                                                                                            \nThe preparation of financial statements in accordance with U.S. generally accepted accounting principles    \n(“U.S. GAAP”) requires management to make estimates and assumptions that affect the reported amounts and    \ndisclosures in the financial statements. Actual results could differ from those estimates. The Fund is an   \ninvestment company under U.S. GAAP and follows the accounting and reporting guidance applicable to          \ninvestment companies.                                                                                       \n                                                                                                            \nThe  Fund consolidates its investments in the Subsidiary. All material intercompany balances and            \ntransactions have been eliminated.                                                                          \n                                                                                                            \n  Security Valuation                                                                                        \n                                                                                                            \nThe Fund's investments are valued at fair value each day that the New York Stock Exchange (“NYSE”) is open  \nand, for financial reporting purposes, as of the report date should the reporting period end on a day that  \nthe NYSE is not open. Fair value is generally defined as the price the Fund would receive to sell an asset  \nor pay to transfer a liability in an orderly transaction between market participants at the measurement     \ndate. By its nature, a fair value price is a good faith estimate of the valuation in a current sale and may \nnot reflect an actual market price. The investments of the Fund are valued pursuant to the policy and       \nprocedures developed by the Oversight Committee (the “Committee”) and approved by the Board. The Committee  \nprovides oversight of the valuation of investments for the Fund. The Board has responsibility for overseeing\nthe determination of the fair value of investments.                                                         \n                                                                                                            \nValuation techniques used to value the Fund's investments by major category are as follows:                 \n                                                                                                            \n•  Investments in registered investment companies (including money market funds) or other unitized pooled   \ninvestment vehicles that are not traded on an exchange are valued at that day’s published net asset value   \n(“NAV”) per share or unit.                                                                                  \n                                                                                                            \n•  Swap agreements are valued daily based upon prices supplied by Board approved pricing vendors or through \nbrokers. Depending on the product and terms of the transaction, the value of agreements is determined using \na series of techniques including valuation models that incorporate a number of market data factors, such as \ndiscounted cash flows, yields, curves, trades and values of the underlying reference instruments. In the    \nevent the advisor is unable to obtain an independent, third–party valuation the agreements will be fair     \nvalued.                                                                                                     \n                                                                                                            \nIn the event prices or quotations are not readily available or that the application of these valuation      \nmethods results in a price for an investment that is deemed to be not representative of the fair value of   \nsuch investment, fair value will be determined in good faith by the Committee, in accordance with the       \nvaluation policy and procedures approved by the Board.                                                      \n                                                     7                                                      \nTable of Contents                                                                                           \n                                                                                                            \nSPDR SERIES TRUST                                                                                           \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued)                                                      \n                                                                                                            \nOctober 31, 2024                                                                                            \n                                                                                                            \nVarious inputs are used in determining the value of the Fund’s investments.                                 \n                                                                                                            \nThe Fund values its assets and liabilities at fair value using a fair value hierarchy consisting of three   \nbroad levels that prioritize the inputs to valuation techniques giving the highest priority to readily      \navailable unadjusted quoted prices in active markets for identical assets or liabilities (Level 1           \nmeasurements) and the lowest priority to unobservable inputs (Level 3 measurements) when market prices are  \nnot readily available or reliable. The categorization of a value determined for an investment within the    \nhierarchy is based upon the pricing transparency of the investment and is not necessarily an indication of  \nthe risk associated with investing in it.                                                                   \n                                                                                                            \nThe three levels of the fair value hierarchy are as follows:                                                \n                                                                                                            \n•  Level 1 – Unadjusted quoted prices in active markets for an identical asset or liability;                \n                                                                                                            \n•  Level 2 – Inputs other than quoted prices included within Level 1 that are observable for the asset or   \nliability either directly or indirectly, including quoted prices for similar assets or liabilities in active\nmarkets, quoted prices for identical or similar assets or liabilities in markets that are not considered to \nbe active, inputs other than quoted prices that are observable for the asset or liability (such as exchange \nrates, financing terms, interest rates, yield curves, volatilities, prepayment speeds, loss severities,     \ncredit risks and default rates) or other market-corroborated inputs; and                                    \n                                                                                                            \n•  Level 3 – Unobservable inputs for the asset or liability, including the Committee’s assumptions used in  \ndetermining the fair value of investments.                                                                  \n                                                                                                            \nThe value of the Fund’s investments according to the fair value hierarchy as of October 31, 2024 is         \ndisclosed in the Fund’s Consolidated Schedule of Investments.                                               \n                                                                                                            \n  Investment Transactions and Income Recognition                                                            \n                                                                                                            \nInvestment transactions are accounted for on trade date for financial reporting purposes. Realized gains and\nlosses from the sale or disposition of investments and foreign exchange transactions, if any, are determined\nusing the identified cost method.                                                                           \n                                                                                                            \nDividend income and capital gain distributions, if any, are recognized on the ex-dividend date, or when the \ninformation becomes available, net of any foreign taxes withheld at source, if any. Interest income is      \nrecorded daily on an accrual basis. All premiums and discounts are amortized/accreted for financial         \nreporting purposes.                                                                                         \n                                                                                                            \nNon-cash dividends received in the form of stock, are recorded as dividend income at fair value.            \nDistributions received by the Fund may include a return of capital that is estimated by management. Such    \namounts are recorded as a reduction of the cost of investments or reclassified to capital gains.            \n                                                                                                            \n  Expenses                                                                                                  \n                                                                                                            \nCertain expenses, which are directly identifiable to a specific Fund, are applied to that Fund within the   \nTrust. Other expenses which cannot be attributed to a specific Fund are allocated in such a manner as deemed\nequitable, taking into consideration the nature and type of expense and the relative net assets of the Fund \nwithin the Trust. Class specific expenses are borne by each class.                                          \n                                                                                                            \n  Foreign Currency Translation                                                                              \n                                                                                                            \nThe accounting records of the Fund are maintained in U.S. dollars. Foreign currencies as well as investment \nsecurities and other assets and liabilities denominated in a foreign currency are translated to U.S. dollars\nusing exchange rates at period end. Purchases and sales of securities, income receipts and expense payments \ndenominated in foreign currencies are translated into U.S. dollars at the prevailing exchange rate on the   \nrespective dates of the transactions.                                                                       \n                                                                                                            \nThe effects of exchange rate fluctuations on investments are included with the net realized and unrealized  \ngain (loss) on investment securities. Other foreign currency transactions resulting in realized and         \nunrealized gain (loss) are disclosed separately.                                                            \n                                                     8                                                      \nTable of Contents                                                                                           \n                                                                                                            \nSPDR SERIES TRUST                                                                                           \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued)                                                      \n                                                                                                            \nOctober 31, 2024                                                                                            \n                                                                                                            \n  Foreign Taxes                                                                                             \n                                                                                                            \nThe Fund may be subject to foreign taxes (a portion of which may be reclaimable) on income, stock dividends,\nrealized and unrealized capital gains on investments or certain foreign currency transactions. Foreign taxes\nare recorded in accordance with SSGA Funds Management, Inc.'s (the “Adviser” or “SSGA FM”) understanding of \nthe applicable foreign tax regulations and rates that exist in the foreign jurisdictions in which the Fund  \ninvests. These foreign taxes, if any, are paid by the Fund and are reflected in the Statement of Operations,\nif applicable. Foreign taxes payable or deferred as of October 31, 2024, if any, are disclosed in the Fund's\nStatement of Assets and Liabilities.                                                                        \n                                                                                                            \n  Equalization                                                                                              \n                                                                                                            \nThe Fund follow the accounting practice known as “Equalization” by which a portion of the proceeds from     \nsales and costs of reacquiring Fund shares, equivalent on a per share basis to the amount of distributable  \nnet investment income on the date of the transaction, is credited or charged to undistributed net investment\nincome. As a result, undistributed net investment income per share is unaffected by sales or reacquisition  \nof Fund shares. Amounts related to Equalization can be found on the Consolidated Statement of Changes in Net\nAssets.                                                                                                     \n                                                                                                            \n  Distributions                                                                                             \n                                                                                                            \nDistributions from net investment income, if any, are declared and paid annually. Net realized capital      \ngains, if any, are distributed annually, unless additional distributions are required for compliance with   \napplicable tax regulations. The amount and character of income and capital gains to be distributed are      \ndetermined in accordance with applicable tax regulations which may differ from net investment income and    \nrealized gains recognized for U.S. GAAP purposes.                                                           \n                                                                                                            \n   3.    Derivative Financial Instruments                                                                   \n                                                                                                            \n                                                                                                            \n  Swaps                                                                                                     \n                                                                                                            \nThe Fund may enter into swap agreements, in which the Fund and counterparty agree either to make periodic   \nnet payments on a specified notional amount or a net payment upon termination. Swap agreements are privately\nnegotiated in the OTC market and may be entered into as a bilateral contract (“BL OTC”) or centrally        \ncleared (“centrally cleared swaps”). Swaps are marked-to-market daily and changes in value are recorded as  \nunrealized appreciation (depreciation).                                                                     \n                                                                                                            \nA BL OTC swap is a transaction between a fund and dealer counterparty where cash flows are exchanged between\nthe two parties for the life of the swap. For BL OTC swaps, any upfront premiums paid are recorded as assets\nand any upfront fees received are recorded as liabilities and are shown as credit default swap contracts    \npremiums paid and credit default swap contracts premiums received, respectively, in the Statements of Assets\nand Liabilities and amortized to realized gain/loss ratably over the term of the BL OTC swap. Payments      \nreceived or made by the Fund for BL OTC swaps are recorded in the Statements of Operations as realized gains\nor losses,respectively. When a BL OTC swap is terminated, the Fund will record a realized gain or loss equal\nto the difference between the proceeds from (or cost of) the closing transaction and the Fund’s basis in the\ncontract, if any. Generally, the basis of the contracts is the premium received or paid.                    \n                                                                                                            \nA centrally cleared OTC swap is a transaction executed between a fund and a dealer counterparty, then       \ncleared by a futures commission merchant (FCM) through a clearinghouse. Once cleared, the clearinghouse     \nserves as a central counterparty (“CCP”), with whom a exchanges cash flows for the life of the transaction, \nsimilar to transactions in futures contracts.                                                               \n                                                                                                            \nThe Fund is required to interface with the CCP through a broker. Upon entering into a centrally cleared     \nswap, the Fund is required to deposit initial margin with the broker in the form of cash or securities in an\namount that varies depending on the size and risk profile of the particular swap. Securities deposited as   \ninitial margin if any, are designated on the Consolidated Schedule of Investments and cash deposited is     \nsegregated and recorded on the Consolidated Statement of Assets and Liabilities as Net cash at broker. The  \ndaily change in valuation of centrally cleared swaps is recorded as a receivable or payable for variation   \nmargin in the Statement of Assets and Liabilities. Payments received from (paid to) the counterparty,       \nincluding at termination, are recorded as realized gain (loss) in the Statement of Operations. For both bi- \nlateral and centrally cleared OTC swaps, payments are exchanged at specified intervals, accrued daily       \ncommencing with the effective date of the contract and recorded as realized gain or (loss). Some swaps may  \nbe terminated prior to the effective date and realize a gain or loss upon termination.                      \n                                                     9                                                      \nTable of Contents                                                                                           \n                                                                                                            \nSPDR SERIES TRUST                                                                                           \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued)                                                      \n                                                                                                            \nOctober 31, 2024                                                                                            \n                                                                                                            \n  Total Return Swaps                                                                                        \n                                                                                                            \nTotal return swaps are agreements in which there is an exchange of cash flows whereby one party commits to  \nmake payments on the total return (coupon plus capital gains/losses) of an underlying instrument in exchange\nfor fixed or floating rate interest payments. To the extent the total return of the instrument or index     \nunderlying the transaction exceeds or falls short of the offsetting interest rate obligation, the Fund will \nreceive a payment or make a payment to the counterparty.                                                    \n                                                                                                            \n  Risks associated with Derivatives                                                                         \n                                                                                                            \nDerivative financial instruments involve to varying degrees, elements of credit, market and/or interest rate\nrisk in excess of the amounts reported in the Statement of Assets and Liabilities. Such risks involve the   \npossibility that there will be no liquid market for these agreements, that the counterparty to the          \nagreements may default on its obligation to perform or disagree as to the meaning of the contractual terms  \nin the agreements, and that there may be unfavorable changes in interest rates and/or market values         \nassociated with these transactions.                                                                         \n                                                                                                            \nDerivative transactions can create investment leverage and may be highly volatile. Use of derivatives other \nthan for hedging purposes may be considered speculative. When a Fund invests in a derivative instrument, the\nfuture exposure is potentially unlimited. The value of a derivative instrument will depend on the ability   \nand the willingness of a Fund’s derivative counterparty to perform its obligations under the transaction. A \nliquid secondary market may not always exist for a Fund's derivative positions at any time and may impact   \nthe Fund's ability to establish fair market value of a derivative transaction and close out derivative      \npositions. Although the use of derivatives is intended to complement a Fund's performance, it may instead   \nreduce returns and increase volatility. The measurement of the risks associated with derivative instruments \nis meaningful only when all related and offsetting transactions are considered. A Fund must set aside liquid\nassets or engage in other appropriate measures to cover its obligations under these derivative instruments. \n                                                                                                            \nCertain derivatives, including forward foreign currency contracts and some swap contracts, as applicable,   \nare entered into under the terms and conditions of an ISDA Master Agreement , which are separately          \nnegotiated with each counterparty. An ISDA Master Agreement is a bilateral agreement between a Fund and a   \ncounterparty that governs certain OTC derivatives and typically contains, among other things, collateral    \nposting terms and netting provisions in the event of a default and/or termination event. Under an ISDA      \nMaster Agreement, a Fund may, under certain circumstances, offset with the counterparty certain derivative  \nfinancial instruments’ payables and/or receivables with collateral held and/or posted and create one single \nnet payment. The provisions of the ISDA Master Agreement typically permit a single net payment in the event \nof default including the bankruptcy or insolvency of the counterparty. Bankruptcy or insolvency laws of a   \nparticular jurisdiction may restrict or prohibit the right of offset in bankruptcy, insolvency or other     \nevents. In addition, certain ISDA Master Agreements allow counterparties to terminate derivative contracts  \nprior to maturity in the event a Fund’s net assets decline by a stated percentage or the Fund fails to meet \nthe terms of its ISDA Master Agreements. The result would cause the Fund to accelerate payment of any net   \nliability owed to the counterparty.                                                                         \n                                                                                                            \nFor derivatives traded under an ISDA Master Agreement, the collateral requirements are typically calculated \nby netting the mark-to-market amount for each transaction under such agreement and comparing that amount to \nthe value of any collateral currently pledged by a Fund and the counterparty. Cash collateral that has been \npledged to cover obligations of a Fund and cash collateral received from the counterparty, if any, is       \nreported separately on the Statements of Assets and Liabilities as cash pledged as collateral  and  cash    \nreceived  as  collateral,  respectively.  Non-cash collateral pledged or received by a Fund, if any, is     \nnoted in the Fund's Consolidated Schedule of Investments. Notional principal amounts are one component used \nto calculate the amount of exposure to the underlying instrument, but is not the amount delivered under the \ncontract. Accordingly, credit risk is limited to any amounts receivable from the counterparty. To reduce    \ncredit risk from potential counterparty default, a Fund enters into swap contracts with counterparties whose\ncreditworthiness have has been recommended by SSGA FM approved by the Board. The Fund bears the market risk \narising from any change in index or security values or interest rates.                                      \n                                                     10                                                     \nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued) October 31, 2024\n\nThe following tables summarize the value of the Fund's derivative instruments as of October 31, 2024, and\nthe related location in the accompanying Consolidated Statement of Assets and Liabilities and Consolidated\nStatement of Operations, presented by primary underlying risk exposure:\n                                                                                                            \n                              Liability                                                                     \n                              Derivatives                                                                   \n                    Interest                      Foreign     Credit    Equity     Commodity                \n                    Rate                          Exchange    Risk      Risk            Risk         Total  \n                    Risk                          Risk                                                      \n  SPDR Bloomberg                                                                                            \n  Enhanced Roll                                                                                             \n  Yield                                                                                                     \n  Commodity                                                                                                 \n  Strategy No K-1                                                                                           \n  ETF                                                                                                       \n  Swap Contracts    $—                            $—          $—        $—        $2,303,499    $2,303,499  \n                                                                                                            \n                                                                                                            \n                               Net Realized Gain                                                            \n                               (Loss)                                                                       \n                     Interest                     Foreign     Credit    Equity    Commodity                 \n                     Rate                         Exchange    Risk      Risk      Risk          Total       \n                     Risk                         Risk                                                      \n  SPDR Bloomberg                                                                                            \n  Enhanced Roll                                                                                             \n  Yield                                                                                                     \n  Commodity                                                                                                 \n  Strategy No K-1                                                                                           \n  ETF                                                                                                       \n  Swap Contracts     $—                           $—          $—        $—        $(278,461)    $(278,461)  \n                                                                                                            \n                                                                                                            \n                            Net Change in                                                                   \n                            Unrealized                                                                      \n                            Appreciation/De…                                                                \n                  Interest                    Foreign     Credit    Equity    Commodity                     \n                  Rate                        Exchange    Risk      Risk      Risk            Total         \n                  Risk                        Risk                                                          \n  SPDR Bloomberg                                                                                            \n  Enhanced Roll                                                                                             \n  Yield                                                                                                     \n  Commodity                                                                                                 \n  Strategy No                                                                                               \n  K-1 ETF                                                                                                   \n  Swap Contracts  $—                          $—          $—        $—        $(2,025,038)    $(2,025,038)  \n                                                                                                            \n                                                                                                            \n                  Offsetting of                                                                             \n                  Financial Assets                                                                          \n                  and Derivative                                                                            \n                  Assets                                                                                    \n                                                   Total Return                                             \n                                                   Swaps                                                    \n                                    Gross Amounts                   Amount       Cash Collateral    Net     \n  Counterparty                          of Assets                   Eligible     Received           Amount  \n                                                                    to Offset                               \n  BNP Paribas SA                          $96,384                   $(96,384)    $—                 $—      \n                                          $96,384                   $(96,384)    $—                 $—      \n                                                                                                            \n                                                                                                            \n                  Offsetting of                                                                             \n                  Financial                                                                                 \n                  Liabilities and                                                                           \n                  Derivative                                                                                \n                  Liabilities                                                                               \n                                                   Total Return                                             \n                                                   Swaps                                                    \n                                    Gross Amounts                      Amount    Cash Collateral    Net     \n  Counterparty                     of Liabilities                    Eligible        Pledged (a)    Amount  \n                                                                    to Offset                               \n  Bank of                              $(463,854)                          $—           $463,854    $—      \n  America NA                                                                                                \n  BNP Paribas SA                         -729,860                      96,384            633,476    —       \n  Citibank NA                            -463,854                           —            463,854    —       \n  JPMorgan                               -463,854                           —            463,854    —       \n  Securities LLC                                                                                            \n                                     $(2,121,422)                     $96,384         $2,025,038    $—      \n                                                                                                            \n(a) In some instances, the total collateral received and/or pledged may be more than the amount shown due to\novercollateralization.\n\n11\nTable of Contents                                                                                           \n                                                                                                            \nSPDR SERIES TRUST                                                                                           \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued)                                                      \n                                                                                                            \nOctober 31, 2024                                                                                            \n                                                                                                            \n  4.    Fees and Transactions with Affiliates                                                               \n                                                                                                            \n                                                                                                            \n  Advisory Fee                                                                                              \n                                                                                                            \nThe Trust, on behalf of the Fund, has entered into an Investment Advisory Agreement with SSGA FM. For its   \nadvisory services, the Fund pays the Adviser a management fee at an annual rate of 0.28% of its average     \ndaily net assets. The fees are accrued daily and paid monthly                                               \n                                                                                                            \nFrom time to time, the Adviser may waive all or a portion of its management fee. The Adviser pays all       \nexpenses of the Fund other than the management fee, acquired fund fees and expenses associated with holdings\nof acquired funds for cash management purposes, brokerage expenses, taxes, interest, fees and expenses of   \nthe Independent Trustees (including any Trustee’s counsel fees), litigation expenses, and other             \nextraordinary expenses.                                                                                     \n                                                                                                            \nFor the period ended October, 31, 2024, the Adviser waived fees in the amount of $3,880.                    \n                                                                                                            \nAdministrator, Custodian, Sub-Administrator and Transfer Agent Fees                                         \n                                                                                                            \nSSGA FM serves as administrator and State Street Bank and Trust Company (“State Street”), an affiliate of   \nthe Adviser, serves as custodian, sub-administrator and transfer agent. State Street receives fees for its  \nservices as custodian, sub-administrator and transfer agent from the Adviser.                               \n                                                                                                            \n  Distributor                                                                                               \n                                                                                                            \nState Street Global Advisors Funds Distributors, LLC (“SSGA FD” or the “Distributor”), an affiliate of the  \nAdviser, serves as the distributor of the Trust.                                                            \n                                                                                                            \n  Other Transactions with Affiliates                                                                        \n                                                                                                            \nThe Fund may invest in affiliated entities, including securities issued by State Street Corporation,        \naffiliated funds, or entities deemed to be affiliates as a result of the Fund owning more than five percent \nof the entity’s voting securities or outstanding shares. Amounts relating to these transactions during the  \nperiod ended October 31, 2024, are disclosed in the Consolidated Schedule of Investments..                  \n                                                                                                            \n  5.    Trustees’ Fees                                                                                      \n                                                                                                            \nThe fees and expenses of the Independent Trustees are paid directly by the Funds. The Independent Trustees  \nare reimbursed for travel and other out-of-pocket expenses in connection with meeting attendance and        \nindustry seminars.                                                                                          \n                                                                                                            \n  6.    Income Tax Information                                                                              \n                                                                                                            \nThe Fund intends to qualify as a regulated investment company under Subchapter M of the Internal Revenue    \nCode of 1986, as amended. The Fund will not be subject to federal income taxes to the extent it distributes \nits taxable income, including any net realized capital gains, for each fiscal year. Therefore, no provision \nfor federal income tax is required.                                                                         \n                                                                                                            \nThe Fund will file federal and various state and local tax returns as required. No income tax returns are   \ncurrently under examination. Generally, the federal returns are subject to examination by the Internal      \nRevenue Service for a period of three years from date of filing, while the state returns may remain open for\nan additional year depending upon jurisdiction.                                                             \n                                                                                                            \nDistributions to shareholders are recorded on ex-dividend date. Income dividends and gain distributions are \ndetermined in accordance with income tax rules and regulations, which may differ from generally accepted    \naccounting principles.                                                                                      \n                                                                                                            \nCertain capital accounts in the financial statements have been adjusted for permanent book-tax differences. \nThese adjustments have no impact on net asset values or results of operations. Temporary book-tax           \ndifferences will reverse in the future. These book-tax differences are primarily due to income and/or gains \nderived from the Cayman subsidiary.                                                                         \n                                                     12                                                     \nTable of Contents SPDR SERIES TRUST SPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF\nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued) October 31, 2024\n\nThe Fund gains exposure to commodity-linked derivative instruments by investing in its wholly-owned\nSubsidiary. The Subsidiary is classified as a controlled foreign corporation under Subchapter N of the\nInternal Revenue Code. As a U.S. shareholder of a controlled foreign corporation, the Fund will include in\nits taxable income its share of the wholly-owned Subsidiary’s income and capital gains, to the extent of its\nearnings and profits. Net investment losses of the Subsidiary cannot be deducted by the Fund in the current\nperiod nor carried forward to offset taxable income in future periods. At October 31, 2024, the components\nof distributable earnings on a tax basis were as follows:\n                                                                                                            \n                         Undistributed    Capital Loss     Undistributed    Net Unrealized                  \n                       Ordinary Income    Carryforwards    Long-Term        Gains (Losses)    Total         \n                                                           Capital Gains                                    \n  SPDR Bloomberg                                                                                            \n  Enhanced Roll Yield         $260,116    $—               $—               $(2,025,038)      $(1,764,922)  \n  Commodity Strategy                                                                                        \n  No K-1 ETF                                                                                                \n                                                                                                            \nAs of October 31, 2024, gross unrealized appreciation and gross unrealized depreciation of investments and\nother financial instruments based on cost for federal income tax purposes were as follows:\n                                                                                                     \n                                              Tax    Gross                  Gross    Net Unrealized  \n                                             Cost    Unrealized        Unrealized    Appreciation    \n                                                     Appreciation    Depreciation    (Depreciation)  \n  SPDR Bloomberg Enhanced Roll Yield  $91,580,312    $—                $2,025,038    $(2,025,038)    \n  Commodity Strategy No K-1 ETF                                                                      \n                                                                                                     \n7. Risks Market Risk The Fund’s investments are subject to changes in general economic conditions, general\nmarket fluctuations and the risks inherent in investment in securities markets. Investment markets can be\nvolatile and prices of investments can change substantially due to various factors including, but not\nlimited to, economic growth or recession, changes in interest rates, changes in the actual or perceived\ncreditworthiness of issuers, and general market liquidity. The Fund is subject to the risk that geopolitical\nevents will disrupt securities markets and adversely affect global economies and markets. Local, regional or\nglobal events such as war, acts of terrorism, the spread of infectious illness, such as COVID-19, or other\npublic health issues, or other events could have a significant impact on the Fund and its investments.\nCommodities and Commodity-Linked Derivatives Risk Commodity prices can have significant volatility, and\nexposure to commodities can cause the net asset value of Fund Shares to decline or fluctuate in a rapid and\nunpredictable manner. A liquid secondary market may not exist for certain commodity investments, which may\nmake it difficult for the Fund to sell them at a desirable price or at the price at which it is carrying\nthem. The value of commodities and commodity-linked derivative instruments typically is based upon the price\nmovements of a physical commodity or an economic variable linked to such price movements. Therefore, the\nvalue of commodities and commodity-linked derivative instruments may be affected by, for example, changes in\noverall market movements, economic conditions, changes in interest rates, or factors affecting a particular\ncommodity or industry,such as production, supply, demand, drought, floods, weather, political, economic and\nregulatory developments. These factors may impair the ability of the Fund to sell its portfolio holdings\nquickly or for full value. Commodity-linked derivatives are subject to the risk that the counterparty to the\ntransaction may default or otherwise fail to perform. Counterparty Risk The Fund will be subject to credit\nrisk with respect to the counterparties with which the Fund enters into derivatives instruments, as well as\nother transactions. If a counterparty fails to meet its contractual obligations, the Fund may be unable to\nterminate or realize any gain on the investment or transaction, or to recover collateral posted to the\ncounterparty, resulting in a loss to the Fund. If the Fund holds collateral posted by its counterparty, it\nmay be delayed or prevented from realizing on the collateral in the event of a bankruptcy or insolvency\nproceeding relating to the counterparty.\n\n13\nTable of Contents                                                                                           \n                                                                                                            \nSPDR SERIES TRUST                                                                                           \n                                                                                                            \nSPDR BLOOMBERG ENHANCED ROLL YIELD COMMODITY STRATEGY NO K-1 ETF                                            \n                                                                                                            \nCONSOLIDATED NOTES TO FINANCIAL STATEMENTS (continued)                                                      \n                                                                                                            \nOctober 31, 2024                                                                                            \n                                                                                                            \n  8.    Subsequent Events                                                                                   \n                                                                                                            \nManagement has evaluated the impact of all subsequent events on the Fund through the date the financial     \nstatements were issued and has determined that there were no subsequent events requiring adjustment or      \ndisclosure in the financial statements.                                                                     \n                                                     14                                                     \nTable of Contents                                                                                           \n                                                                                                            \n  SPDR SERIES TRUST                                                                                         \n                                                                                                            \nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM                                                     \n                                                                                                            \nTo the Shareholders of SPDR Bloomberg Enhanced Roll Yield Commodity Strategy No K-1 ETF and the Board of    \nTrustees of SPDR ® Series Trust                                                                             \n                                                                                                            \n   Opinion on the Financial Statements                                                                      \n                                                                                                            \nWe have audited the accompanying consolidated statement of assets and liabilities of SPDR Bloomberg Enhanced\nRoll Yield Commodity Strategy No K-1 ETF (the “Fund”) (one of the funds constituting SPDR ® Series Trust    \n(the “Trust”)), including the consolidated schedule of investments, as of October 31, 2024, and the related \nconsolidated statements of operations and changes in net assets, and the consolidated financial highlights  \nfor the period from September 5, 2024 (commencement of operations) through October 31, 2024, and the related\nnotes (collectively referred to as the “financial statements”). In our opinion, the financial statements    \npresent fairly, in all material respects, the consolidated financial position of the Fund (one of the funds \nconstituting SPDR ® Series Trust) at October 31, 2024, and the consolidated results of its operations, the  \nconsolidated changes in net assets and its consolidated financial highlights for the period from September  \n5, 2024 (commencement of operations) through October 31, 2024, in conformity with U.S. generally accepted   \naccounting principles.                                                                                      \n                                                                                                            \n  Basis for Opinion                                                                                         \n                                                                                                            \nThese financial statements are the responsibility of the Trust’s management. Our responsibility is to       \nexpress an opinion on the Fund’s financial statements based on our audit. We are a public accounting firm   \nregistered with the Public Company Accounting Oversight Board (United States) (“PCAOB”) and are required to \nbe independent with respect to the Trust in accordance with the U.S. federal securities laws and the        \napplicable rules and regulations of the Securities and Exchange Commission and the PCAOB.                   \n                                                                                                            \nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan  \nand perform the audit to obtain reasonable assurance about whether the financial statements are free of     \nmaterial misstatement, whether due to error or fraud. The Trust is not required to have, nor were we engaged\nto perform, an audit of the Trust’s internal control over financial reporting. As part of our audit we are  \nrequired to obtain an understanding of internal control over financial reporting, but not for the purpose of\nexpressing an opinion on the effectiveness of the Trust’s internal control over financial reporting.        \nAccordingly, we express no such opinion.                                                                    \n                                                                                                            \nOur audit included performing procedures to assess the risks of material misstatement of the financial      \nstatements, whether due to error or fraud, and performing procedures that respond to those risks. Such      \nprocedures included examining, on a test basis, evidence regarding the amounts and disclosures in the       \nfinancial statements. Our procedures included confirmation of securities owned as of October 31, 2024, by   \ncorrespondence with the custodian, brokers and others; when replies were not received from brokers and      \nothers, we performed other auditing procedures. Our audit also included evaluating the accounting principles\nused and significant estimates made by management, as well as evaluating the overall presentation of the    \nfinancial statements. We believe that our audit provides a reasonable basis for our opinion.                \n                                                                                                            \nWe have served as the auditor of one or more State Street Global Advisors investment companies since 2000.  \n                                                                                                            \nBoston, Massachusetts                                                                                       \n                                                                                                            \nDecember 20, 2024                                                                                           \n                                                     15                                                     \nTable of Contents                                                                                           \n                                                                                                            \n  SPDR SERIES TRUST                                                                                         \n                                                                                                            \n                                                                                                            \n  OTHER INFORMATION                                                                                         \n                                                                                                            \n                                                                                                            \n  October 31, 2024 (Unaudited)                                                                              \n                                                                                                            \n                                                                                                            \n  Tax Information                                                                                           \n                                                                                                            \nFor federal income tax purposes, the following information is furnished with respect to the distributions of\nthe Trust for its fiscal year ended October 31, 2024.                                                       \n                                                                                                            \n  Dividends Received Deduction                                                                              \n                                                                                                            \nEach Fund reports the maximum amount allowable of its net taxable income as eligible for the corporate      \ndividends received deduction.                                                                               \n                                                                                                            \n  Qualified Dividend Income                                                                                 \n                                                                                                            \nA portion of dividends distributed by the Funds during the fiscal year ended October 31, 2024 are considered\nqualified dividend income and are eligible for reduced tax rates. Each Fund reports the maximum amount      \nallowable of its net taxable income as qualified dividend income as provided in the Jobs and Growth Tax     \nRelief Reconciliation Act of 2003.                                                                          \n                                                                                                            \n  Qualified Interest Income                                                                                 \n                                                                                                            \nThe Fund reports the maximum amount allowable of its net taxable income and short-term capital gain as      \nqualified interest income.                                                                                  \n                                                                                                            \n  Interest Dividends                                                                                        \n                                                                                                            \nThe Fund reports the maximum amount allowable as Section 163(j) Interest Dividends.                         \n                                                     16                                                     \nTable of Contents                                                                                           \n                                                                                                            \n  SPDR Series Trust                                                                                         \n                                                                                                            \nStatement Regarding Basis for Approval of Investment Advisory Contract                                      \n                                                                                                            \n  October 31, 2024 (Unaudited)                                                                              \n                                                                                                            \n                                                                                                            \n  Approval of Investment Advisory Agreement                                                                 \n                                                                                                            \nAt a meeting held on August 13-15, 2024, the Board of Trustees (the “Board”) of SPDR Series Trust (“SST” or \nthe “Trust”) evaluated proposal to initially approve the Investment Advisory Agreement (the “Advisory       \nAgreement” or the “Agreement”) between SST and SSGA Funds Management, Inc. (the “Adviser” or “SSGA FM”) with\nrespect to the following series of SST: SPDR Bloomberg Enhanced Roll Yield Commodity Strategy No K-1 ETF    \n(the “New ETF”). The Trustees who are not “interested persons” of the Trust within the meaning of the       \nInvestment Company Act of 1940, as amended (the “Independent Trustees”), also met separately to consider the\nAgreement. The Independent Trustees were advised by their independent legal counsel throughout the process. \n                                                                                                            \nTo evaluate the Advisory Agreement, the Board requested and SSGA FM, the Trust’s adviser and administrator, \nand State Street Bank and Trust Company, the Trust’s sub-administrator, transfer agent and custodian (“State\nStreet”) provided, such materials as the Board, with the advice of counsel, deemed reasonably necessary. In \ndeciding whether to approve the Advisory Agreement, the Board considered various factors, including the     \nnature, extent and quality of services provided by the Adviser with respect to the SPDR ETFs currently under\nthe Agreement, the proposed cost of those services in relation to the services to be provided and in        \nrelation to fees charged to comparable funds, other benefits to the Adviser of its relationship with each   \nNew ETF, and extent to which economies of scale would be shared as each New ETF grows.                      \n                                                                                                            \n  Nature, Extent and Quality of Services                                                                    \n                                                                                                            \nThe Board considered the nature, extent and quality of services to be provided by the Adviser. In doing so, \nthe Trustees relied on their prior experience in overseeing the management of the Trusts and the materials  \nprovided prior to and at the meeting. The Board reviewed the Advisory Agreements and the Adviser’s          \nresponsibilities for managing investment operations of the New ETF in accordance with the New ETF’s         \ninvestment objectives and policies, and applicable legal and regulatory requirements. The Board appreciated \nthe nature of the New ETF as an exchange-traded fund and the experience and expertise of the Adviser in     \nmanaging exchange-traded funds. The Board considered the background and experience of the Adviser’s senior  \nmanagement, including those individuals responsible for portfolio management, and regulatory compliance of  \nthe New ETF. The Board also considered the portfolio management resources, structures and practices of the  \nAdviser, including those associated with monitoring and ensuring the New ETF’s compliance with its          \ninvestment objectives and policies, and applicable laws and regulations. The Board further considered       \ninformation about the Adviser’s best execution procedures and overall investment management business, noting\nthat the Adviser serves a wide range of clients across a broad spectrum of asset classes. The Board looked  \nat the Adviser’s general knowledge of the investment management business and that of its affiliates which   \nmake up State Street Global Advisors, through which the Adviser shares all of its senior personnel. The     \nBoard specifically considered the Adviser’s experience in managing equity and fixed income exchange-traded  \nfunds with index-based investment objectives, as well as actively-managed exchange-traded funds.            \n                                                                                                            \n  Fees Charged to Comparable Funds                                                                          \n                                                                                                            \nThe Board evaluated the New ETF’s proposed unitary fee through review of comparative information with       \nrespect to fees paid by similar funds– i.e., exchange-traded funds tracking similar commodity or equity     \nincome indexes with respect to the SPDR Bloomberg Enhanced Roll Yield Commodity Strategy No K-1 ETF. The    \nBoard reviewed the universe of similar exchange-traded funds for the New ETF based upon data independently  \nobtained from Broadridge Financial Solutions, Inc. and related comparative information for similar exchange-\ntraded funds. In certain instances as considered appropriate by the Board, the Board explored with          \nmanagement the reasons for the differences between the New ETF’s fee and fees paid by similar funds.        \n                                                                                                            \n  Other Benefits                                                                                            \n                                                                                                            \nThe Board also considered whether the Adviser or its affiliates benefited in other ways from its            \nrelationship with the Trusts, noting that the Adviser does not currently maintain soft-dollar arrangements  \nin connection with the Trusts’ brokerage transactions.                                                      \n                                                                                                            \n  Economies of Scale                                                                                        \n                                                                                                            \nThe Board reviewed information regarding economies of scale or other efficiencies that may result as the New\nETF’s assets grow in size. The Board noted that the advisory fee rate for the New ETF does not provide for  \nbreakpoints as assets of the New ETF increase. However, the Board further noted the Adviser’s assertion that\nfuture economies of scale (among several factors) had been taken into consideration for the  New ETF by     \nfixing a relatively low advisory fees, effectively sharing the benefits of lower fees with the New ETF from \nthe time of its inception. The Adviser also asserted that one of the benefits of the unitary fee was to     \nprovide an unvarying                                                                                        \n                                                     17                                                     \nTable of Contents                                                                                           \n                                                                                                            \nSPDR Series Trust                                                                                           \n                                                                                                            \nStatement Regarding Basis for Approval of Investment Advisory Contract (continued)                          \n                                                                                                            \nOctober 31, 2024 (Unaudited)                                                                                \n                                                                                                            \nexpense structure, which could be lost or diluted with the addition of breakpoints. The Board noted that it \nintends to continue to monitor fees as the New ETF grows in size and assess whether fee breakpoints may be  \nwarranted.                                                                                                  \n                                                                                                            \n  Conclusion                                                                                                \n                                                                                                            \nAfter weighing the foregoing factors, none of which was dispositive in itself and may have been weighed     \ndifferently by each Trustee, the Board, including the Independent Trustees voting separately, approved the  \nAdvisory Agreement for the New ETF. In approving the Advisory Agreement, the Board, including the           \nIndependent Trustees voting separately, found that the terms of the Advisory Agreement are fair and         \nreasonable and that the approval of the Advisory Agreement is in the best interests of the New ETF and their\nshareholders. The Board’s conclusions with respect to the factors were as follows: (a) the nature, extent   \nand quality of the services expected to be provided by the Adviser with respect to the New ETF were         \nappropriate; (b) the Adviser’s unitary fee for the New ETF, considered in relation to the services expected \nto be provided, and in relation to the fees charged to comparable funds, was reasonable; and (c) any        \nadditional potential benefits to the Adviser or its affiliates were not of a magnitude to materially affect \nthe Board’s conclusions. The Independent Trustees were advised by their independent counsel throughout the  \nprocess.                                                                                                    \n                                                     18                                                     \n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 8. Changes in and Disagreements with Accountants forOpen-EndManagement Investment Companies        │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nNot applicable.\n\nItem9. Proxy Disclosures for Open-EndManagement Investment Companies\n\nNot applicable.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 10. Remuneration Paid to Directors, Officers, and Others ofOpen-EndManagement Investment           │\n│  Companies                                                                                               │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nRenumeration Paid to Directors, Officers, and Others of Open-End Investment Companies is included as part of\nthe Financial Statements filed under Item 7(a) of this Form.\n\nItem11. Statement Regarding Basis for Approval of Investment Advisory Contract\n\nThe Registrant’s Statement Regarding Basis for Approval of Investment Advisory Contract is included as part\nof the Financial Statements filed under Item 7(a) of this Form.\n\nItem12. Disclosure of Proxy Voting Policies and Procedures for Closed-EndManagement Investment Companies.\n\nNot applicable to the registrant.\n\nItem13. Portfolio Managers of Closed-EndManagement Investment Companies.\n\nNot applicable to the registrant.\n\nItem14. Purchases of Equity Securities by Closed-EndManagement Investment Company and Affiliated Purchasers.\n\nNot applicable to the registrant.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 15. Submission of Matters to a Vote of Security Holders.                                           │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nThe registrant has not adopted any material changes to the procedures by which shareholders may recommend\nnominees to the registrant’s Board.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 16. Controls and Procedures.                                                                       │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n(a) Within 90 days of the filing date of this Form N-CSR, Ann M. Carpenter, the registrant’s President and\nPrincipal Executive Officer, and Bruce S. Rosenberg, the registrant’s Treasurer and Principal Financial\nOfficer, reviewed the registrant’s disclosure controls and procedures (as defined in Rule 30a-3(c) under the\nInvestment Company Act of 1940, as amended ( the “1940 Act”) and evaluated their effectiveness. Based on\ntheir review, Ms. Carpenter and Mr. Rosenberg determined that the disclosure controls and procedures\nadequately ensure that information required to be disclosed by the registrant in its periodic reports is\nrecorded, processed, summarized and reported within the time periods required by the U.S. Securities and\nExchange Commission.\n\n(b) There were no changes in the registrant’s internal control over financial reporting (as defined in Rule\n30a-3(d) under the 1940 Act) that occurred during the period covered by this report that have materially\naffected, or are reasonably likely to materially affect, the registrant’s internal control over financial\nreporting.\n\nItem17. Disclosure of Securities Lending Activities for Closed-EndManagement Investment Companies.\n\n(a) Not applicable to the registrant.\n\n(b) Not applicable to the registrant.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 18. Recovery of Erroneously Awarded Compensation                                                   │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\nNot applicable to the registrant.\n╭─ • ──────────────────────────────────────────────────────────────────────────────────────────────────────╮\n│                                                                                                          │\n│  Item 19. Exhibits.                                                                                      │\n│                                                                                                          │\n╰──────────────────────────────────────────────────────────────────────────────────────────────────────────╯\n(a)(1) Code of Ethics referred to in Item 2.\n\n(a)(2) Not applicable to the registrant.\n\n(a)(3) Separate certifications required by Rule 30a-2(a)under the 1940 Act for each principal executive\nofficer and principal financial officer of the registrant are attached.\n\n(a)(4) Not applicable to the registrant.\n\n(a)(5) Not applicable.\n\n(b) A single certification required by Rule 30a-2(b)under the 1940 Act, Rule 13a-14(b)or Rule 15d-14(b)under\nthe Securities Exchange Act of 1934, as amended, and Section 1350 of Chapter 63 of Title 18 of the United\nStates Code for the principal executive officer and principal financial officer of the registrant is\nattached.\n\n(101) Inline Interactive Data File - the instance document does not appear in the Interactive Data File\nbecause its XBRL tags are embedded within the inline XBRL document.\n                                                                                                            \n                                                 SIGNATURES                                                 \n                                                                                                            \nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, and the Investment Company\nAct of 1940, as amended, the registrant has duly caused this report to be signed on its behalf by the\nundersigned, thereunto duly authorized.\n                                                                      \n       SPDR® Series Trust                                             \n  By:                      /s/ Ann M. Carpenter                       \n                           Ann M. Carpenter                           \n                           President and Principal Executive Officer  \n                                                                      \nDate: January 2, 2025\n\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, and the Investment Company\nAct of 1940, as amended, this report has been signed below by the following persons on behalf of the\nregistrant and in the capacities and on the dates indicated.\n                                                    \n  By:    /s/ Ann M. Carpenter                       \n         Ann M. Carpenter                           \n         President and Principal Executive Officer  \n                                                    \nDate: January 2, 2025\n                                                    \n  By:    /s/ Bruce S. Rosenberg                     \n         Bruce S. Rosenberg                         \n         Treasurer and Principal Financial Officer  \n                                                    \nDate: January 2, 2025\n"
}