{
  "title": "CFTC Staff Issues Interpretation Regarding Financial Reporting Requirements for Japanese Nonbank Swap Dealers",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9057-25",
  "date": "2025-03-20",
  "date_standard": "2025-03-20",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9057-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9057-25</h1>\n<h1>\n<span>CFTC Staff Issues Interpretation Regarding Financial Reporting Requirements for Japanese Nonbank Swap Dealers </span>\n</h1>\n<p><b>March 20, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><strong>WASHINGTON, D.C.</strong> —The Commodity Futures Trading Commission’s Market Participants Division today issued interpretation concerning financial reporting obligations for nonbank swap dealers subject to regulation by the Financial Services Agency of Japan (Japanese nonbank SDs).</p><p>On July 18, 2024, the Commission issued a comparability determination and related comparability order granting substituted compliance in connection with the CFTC’s capital and financial reporting requirements to Japanese nonbank SDs, subject to certain conditions in the order (<a href=\"https://www.cftc.gov/LawRegulation/FederalRegister/final-rules/2024-15092.html\">Japanese Comparability Order</a>). One of the conditions in the Japanese Comparability Order, condition 9, requires each Japanese nonbank SD to file a copy of its home regulator Annual Business Report with the CFTC and the National Futures Association (NFA).</p><p>The staff interpretation clarifies that Japanese nonbank SDs may satisfy condition 9 of the Japanese Comparability Order by filing with the CFTC and the NFA certain enumerated schedules of the Annual Business Report (In Scope Schedules), subject to the translation, U.S. dollar conversion, and deadline requirements of condition 9.</p><p>The interpretation was issued in response to a request from the Securities Industry and Financial Markets Association on behalf of its Japanese nonbank SD members that rely on the Japanese Comparability Order.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "5a8d4e41ca5b2a6c25fadafe7f8ad112",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}