{
  "title": "Federal Court Orders Recovery of Nearly $2.3M for Victims of an Online Romance Scam",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9058-25",
  "date": "2025-03-21",
  "date_standard": "2025-03-21",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9058-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9058-25</h1>\n<h1>\n<span>Federal Court Orders Recovery of Nearly $2.3M for Victims of an Online Romance Scam</span>\n</h1>\n<h3>Ruling Stems from a CFTC Complaint Against Debiex</h3>\n<p><b>March 21, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — <span style=\"border:1.0pt none windowtext;padding:0in;\">The Commodity Futures Trading Commission today announced the U.S. District Court for the District of Arizona issued a default judgment against <strong>Debiex</strong>, a purported digital asset platform.</span><span> The order, issued March 13, finds Debiex liable for fraud in connection with </span><span style=\"border:1.0pt none windowtext;padding:0in;\">digital asset commodity trading and misappropriating over $2 million in customers’ funds. [See CFTC Press Release No. </span><a href=\"https://www.cftc.gov/PressRoom/PressReleases/8850-24\"><span style=\"border:1.0pt none windowtext;padding:0in;\">8850-24</span></a><span style=\"border:1.0pt none windowtext;padding:0in;\">.]</span></p><p>The order bans Debiex from trading in any CFTC regulated markets or registering with the CFTC. It also requires Debiex to pay a $221,466 civil monetary penalty and over $2.2 million in restitution.</p><p><span>As part of the scheme, relief defendant Zhāng Chéng Yáng acted as a money mule when his digital asset wallet was used by Debiex to misappropriate at least one customer’s funds. Zhang is believed to be a Chinese national. By separate order issued on March 12, the court ordered the remaining digital assets in Zhang’s digital asset wallet be returned to the Debiex customer from whom they were fraudulently taken. These digital assets are worth approximately $120,000 before transfer fees.</span></p><p>“This judgment demonstrates the CFTC’s ongoing commitment to protecting U.S. citizens from online scams,” said Director of Enforcement Brian Young. “I commend Jenny Chapin, Dmitriy Vilenskiy and former Division Deputy Director Joan Manley for their diligent and innovative work on this matter.”</p><p>The CFTC cautions that orders requiring repayment of funds to victims may not result in the recovery of any money lost because the wrongdoers may not have sufficient funds or assets. The CFTC will continue to fight vigorously for the protection of customers and to ensure the wrongdoers are held accountable.</p><p><strong>Case Background</strong></p><p><span>These orders stem from a complaint filed by the Commission on Jan. 17, 2024, which alleged Debiex operated publicly accessible internet domains, which it used to target victims with a sophisticated fraudulent scheme involving purported digital asset commodity trading. As detailed in the complaint, the scheme involved the coordinated efforts of three groups: (1) “Solicitors,” who contacted customers via at least one U.S.-based social media platform and pretended to befriend or romance the customers to solicit them to open and fund trading accounts with Debiex; (2) “Customer Service,” which purported to set up and service Debiex trading accounts on behalf of the customers; and (3) “Money Mules,” such as, but not limited to, Zhang, whose digital asset wallets were used by Debiex to accept and/or misappropriate customer funds. As further alleged, instead of using the funds to trade on behalf of the customers, as promised, Debiex misappropriated the customers’ digital assets. Unbeknownst to the customers, and as alleged, the Debiex websites merely mimicked the features of a legitimate live trading platform and the “trading accounts” depicted on the websites were a complete ruse. No actual digital asset trading took place on the customers’ behalf.   </span></p><p>The Division of Enforcement thanks and acknowledges the assistance of the FBI’s Phoenix Office.</p><p>The DOE staff responsible for this case are Jenny Chapin, Dmitriy Vilenskiy, and former CFTC Deputy Director Joan Manley. Additional DOE staff who assisted include Jennifer Diamond, Mary Lutz, and Elizabeth Padgett from the DOE’s International Enforcement Cooperation Unit.    </p><p><span>* * * * * *</span></p><p><strong>CFTC’s Efforts in Fighting Online Scams</strong></p><p>The CFTC has issued several customer protection advisories about <a href=\"https://www.cftc.gov/LearnAndProtect/romancefrauds\">Romance Frauds | CFTC</a>, which warns users of online dating and social media platforms about an increase in scams that lure victims into sending their money to fraudulent websites that claim to trade foreign currency exchange (forex) contracts, precious metals contracts, and/or digital assets. </p><p>The CFTC also strongly urges the public to verify a company’s registration with the CFTC at <a href=\"http://www.nfa.futures.org/basicnet\">NFA BASIC</a> before committing funds. If unregistered, a customer should be wary of providing funds to that entity.</p><p>Suspicious activities or information, such as possible violations of commodity trading laws, can be reported to the Division of Enforcement via a toll-free hotline 866-FON-CFTC (866-366-2382) or<a href=\"http://www.cftc.gov/ConsumerProtection/FileaTiporComplaint/index.htm\"> file a tip or complaint online</a> or contact the <a href=\"https://www.whistleblower.gov/\">Whistleblower Office</a>. Whistleblowers are eligible to receive between 10 and 30 percent of the monetary sanctions collected, paid from the Customer Protection Fund financed through monetary sanctions paid to the CFTC by violators of the CEA.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "2cdeae6eb3d5a3548e208ea0c78c67c4",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}