{
  "title": "CFTC’s Office of Customer Education and Outreach Releases New Advisory on Fraud Using Generative AI",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9056-25",
  "date": "2025-03-19",
  "date_standard": "2025-03-19",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9056-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9056-25</h1>\n<h1>\n<span>CFTC’s Office of Customer Education and Outreach Releases New Advisory on Fraud Using Generative AI</span>\n</h1>\n<p><b>March 19, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> </strong>— A new Commodity Futures Trading Commission customer advisory says generative artificial intelligence is making it increasingly easier for fraudsters to create convincing scams. </p><p>According to the latest Office of Customer Education and Outreach customer advisory, <a href=\"https://www.cftc.gov/sites/default/files/2025/03/AI_fraud.pdf\"><em>Criminals Increasing Use of Generative AI to Commit Fraud</em></a><em>, </em>crooks are using AI to create fake <span>images, voices, videos, live-streaming video chats, social media profiles, and malicious websites designed to look like legitimate financial trading platforms.</span>  </p><p>The OCEO advisory describes how fraudsters use AI to create fraudulent identifications with phony photos and videos that can appear very real if one is not familiar with the advances of AI technology. The fraudsters also are using AI to forge government or financial documents. <span>An </span>FBI <a href=\"https://www.ic3.gov/PSA/2024/PSA241203#fn1\">public service announcement</a> also warns the public about how criminals are using AI to commit fraud and how the technology is being used in relationship investment scams. </p><p>“Fraudsters can use new technologies to mask their identities, not only in still photographs, say, in social media profiles, but also in video chats that alter their facial features and voices to match,” said OCEO Director Melanie Devoe. “Identifying real from fake can be difficult. The best defense is to never give money to people you only meet online.” </p><p>The advisory provides specific actions people should take to protect themselves, including strengthening social media account privacy settings and keeping personal or sensitive information private, especially from people they only know online or callers using phone numbers they don’t recognize<span>. </span></p><p><strong>About the Office of Customer Education and Outreach</strong></p><p>OCEO is dedicated to helping customers protect themselves from fraud or violations of the Commodity Exchange Act through the research and development of effective financial education materials and initiatives. OCEO engages in outreach and education to retail investors. The office also frequently partners with federal and state regulators as well as consumer protection groups. The CFTC’s full repository of customer education materials can be found at: <a href=\"https://www.cftc.gov/LearnAndProtect\">cftc.gov/LearnAndProtect</a>.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "cfc08adbc2ede32fd092d523ac9ffb69",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}