{
  "title": "CIBC named global leader in Investment Banking by Global Finance",
  "url": "https://cibc.mediaroom.com/2025-02-26-CIBC-named-global-leader-in-Investment-Banking-by-Global-Finance",
  "date": "2025-02-26T00:00:00",
  "short_description": "",
  "content": "Latest recognition also includes awards in sustainable finance and green bonds\nTORONTO\n,\nFeb. 26, 2025\n/CNW/ - CIBC has been recognized by Global Finance for the third consecutive year as the Best Investment Bank in\nCanada\n, and for its leadership in working with clients to support their environmental and social sustainability goals at the Global Finance World's Best Investment Bank and Sustainable Finance Awards for 2025, including:\nBest Investment Bank in\nCanada\nBest Sustainable Finance Bank in\nCanada\nBest Bank for Green Bonds,\nNorth America\nBest Bank for Sustaining Communities,\nNorth America\n\"These achievements are a clear demonstration of CIBC's longstanding leadership and expertise in supporting our clients, while enabling a more sustainable future,\" said Christian Exshaw, Deputy Head, Capital Markets, CIBC. \"As trusted advisors, this recognition underscores our continued commitment to helping our clients achieve their ambitions.\"\nThis follows CIBC's\n2024 awards from Global Finance\nfor Best Investment Bank in\nCanada\nand five awards in environmental and social sustainability financing. In addition, CIBC received the 2024 Financial Adviser (Americas) Award by Infrastructure Journal Global for its leading financial advisory expertise through transactions across the energy transition space.\nThe Global Finance Awards recognize leadership in environmental and social sustainability financing, and highlights leading institutions' expertise, advisory and innovation for capital markets clients. Activities in 2024 were considered for both awards.\nAbout CIBC\nCIBC is a leading North American financial institution with 14 million personal banking, business, public sector and institutional clients. Across Personal and Business Banking, Commercial Banking and Wealth Management, and Capital Markets, CIBC offers a full range of advice, solutions and services through its leading digital banking network, and locations across Canada, in the United States and around the world. Ongoing news releases and more information about CIBC can be found at\nwww.cibc.com/ca/media-centre\nSOURCE  CIBC",
  "id": "2025-02-26-CIBC-named-global-leader-in-Investment-Banking-by-Global-Finance",
  "company_name": "Canadian Imperial Bank of Commerce",
  "year": 2025,
  "quarter": 1,
  "month": 2,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "cibc",
  "raw_content_type": "html"
}