{
  "title": "Is 'fraud fatigue' catching you off guard? Stay aware and spot the signs - RBC poll",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125985",
  "date": "Mon, 10 Mar 2025 06:11:00 -0400",
  "short_description": "98% of Canadians have seen more targeted and sophisticated scams Almost two-thirds have received personalized fraud attempts One-third admit to letting their guard down TORONTO, March 10, 2025...",
  "content": "98% of Canadians have seen more targeted and sophisticated scams\nAlmost two-thirds have received personalized\nfraud\nattempts\nOne-third admit to letting their guard down\nTORONTO\n,\nMarch 10, 2025\n/CNW/ - A majority of Canadians are feeling '\nfraud\nfatigue' and increasingly vulnerable as\nfraud\nbecomes more personalized. According to RBC's annual\nFraud\nPrevention Month Poll\n, almost all respondents (98%) have seen more targeted and sophisticated scams, with nearly nine out of 10 (89%) noting a rise in scam attempts more than ever before (up from 77% in 2023).\nIn addition, the majority (86%) of respondents believe it is getting harder to recognize scams and protect themselves; two-thirds (65%) are feeling tired of always having to be on the alert; and one-third (33%) admit to letting their guard down.\n\"With the increase in volume and sophistication of scams, it's understandable that Canadians are finding it challenging to always have their guard up when it comes to\nfraud\n. Criminals are using the latest technology to gather information, build trust, create urgency and prey on people's needs and fears,\" says\nVanja Gorazi\n, Vice President,\nFraud\nManagement, RBC. \"This has led to a wave of investment, romance, senior and other scams. It has never been more important to stay alert.\"\nRising threats\nPoll respondents continue to place both phishing (generic deceptive messages through email or text) and spear phishing (more targeted emails and texts that look legitimate from a seemingly trusted source) at the top of their list of scams (79%). The majority also continue to see a rise in scams targeting seniors (76%) and deepfake scams (65%, up from 56% in 2024) impersonating trusted individuals or organizations.\nThe best defence against scams\nThe vast majority of Canadians (97%) believe it's worth it to take steps to protect themselves against\nfraud\n. With scams, they recognize the need to question what they see and hear, with 91% of respondents believing the best defence against scams is staying aware and vigilant. Moreover, almost three-quarters (71%) feel prevention measures must be extreme to be effective.\nActions respondents are taking:\n93% never share passwords, PINs, or login details with anyone\n92% never respond to unsolicited texts, calls or emails\n91% say \"no\" when pressured to respond to an urgent request or offer\n84% always use more than one way to authenticate themselves where possible\n71% no longer trust any form of communication, even if it seems to come from a trusted source\n\"It's human nature to do the right thing for our families, friends and communities – fraudsters know this and try to capitalize on it. When it comes to scams, sometimes even one slip can lead to significant losses and stress. That's why it is so important to stay vigilant, educated and talk to friends and family about how to stay safe from scams,\" notes Gorazi.\nRBC provides three top tips to help protect yourself from\nfraud\n:\nStop.\nPause and double-check the source of a message before acting. Do you feel fearful or rushed to click on a link? With more advanced technology, criminals can easily impersonate your family, friends and trusted sources and persuade you to share your information. If an unexpected offer sounds too good to be true, it likely is; and if it looks fishy, it's probably phishing!\nSet up protection features.\nUse technology to protect yourself. Enable multi-factor authentication and banking alerts on the RBC Mobile app, and remember to take advantage of biometric features such as face or fingerprint ID.\nStay informed.\nRemember that:\nThe bank will never ask you to provide your login ID, PIN, password or one-time code to anyone through text, email or voicemail.\nRBC will never ask you to destroy your debit or credit card and then give it to the bank or a third-party to secure your accounts.\nThe bank will also never ask you to add RBC as a payee for verification, complete a transaction to \"secure\" your account, share a link from an Interac e-transfer or download a remote-access application.\nIf you're unsure that you're speaking with an RBC representative, hang up the phone and call the number on the back of your debit or credit card.\nTo learn more about how to protect yourself and report\nfraud\n, please visit\nHow RBC Keeps You Safe from\nFraud\n.\nFast Facts:\n2025 RBC\nFraud\nPrevention Month Poll\nSelected Findings – National and Regional\nRESPONSE\nCAN\nBC\nAB\nSK/MB\nON\nQC\nAC\nScams are getting more targeted and\nsophisticated\n98 %\n98 %\n99 %\n99 %\n98 %\n96 %\n98 %\nI have received an offer that seemed\npersonalized to me, but it was a scam\n63 %\n64 %\n66 %\n61 %\n65 %\n59 %\n61 %\nI'm tired of having to be on the lookout\nfor scams\n65 %\n61 %\n70 %\n70 %\n65 %\n64 %\n65 %\nI have seen a rise in scam attempts\nmore than ever before\n89 %\n87 %\n88 %\n92 %\n91 %\n88 %\n88 %\nIt is getting harder to recognize scams\nand protect yourself\n86 %\n87 %\n86 %\n93 %\n87 %\n84 %\n85 %\nI have let my guard down when it\ncomes to preventing fraud\n33 %\n36 %\n30 %\n42 %\n31 %\n30 %\n38 %\nYou have to take extreme steps to\nprotect yourself against fraud\n71 %\n65 %\n69 %\n74 %\n73 %\n70 %\n70 %\nIt's a hassle to take steps to protect\nmyself from fraud\n60 %\n54 %\n59 %\n57 %\n57 %\n73 %\n58 %\nIt is worth it to take steps to protect\nagainst fraud\n97 %\n97 %\n98 %\n94 %\n98 %\n96 %\n99 %\nI am my best defense against scams\nin staying up to date and vigilant\n91 %\n92 %\n97 %\n89 %\n92 %\n87 %\n86 %\nRESPONSE\nCAN\nBC\nAB\nSK/MB\nON\nQC\nAC\n\"Actions respondents are taking\"\nNever share passwords, PINs, or\nlogin details with anyone\n93 %\n93 %\n91 %\n94 %\n93 %\n93 %\n94 %\nNever respond to unsolicited texts,\ncalls or emails\n92 %\n90 %\n91 %\n93 %\n93 %\n90 %\n93 %\nJust say no when pressured to\nrespond to an urgent request or offer\n91 %\n92 %\n95 %\n97 %\n92 %\n87 %\n94 %\nAlways use more than one way to\nauthenticate themselves where\npossible\n84 %\n82 %\n89 %\n83 %\n84 %\n85 %\n82 %\nNo longer trust any form of\ncommunication, even if it seems to\ncome from a trusted source\n71 %\n68 %\n71 %\n80 %\n73 %\n65 %\n70 %\n\"Types of\nfraud\nthat have increased over the last year\"\nPhishing (generic scams through email or text)\n79 %\n73 %\n81 %\n86 %\n79 %\n81 %\n76 %\nSpear phishing (emails and texts that\nlook legitimate from a seemingly\ntrusted source)\n79 %\n76 %\n83 %\n87 %\n78 %\n81 %\n68 %\nSenior targeting scams\n76 %\n74 %\n76 %\n71 %\n74 %\n81 %\n74 %\nDeepfake scams\n65 %\n62 %\n64 %\n64 %\n62 %\n74 %\n57 %\nAbout the\nRBC 2025\nFraud\nPrevention Month Poll\nFrom\nJanuary 17 to January 22, 2025\n, an online survey was commissioned by RBC among a representative sample of 1,500 Canadian adults (aged 18+), balanced and weighted on age, gender, region and education according to the latest census data. All respondents were members of the online Angus Reid Forum. For comparison purposes only, a probability sample of this size would carry a margin of error of ±4.4 percentage points, 19 times out of 20.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 19 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.‎\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nMedia contact:\nLisa Seepersad\n, RBC Corporate Communications\nSOURCE  RBC Royal Bank",
  "id": "125985",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}