{
  "title": "RBC's 2024 Sustainability Report now available",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125999",
  "date": "Tue, 29 Apr 2025 08:46:00 -0400",
  "short_description": "Today, RBC released its 2024 Sustainability Report. This year's Sustainability Report combined two of our primary enterprise-wide sustainability disclosures, which in 2023 included our ESG...",
  "content": "TORONTO\n,\nApril 29, 2025\n/CNW/ - Today, RBC released its 2024 Sustainability Report. This year's Sustainability Report combined two of our primary enterprise-wide sustainability disclosures, which in 2023 included our ESG Progress Report and the Climate Report, into one combined disclosure. The 2024 Sustainability Report provides an overview of our sustainability focus areas, impact levers and advancing sustainability topics, highlights and metrics on sustainability factors relevant to RBC. The 2024 Sustainability Report is now available at\nhttps://www.rbc.com/our-impact/reporting-performance\n.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 19 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nhttps://www.rbc.com/our-impact/\n.\nFor more information, please contact:\nSabrina Fraser\n, RBC Communications\nSOURCE RBC",
  "id": "125999",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "report",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}