{
  "title": "Dave McKay of RBC to speak at the 2025 RBC Capital Markets Financial Institutions Conference",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125980",
  "date": "Tue, 25 Feb 2025 09:01:00 -0500",
  "short_description": "Dave McKay, President and Chief Executive Officer of Royal Bank of Canada (TSX: RY) (NYSE: RY) will be participating in a fireside chat with Derek Neldner, CEO and Group Head, RBC Capital Markets,...",
  "content": "TORONTO\n,\nFeb. 25, 2025\n/CNW/ -\nDave McKay\n, President and Chief Executive Officer of Royal Bank of\nCanada\n(TSX: RY) (NYSE: RY) will be participating in a fireside chat with\nDerek Neldner\n, CEO and Group Head, RBC Capital Markets, taking place in\nNew York\nfrom 8:00\na.m. to 8:35\na.m. on March\n4,\n2025 (EST\n).\nA link to the live audio webcast will be available on RBC's website at\nhttp://www.rbc.com/investorrelations/events-presentations.html\non March\n4, 2025. The webcast will be archived for three months.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nInvestor contact:\nAsim Imran\n, Investor Relations,\nasim.imran@rbc.com\n, 416-955-7804\nMedia contact:\nGillian McArdle\n, Financial Communications,\ngillian.mcardle@rbccm.com\n, 416-842-4231\nSOURCE  Royal Bank of\nCanada",
  "id": "125980",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}