{
  "title": "RBC and Carbonhound collaborate to bring automated carbon management solutions to Canadian businesses",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125977",
  "date": "Mon, 10 Feb 2025 08:01:00 -0500",
  "short_description": "Royal Bank of Canada (RBC) and Carbonhound, an automated greenhouse gas emissions reporting platform, today announced a collaboration to help Canadian businesses measure, verify, and manage their...",
  "content": "TORONTO\n,\nFeb. 10, 2025\n/CNW/ - Royal Bank of\nCanada\n(RBC) and Carbonhound, an automated greenhouse gas emissions reporting platform, today announced a collaboration to help Canadian businesses measure, verify, and manage their carbon emissions. This collaboration aligns with RBC's strategy to support clients in their transition to a low-carbon economy.\nAs regulatory requirements and stakeholder expectations surrounding environmental and social sustainability intensify, Canadian businesses face increased demands to accurately report their carbon emissions and the environmental, social, and governance risks within their value chains. Collecting and analyzing emissions data can also provide organizations with valuable insights to help manage their environmental impact, drive efficiencies, and achieve cost savings. Designed for businesses of all sizes and industries, Carbonhound's platform offers intuitive tools intended to simplify carbon tracking and reporting processes.\nWith this collaboration, RBC's commercial clients can access Carbonhound's platform\n1\nto:\nAutomate data collection:\nThrough Carbonhound, businesses can streamline emissions tracking with automated data imports for Scope 1, 2, and 3 greenhouse gas emissions. Leveraging methodology that aligns with global standards like the Greenhouse Gas Protocol and ISO 14064, the platform offers integration with thousands of data sources to help reduce the risk of manual entry errors and save time.\nSimplify emissions reporting:\nBusinesses can generate emissions reports aligned with reporting requirements set by the Carbon Disclosure Project (CDP), Science Based Targets Initiative (SBTi), International Sustainability Standards Board (ISSB), Canadian Sustainability Standards Board (CSSB), and more. The platform also allows organizations to generate custom reports, benchmark against their competitors, and share their climate impact with existing and potential customers.\nTake climate action:\nCarbonhound provides tools to help set emissions reduction targets, implement reduction strategies, and invest in carbon credit portfolios. The features are intended to support businesses in taking climate action and achieving their environmental sustainability goals.\n\"This collaboration reflects our commitment to supporting clients with their own climate transitions by providing tailored advice and sustainable finance solutions to help facilitate change,\" said\nNiranjan Vivekanandan\n, EVP and chief operating officer, Commercial Banking at RBC. \"We are excited to work with Carbonhound to offer our clients an accessible solution that is designed to manage and report carbon emissions. Together, we aim to enable Canadian businesses to make and measure progress in their transition to a low-carbon economy.\"\nAs outlined in RBC's\nClimate Blueprint\n, one of the four pillars of the bank's climate strategy focuses on supporting its clients to reduce their greenhouse gas emissions. In 2024, the bank set a goal to triple lending to renewable energy across RBC Capital Markets and Commercial Banking, and to allocate\n$1 billion\nto support the development and scaling of innovative climate solutions by 2030\n2\n. RBC aims to accelerate the deployment of capital to the emissions reduction efforts of clients in high-emitting, hard to-abate sectors that are producing the traditional energy the world still relies on. These important actions will lay the foundation to help our clients make progress on the journey to a net-zero future at an accelerated pace.\n\"Sustainability reporting has become table-stakes for businesses that want to work in global supply chains and attract top-tier talent. We are excited to work with RBC to help enable Canadian businesses to compete more effectively and expand their margins through sustainability data,\" said Sanders Lazier, CEO and co-founder of Carbonhound.\nFor more information about this collaboration and how RBC clients can benefit from Carbonhound's platform, please visit\nCommercial Sustainable Finance - RBC Royal Bank\n.\n__________________________________\n1\nStatements about the performance and the benefits of the Carbonhound platform are made by Carbonhound Inc. Royal Bank of Canada is not responsible for these statements.\n2\nFor purposes of identifying and tracking investment commitments eligible to count towards this goal and disclosing RBC's progress towards this goal, climate solutions are intended to include products and services that help mitigate the impacts of climate change and/or support the transition to net-zero. While RBC's approach may evolve over time, we intend to prioritize allocating capital toward solutions that will lead to GHG emissions reductions in Canada and globally. RBC's investment commitments eligible to count towards this goal may also include support for solutions with outcomes linked to biodiversity, nature and/or adaptation, such as those described in RBC's Sustainable Finance Framework, among others. RBC aspires to achieve this goal by 2030; however, market conditions, among other factors—many of which are beyond RBC's control and the effects of which can be difficult to predict—could impact our ability to invest capital to advance climate solutions over this timeframe. For purposes of tracking progress towards this goal, RBC's eligible investment commitments made from fiscal 2022 onward are included. For more information, please refer to the RBC Climate Report 2023 (available at rbc.com/esgreporting).\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout Carbonhound\nCarbonhound is a\nToronto\n-based climate software company providing verified carbon emissions reporting to companies around the world. Our platform is designed to automate and simplify climate reporting to help companies meet changing stakeholder and regulatory expectations, support decarbonization to stay ahead of their customers' requirements, and protect key accounts. Our platform makes it easy and affordable for businesses to take climate action. Learn more at\ncarbonhound.com\n.\nFor more information, please contact:\nLauren Ng\n, RBC Corporate Communications\nSOURCE RBC Royal Bank",
  "id": "125977",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}