{
  "title": "RBC and Pattison Food Group Launch More Rewards RBC Visa Credit Cards",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125976",
  "date": "Wed, 05 Feb 2025 09:59:00 -0500",
  "short_description": "The no annual fee More Rewards RBC Visa and More Rewards RBC Visa Infinite cards will accelerate grocery value and offer exclusive everyday savings to customers in Western Canada VANCOUVER, BC,...",
  "content": "The no annual fee More Rewards RBC\nVisa and More Rewards RBC\nVisa Infinite cards will accelerate grocery value and offer exclusive everyday savings to customers in\nWestern Canada\nVANCOUVER, BC\n,\nFeb. 5, 2025\n/CNW/ - Today, RBC and Pattison Food Group (PFG) announced the launch of two new credit cards: More Rewards RBC Visa and More Rewards RBC Visa Infinite. Cardholders who hold either of the no annual fee cards will earn points through\nMore Rewards\n, one of Western Canada's leading loyalty programs from Canada's largest Western-based provider of food and health products.\nMore Rewards RBC Visa or More Rewards RBC Visa Infinite cardholders can earn More Rewards points at over 700 participating partner locations, including Save-On-Foods, Quality Foods and Buy-Low Foods. They can also accelerate their More Rewards points earnings in popular everyday spending categories beyond grocery, including dining, gas and EV charging, in addition to earning More Rewards points everywhere else they shop.\n\"RBC is thrilled to partner with PFG, a food industry leader known for offering high quality grocery products to their customers, as we launch two new credit cards to market in\nWestern Canada\n,\" said\nVinita Savani\n, executive vice president, Cards & Loyalty, RBC. \"Both cards offer rich features and provide a seamless way to maximize savings on groceries, an area of spending that we know matters most to so many consumers. This meaningful addition to our cards portfolio further expands our grocery offering into\nWestern Canada\nand enables more of our clients to experience greater value on their everyday purchases.\"\n\"We are very proud and excited to introduce the new More Rewards RBC Visa and More Rewards RBC Visa Infinite cards to our customers across\nWestern Canada\n,\" said\nJamie Nelson\n, chief operating officer, Pattison Food Group. \"Now more than ever, Canadian shoppers are looking for the best value and we know our customers will love how quickly they can earn more points by using the More Rewards Visa to redeem on the things that matter to them like groceries, gift cards and travel!\"\nEnhanced Earning Power with More Rewards\nThe More Rewards RBC Visa and More Rewards RBC Visa Infinite cards will offer value in the following ways:\nMore Rewards RBC Visa\nCardholders will enjoy:\nNo annual fee*\n50,000 More Rewards bonus points (equivalent to\n$75\nin groceries at select More Rewards grocery partner locations)**\n5 More Rewards points per\n$1\nspent at over 700 More Rewards partner locations, including Save-On‑Foods, Quality Foods, Buy-Low Foods, and more*\n5 More Rewards points per\n$1\nspent on eligible dining, gas and EV charging purchases*\n3 More Rewards points per\n$1\nspent on all other purchases*\nMore Rewards RBC Visa Infinite\nCardholders will enjoy:\nNo annual fee (minimum personal or household income requirements apply)*\n50,000 More Rewards bonus points (equivalent to\n$75\nin groceries at select More Rewards grocery partner locations)**\n8 More Rewards points per\n$1\nspent at over 700 More Rewards partner locations, including Save-On‑Foods, Quality Foods, Buy-Low Foods, and more*\n8 More Rewards points per\n$1\nspent on eligible dining, gas and EV charging purchases*\n4 More Rewards points per\n$1\nspent on all other purchases*\nCardholders can redeem their More Rewards points for rewards like gift cards, groceries, travel and more. To view a full list of redemption options, visit\nmorerewards.ca/rewards\n.\nMore Savings with Avion Rewards\nIn addition, these new cardholders will benefit from RBC's\nAvion Rewards\n,\nCanada's\nlargest proprietary loyalty program, and its extensive partner network, including Petro-Canada. By linking their Petro-Points card with their More Rewards RBC Visa or More Rewards RBC Visa Infinite, they will save 3¢/L every time they fill up on gas at retail\nPetro-Canada\nlocations. They will also receive exclusive savings, perks and more through RBC Offers.\nThis launch is the first of many exciting ways that RBC and PFG will come together to provide more value to Canadians. Additional partnership details from More Rewards and Avion Rewards will be unveiled in the coming months.\nFor more information on the More Rewards RBC Visa or More Rewards RBC Visa Infinite cards, please visit\nrbc.com/morerewards\n.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout Avion Rewards\nAvion Rewards is an award-winning internationally recognized loyalty and consumer engagement platform that provides Canadians with the flexibility to shop, save, earn and redeem for everyday merchandise, aspirational rewards and experiences. Its exclusive shopping companion, Avion Rewards ShopPlus, enables members to access offers seamlessly, saving them time and money right where they shop online. Additionally, as one of the largest travel providers in Canada, Avion Rewards makes it possible for members to benefit from the program's market-leading \"any airline, any flight, any time\" travel offering, as well as its flagship Avion credit cards and concierge service. Learn more at\navionrewards.com\n.\nAbout More Rewards\nMore Rewards is one of Western Canada's favourite loyalty programs with more than 30 years in business and millions of active members. More Rewards provides customers the opportunity to easily earn points on everyday purchases and then redeem for rewards such as free travel, groceries, gift cards and more. With the More Rewards card, you can earn points during almost every grocery shop at Save-On-Foods, PriceSmart Foods, Buy-Low Foods, Nesters Market, Quality Foods and Urban Fare, in addition to hundreds of More Rewards partner locations such as Panago Pizza, Jim Pattison Auto Group, Speedy Glass, and more. Learn more at\nmorerewards.ca\n.\nAbout Pattison Food Group\nEstablished in 2021, the Pattison Food Group is a Jim Pattison business and Western Canada's leading provider of food and drugs. The Pattison Food Group includes Save-On-Foods, Buy-Low Foods, Quality Foods, Everything Wine, Pure Integrative Pharmacy, Imperial Distributors Canada Inc., and other Jim Pattison Group specialty and wholesale operations. Its businesses employ more than 30,000 team members in its nearly 300 food and drug retail locations and share a passion for giving back to the communities where they do business. Pattison Food Group businesses are leaders in customer service and innovation and are committed to achieving long-term growth.\n*Terms and conditions apply. For complete details, please visit\nrbc.com/morerewards\n.\n** Offer ends\nJune 25, 2025\n. Terms and conditions apply. For complete details, please visit\nrbc.com/morerewards\n.\nFor more information, please contact:\nJulia Miller\n, RBC Corporate Communications,\njulia.d.miller@rbc.com\n.\nPattison Food Group Media Relations, 778-366-3000,\nmediarelations@pattisonfoodgroup.com\nSOURCE RBC Royal Bank",
  "id": "125976",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}