{
  "title": "Royal Bank of Canada announces NVCC subordinated debenture issue",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125970",
  "date": "Wed, 22 Jan 2025 17:15:00 -0500",
  "short_description": "/NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES/ TORONTO, Jan. 22, 2025 /CNW/ - Royal Bank of Canada (TSX: RY) (NYSE: RY) today announced an offering of...",
  "content": "/NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN\nTHE UNITED STATES\n/\nTORONTO\n,\nJan. 22, 2025\n/CNW/ - Royal Bank of\nCanada\n(TSX: RY) (NYSE: RY) today announced an offering of\n$1.5 billion\nof non-viability contingent capital (NVCC) subordinated debentures (\"the Notes\") through its Canadian Medium Term Note Program.\nThe Notes bear interest at a fixed rate of 4.279 per cent per annum (paid semi-annually) until\nFebruary 4, 2030\nand at Daily Compounded CORRA plus 1.45 per cent thereafter until their maturity on\nFebruary 4, 2035\n(paid quarterly). The expected closing date is\nJanuary 29, 2025\n. RBC Capital Markets is acting as lead agent on the issue.\nThe bank may, at its option and with the prior approval of the Office of the Superintendent of Financial Institutions, redeem the Notes on or after\nFebruary 4, 2030\nat par, in whole at any time or in part from time to time, on not less than 30 days and not more than 60 days' notice to registered holders.\nNet proceeds from this transaction will be used for general business purposes.\nThe Notes have not been, and will not be, registered under the United States Securities Act of 1933, as amended (the \"Securities Act\"), or the securities laws of any state of\nthe United States\nand may not be offered, sold or delivered, directly or indirectly in\nthe United States\nor to, or for the account or benefit of, a \"U.S. person\" (as defined in Regulation S under the Securities Act), except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act. This press release does not constitute an offer to sell or a solicitation to buy securities in\nthe United States\nor in any other jurisdiction where such offer or solicitation would be unlawful.\nFor further information, please contact:\nInvestor Contact:\nAsim Imran\n, Investor Relations,\nasim.imran@rbc.com\n, 416-955-7804\nMedia contact:\nGillian McArdle\n, Financial Communications,\ngillian.mcardle@rbc.com\n, 416-842-4231\nSOURCE Royal Bank of\nCanada",
  "id": "125970",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}