{
  "title": "Decarbonizing Canada's electricity grids can generate significant economic benefit while also reducing emissions: RBC Climate Action Institute",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125968",
  "date": "Tue, 14 Jan 2025 09:31:00 -0500",
  "short_description": "Canada can make a significant dent in carbon emissions over the next decade by growing and decarbonizing the country's electricity grids, new research from the RBC Climate Action Institute finds....",
  "content": "RBC Climate Action Institute releases annual climate action report\nTORONTO\n,\nJan. 14, 2025\n/CNW/ - Canada can make a significant dent in carbon emissions over the next decade by growing and decarbonizing the country's electricity grids, new research from the RBC Climate Action Institute finds. Decarbonizing\nCanada's\nelectricity grids would reduce emissions, drive economic benefit, and contribute to energy security. Meanwhile, despite a combination of policy, capital and consumer action driving climate progress over the past five years, the pace of change is slowing. As we approach the 10\nth\nanniversary of the 2015 Paris Agreement, different models, and new paradigms for thinking about climate are critical if we are to make real progress.\nThese findings and more can be found in the RBC Climate Action Institute's annual report:\nClimate Action 2025: a year for rewiring\n. The research provides a unique perspective on\nCanada's\nclimate progress, including new survey and interview data that reveal how businesses and consumers are feeling about the state of climate progress in\nCanada\n. Informed by the Institute's team of researchers, Climate Action 2025: a year for rewiring questions whether\nCanada\nis on track to meet its climate commitments, while at the same time, highlighting bright-spots in several sectors.\n\"2025 is shaping up to be a year of climate uncertainty. Political change and economic frustration have challenged how businesses and governments are thinking about climate action, but these same forces also offer opportunities to advance our collective approaches in a new global reality,\"\n–\nJohn Stackhouse\n, SVP, Office of the CEO, RBC.\nSome of the key findings from this second annual assessment of Canadian climate action include:\nClimate action has nearly doubled in the last 5 years.\nAccording to the Institute's Climate Action Barometer, policy, capital and consumers have driven a near doubling of climate action in\nCanada\nover the past five years.\nCanada\nis not on course to meet its climate targets.\nEmissions fell by 0.8% in 2023, led by progress in the electricity sector. However, at this pace, government projections suggest that\nCanada\nwill not meet the targets in its 2030 Emission Reduction Plan until 2035.\nClimate investment is slowing.\nCleantech investments in heavy industry fell dramatically in 2024. Venture capital financing slowed to\n$158 million\nin the year, compared to a combined\n$650 million\non average in the previous two years, partly due to an overall global downturn in investment flows and faltering investor sentiment around cleantech.\nAlberta\nis at the forefront of Canadian climate action.\nAlberta's\nremoval of more than six megatonnes of coal-based emissions drove national electricity emissions lower by about 12%. The province is now coal-free—six years ahead of schedule.\nConcern over climate change is waning among Canadians\n. Approximately 14% of Canadians cited climate change as one of their top 3 concerns—compared to 26% in 2019. What will this mean for where climate will sit on the country's political agenda?\nCanadian businesses see themselves on the frontlines of climate action\n. According to our survey, over half of executives identified government subsidies (55%), internal funding (53%), and C-suite buy-in (50%) as the most significant factors for driving emissions reduction in their organizations.\nThis research by RBC's Climate Action Institute offers a comprehensive view of Canadian climate progress to date. The Institute surveyed 2,000 Canadians and 100 Canadian business leaders for their views on climate action, providing a unique perspective on how attitudes towards climate are evolving. The Institute also developed the Climate Action Barometer – a proprietary tool that combines industry scores for Policy, Capital, Action & Sentiment, Emissions and Technology to track economy-wide climate progress. Tying this in-depth research together, images throughout the report were the result of a\nCanada\n-wide photography program that highlights climate action on-the-ground, across the country.\nClimate Action 2025: a year for rewiring\nalso showcases several companies pursuing solutions for reducing emissions in a series of case studies. From Canada Nickel, a Canadian mining company finding new ways to sequester carbon as it extracts ore, to Semex, a Canadian agriculture company reducing methane emissions in dairy cattle – the report highlights the important, often behind the scenes ways that companies are helping\nCanada\nachieve its climate goals.\nRead the full Climate Action 2025 report.\nAbout the RBC Climate Action Institute (The Institute)\nThe Institute strives to bring together research insights and industry experts to help clients and communities apply climate solutions. The Institute has a three-part mandate:\nInform and inspire:\nLeverage RBC's thought leadership capabilities to inform policy and inspire action towards a net-zero future in\nCanada\n.\nEngage decision makers:\nHelp convene key stakeholders to discuss ideas and develop pragmatic climate solutions.\nFacilitate bold action:\nWork with industry partners to help clients and communities apply climate solutions.\nSince its launch in\nApril 2023\n, the Institute has published over twenty research papers on topics ranging from electricity regulations to mass timber. The Institute has engaged with governments, industries and community groups to share insights and ideas and its heard, and learned from, Canadians at the forefront of climate change. The Institute has also helped launch two groups—the Canadian Alliance for Net- Zero Agrifood and the Climate Smart Buildings Alliance—to help develop private sector strategies to reduce emissions. You can find out more about the Institute on\nthe Institute website.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nkyle.english@rbc.com\nSOURCE  RBC",
  "id": "125968",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}