{
  "title": "RBC Investor Services' Canadian DB pension plans return 1.6% over the quarter, capping year with solid 11.3%",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125974",
  "date": "Thu, 30 Jan 2025 08:31:00 -0500",
  "short_description": "RBC Investor Services (RBCIS) reports a positive median return of 1.6% for its clients' defined benefit (DB) pension plans over the fourth quarter of 2024 and closes the year with its strongest...",
  "content": "TORONTO\n,\nJan. 30, 2025\n/CNW/ - RBC Investor Services (RBCIS) reports a positive median return of 1.6% for its clients' defined benefit (DB) pension plans over the fourth quarter of 2024 and closes the year with its strongest yearly median return in five years at 11.3% for the period ending\nDecember 31, 2024\n. This analysis encompasses various RBCIS client plans across private and public sectors.\n\"Powered by healthy returns in the equity market, we are pleased to report our fourth consecutive positive quarter for RBCIS DB client plans for 2024,\" said Isabelle Tremblay, Asset Owner Segment Lead at RBC Investor Services.\nGlobal equities for RBCIS DB pension plans generated gains of 4.1% this quarter, led by U.S. equities whose returns were boosted by a rapid depreciation of the Canadian dollar versus the U.S. dollar. Over the quarter, the MSCI World Index returned 6.3%, led by the Consumer Discretionary (15.7%), Communication Services (13.6%) and Information Technology (11.4%) sectors. On a one-year basis, global equities for client plans returned 24.1%, while the MSCI World Index returned 29.4%, where the top performing sectors were Communication Services (46.0%), Information Technology (45.0%) and Financials (38.2%).\nCanadian equities for client plans underperformed their global counterparts, in part due to a smaller exposure to growth style stocks. They closed the quarter at 3.2% and the year at 21.2% aligning closely with the TSX Composite Index's 3.8% and 21.7% respectively. Top performing sectors for the TSX both this quarter and 2024 included Information Technology (22.2% quarterly and 38.0% annual return), Financials (6.6% quarterly and 30.1% annual return) and Energy (6.6% quarterly and 24.0% annual return).\nIn the Canadian fixed income asset class, RBCIS DB pension plans experienced a -0.2% loss for the quarter and 3.6% for the year, aligning with the FTSE Canada Universe Bond Index's -0.04% for Q4 and 4.2% for 2024. Over the year, the FTSE Canada Short Term Bond Index's annual return of 5.7% outperformed the FTSE Canada Long Term Bond Index's return of 1.4% as the market responded to the Bank of\nCanada's\nsubstantial interest rates reductions.\n\"Our analysis shows solid annual returns for RBCIS DB pension plans, but also emphasizes the need for diversification and active risk management, especially as we enter a year of uncertainty,\" added\nIsabelle Tremblay\n. \"Plan managers continue to adapt their strategies for the evolving pension landscape as we prepare for political changes, including possible U.S. government policies and new Canadian Prime Minister.\"\nABOUT RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout RBC Investor Services\nRBC Investor Services delivers investment servicing solutions to Canadian asset managers and asset owners, insurance providers, investment counsellors and global financial institutions. With more than 1,500 employees and offices across the globe, our focus is on safeguarding the assets of our clients and enabling their growth. Part of Royal Bank of\nCanada\n,\nCanada's\nlargest bank, RBC Investor Services has over\nC$2.6 trillion\nof assets under administration. Learn more at\nrbcis.com\n.\nMedia contact:\nBrianne Sommerville\n, RBC\nSOURCE RBC Investor Services",
  "id": "125974",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}