{
  "title": "RBC clients can now renew their mortgage in minutes through the RBC Mobile app",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125978",
  "date": "Thu, 13 Feb 2025 08:01:00 -0500",
  "short_description": "RBC is providing clients with more choice, convenience, and security in managing their mortgage TORONTO, Feb. 13, 2025 /CNW/ - RBC has made the mortgage renewal process easier and faster for...",
  "content": "RBC is providing clients with more choice, convenience, and security in managing their mortgage\nTORONTO\n,\nFeb. 13, 2025\n/CNW/ - RBC has made the mortgage renewal process easier and faster for clients through a new streamlined, self-serve option in the RBC Mobile app\n1\n. Now eligible clients can seamlessly and securely renew their RBC mortgage from wherever is most convenient for them. The news comes as the Canada Mortgage and Housing Corporation (CMHC) estimates the total amount of mortgage loans to be renewed over the course of 2024 and 2025 represents close to 40% of the Canadian economy\n2\n- a significant number of homeowners.\nClients who choose to renew through the RBC Mobile app will be able to secure their best RBC rate, choose among available mortgage terms that suit their situation, and virtually sign documents — all in a matter of minutes. Clients can also pause the process at any time to speak with an RBC Advisor if they require additional information before completing their renewal.\n\"We understand that renewing or applying for a mortgage can feel stressful for clients — which is something we're actively addressing,\" said\nJanet Boyle\n, senior vice president, Home Equity Finance, RBC. \"Today marks the latest stage in our evolution to provide digital and mobile services that enhance security and transparency in the mortgage journey, while offering clients more choice in how they want to manage their mortgage.\"\nIn the past, most renewals were processed by an RBC Advisor. This new option further simplifies the renewal process while still allowing clients to benefit from additional advice and guidance from RBC Advisors when they need it.\nMobile banking has become a daily digital habit for Canadians. On average, RBC's banking clients use the RBC Mobile app which ranked No. 1 in customer satisfaction in the J.D. Power 2024 Canada Banking Mobile App Satisfaction Study on an almost-daily basis. Compared to pre-pandemic levels, RBC has seen active mobile users increase by 69% and mobile sessions increase by 139%\n3\n.\n\"Our clients are increasingly seeking ways to engage with RBC digitally,\" said\nRami Thabet\n, senior vice president, Digital, RBC. \"The rapid increase in adoption and engagement in the RBC Mobile app demonstrates its vital role in providing clients with choice, convenience and secure banking solutions -which is why we're thrilled to simplify mortgage renewals for clients in our mobile app.\"\n__________________________________\n1\nRBC Online Banking is provided by Royal Bank of Canada. RBC Mobile is operated by Royal Bank of Canada, RBC Direct Investing Inc. and RBC Dominion Securities Inc.\n2\nhttps://www.cmhc-schl.gc.ca/blog/2023/rising-rates-homeowners-greatest-shocks-lie-ahead\n3\nhttps://www.rbc.com/investor-relations/_assets-custom/pdf/irdeck2024q4.pdf\nProviding a simpler, more secure way to apply for a mortgage\nFor Canadians who apply for an RBC mortgage, the bank has also introduced a new online platform which helps track and manage applications. Now an increasing number of RBC mortgage applicants can securely upload the sensitive financial documents required for a mortgage application in one location, track each stage of their application process, and connect with an RBC Mortgage Specialist at the click of a button. This helps reduce the need for lengthy email chains between advisor and client and reduces the risk of personal information from being intercepted by fraudsters if a client is using unsecure email.\nRBC's digital and mobile platforms have been evolving since the introduction of RBC Online Banking\n1\nin 1996. By continuing to provide new channels and capabilities, RBC is enabling clients to manage their banking in ways that are more convenient and suitable for them. Learn more at\nwww.rbcroyalbank.com/personal\n.\nFor more information on RBC mortgages, please visit:\nhttps://www.rbcroyalbank.com/mortgages/\n.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nLauren Della Vedova\n, Corporate Communications, RBC,\nlauren.dellavedova@rbc.com\nSOURCE RBC Royal Bank",
  "id": "125978",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}