{
  "title": "RBC and Cohere partner to develop the next generation of highly secure generative AI solutions for financial services",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125967",
  "date": "Thu, 09 Jan 2025 06:01:00 -0500",
  "short_description": "RBC (TSX: RY) (NYSE: RY) today announced it has partnered with Cohere, a leader in security and privacy-focused enterprise AI, to co-develop and securely deploy an enterprise generative AI (genAI)...",
  "content": "TORONTO\n,\nJan. 9, 2025\n/CNW/ - RBC (TSX: RY) (NYSE: RY) today announced it has partnered with\nCohere\n, a leader in security and privacy-focused enterprise AI, to co-develop and securely deploy an enterprise generative AI (genAI) solution optimized for financial services. The platform, called\nNorth for Banking\n, will integrate with RBC's and Cohere's own proprietary foundation models, as well as RBC's internal platforms with the goal to accelerate the development of genAI solutions at RBC securely and efficiently. This collaboration leverages the expertise of each organization to develop more accurate and verifiable models, with a focus on risk and security features to protect companies in the financial services industry.\n\"RBC is on a path to redefine what a bank is capable of, and AI will play an important role in our future success,\" said Dr. Foteini Agrafioti, senior vice president, RBC Borealis and chief science officer, RBC. \"With its globally recognized enterprise AI expertise, Cohere is an ideal partner for us as we build upon almost a decade of AI investment and a strong commitment to\nresponsible AI principles\n, to continue to innovate and harness the potential of genAI with our clients' safety and security at the forefront.\"\n\"We're excited to work with RBC to co-develop North for Banking, a customized version of our new secure AI workspace platform for the financial services industry,\" said\nIvan Zhang\n, a co-founder of Cohere, \"North for Banking will be an end-to-end AI solution that financial industry firms can seamlessly integrate to increase workforce productivity and operational efficiency. By prioritizing security and data privacy protections, companies can have peace of mind as they deploy it internally at scale.\"\n\"\nWe are already seeing the positive impact of genAI technology in applications we've put into production, including in our advice centre, where we are using this technology internally to support advisors to answer client questions faster and with greater detail, and in our Capital Markets business, where it's used to enhance productivity and streamline workflows of research analysts,\" says Agrafioti. \"Cohere is unique among its commercial peers in providing the level of flexibility and collaboration that we need to take the next step in our AI journey and increase productivity across the enterprise. We look forward to exploring deployment of this solution in various use cases over the next several months.\"\nRBC recently ranked #1 in\nCanada\nand third globally for artificial intelligence (AI) maturity among 50 global financial institutions in the\nEvident AI Index\n. The Index scores financial institutions across four key pillars: Talent, Innovation, Leadership and Transparency.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nLouise Armstrong\n, RBC Corporate Communications\nSOURCE RBC",
  "id": "125967",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}