{
  "title": "\"Financially paralyzed\": Higher costs have Canadians feeling unable to move forward - RBC poll",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125971",
  "date": "Thu, 23 Jan 2025 06:11:00 -0500",
  "short_description": "Finances are \"in a constant state of chaos\" Living \"bill to bill\", dipping into savings to help cover rising costs 2025's \"biggest financial risk\": Not enough money for unexpected expenses...",
  "content": "Finances are \"in a constant state of chaos\"\nLiving \"bill to bill\", dipping into savings to help cover rising costs\n2025's \"biggest financial risk\": Not enough money for unexpected expenses\nTORONTO\n,\nJan. 23, 2025\n/CNW/ - As higher costs continue to erode cash flow, over half (55%) of Canadians are describing themselves as financially paralyzed, with almost half (48%) reporting they can no longer maintain their standard of living and over one quarter (29%) admitting their finances are in a constant state of chaos.\nOther pressing concerns for Canadians surveyed by the\nRBC Financial Flexibility Poll – Winter Edition:\nBelieving they won't ever be able to get ahead financially (48%)\nNot finding it easy to think about their financial future when they are struggling to handle their day-to-day expenses (47%)\nWorrying that it's not a matter of if, but when they'll run out of money to live comfortably (44%)\nFeeling they are already over the edge financially (18%)\n\"As financial flexibility continues to erode, it's not surprising to hear that Canadians are feeling anxious and uncertain about what steps they can take to try to find their footing again,\" said\nCraig Bannon\n, director, Regional Financial Planning Support, RBC. \"If this was a medical health issue, you would seek out the expertise of a medical professional. We're advising Canadians to use the same approach for their financial health and lean into the expertise of an advisor.\"\nAdditional anxieties raised by Canadians in responses to the RBC poll:\nHalf (50%) are spending all their income on essential bills and expenses\nAlmost half are living \"bill to bill\" and that they have dipped into their emergency fund or retirement savings, to help cope with rising costs (47% each)\nOver one quarter (27%) are taking on debt to cover monthly basic needs\nAlmost a quarter (23%) have asked family for money or moved in with relatives to make ends meet\nWith finances stretched thin, Canadians are also expressing apprehension about their ability to handle any unplanned costs. A majority (60%) are worried they don't have enough money to cover unexpected expenses today, with 44% saying this is their biggest financial risk over the next year.\nAll the more reason to speak with an advisor, added Bannon. \"We have over 12,000 advisors across the country who can meet with you – in one of our bank branches, online or over the phone – to help you explore solutions you may not even know are possible, including options for managing debt and ongoing expenses, as well as dealing with unexpected financial hardships.\"\nTo help Canadians rebuild a strong financial foundation and take control of their long-term financial wellbeing, RBC makes a vast array of financial advice and expertise freely available to Canadians on its\nMy Money Matters\ndigital hub. To check out the content, resources and tools available, please visit\nrbcroyalbank.com/en-ca/my-money-matters\n.\nFast Facts:\nRBC Financial Flexibility Poll – Winter Edition\nSelected Findings – National, Regional and Gender\nRESPONSE\nCAN\nBC\nAB\nSK/MB\nON\nQC\nAC\nM\nF\nI feel financially paralyzed due to rising costs\n55 %\n59 %\n55 %\n56 %\n54 %\n47 %\n73 %\n50 %\n59 %\nI can't maintain my standard of living due to rising costs\n48 %\n53 %\n49 %\n46 %\n48 %\n42 %\n61 %\n46 %\n50 %\nMy finances are in a constant state of chaos\n29 %\n32 %\n28 %\n31 %\n32 %\n24 %\n32 %\n28 %\n31 %\nI don't believe I'll ever be able to get ahead financially\n48 %\n57 %\n51 %\n52 %\n50 %\n33 %\n62 %\n44 %\n52 %\nNot easy to think about financial future when struggling to handle my day-to-day expenses\n47 %\n48 %\n53 %\n54 %\n45 %\n40 %\n59 %\n43 %\n51 %\nI'm worried it's not a matter of if, but when I'll run out of money to live comfortably\n44 %\n46 %\n45 %\n43 %\n45 %\n43 %\n42 %\n40 %\n48 %\nI feel I'm already over the edge financially\n18 %\n22 %\n15 %\n23 %\n16 %\n18 %\n18 %\n14 %\n21 %\nI'm spending all my income on essential bills and expenses\n50 %\n54 %\n47 %\n55 %\n51 %\n43 %\n64 %\n46 %\n55 %\nI'm living bill to bill\n47 %\n47 %\n51 %\n50 %\n49 %\n38 %\n57 %\n42 %\n53 %\nTo help cope with rising costs, I've dipped into my emergency fund or retirement savings\n47 %\n50 %\n52 %\n56 %\n47 %\n40 %\n54 %\n45 %\n50 %\nI'm taking on debt to cover monthly basic needs\n27 %\n29 %\n26 %\n33 %\n26 %\n23 %\n36 %\n24 %\n30 %\nI've had to ask family for money or move in with relatives to make ends meet\n23 %\n29 %\n27 %\n24 %\n24 %\n17 %\n24 %\n22 %\n25 %\nI'm worried I don't have enough money to cover unexpected expenses today\n60 %\n60 %\n62 %\n66 %\n60 %\n53 %\n67 %\n54 %\n65 %\nMy biggest financial risk over next year is not being able to cover unexpected expenses\n44 %\n46 %\n50 %\n52 %\n44 %\n36 %\n56 %\n41 %\n48 %\nFast Facts:\nRBC Financial Flexibility Poll – Winter Edition\nSelected Findings – Generations\nRESPONSE\nCAN\nMillennials\n(aged 29-44)\nGen X\n(aged 45-60)\nBoomers\n(aged 61-70)\nI feel financially paralyzed due to rising costs\n55 %\n63 %\n55 %\n46 %\nI can't maintain my standard of living due to rising costs\n48 %\n56 %\n50 %\n44 %\nMy finances are in a constant state of chaos\n29 %\n35 %\n35 %\n16 %\nI don't believe I'll ever be able to get ahead financially\n48 %\n55 %\n49 %\n44 %\nNot easy to think about financial future when struggling to handle my day-to-day expenses\n47 %\n57 %\n48 %\n34 %\nI'm worried it's not a matter of if, but when I'll run out of money to live comfortably\n44 %\n45 %\n49 %\n44 %\nI feel I'm already over the edge financially\n18 %\n21 %\n22 %\n11 %\nI'm spending all my income on essential bills and expenses\n50 %\n57 %\n52 %\n44 %\nI'm living bill to bill\n47 %\n56 %\n50 %\n38 %\nTo help cope with rising costs, I've dipped into my emergency fund or retirement savings\n47 %\n54 %\n46 %\n44 %\nI'm taking on debt to cover monthly basic needs\n27 %\n33 %\n32 %\n19 %\nI have had to ask family for money or move in with relatives to make ends meet\n23 %\n35 %\n19 %\n7 %\nI'm worried I don't have enough money to cover unexpected expenses today\n60 %\n69 %\n64 %\n48 %\nMy biggest financial risk over next year is not being able to cover unexpected expenses\n44 %\n50 %\n49 %\n37 %\nDisclaimer\nFinancial planning services and investment advice are provided by Royal Mutual Funds Inc. (RMFI). RMFI, RBC Global Asset Management Inc., Royal Bank of\nCanada\n, Royal Trust Corporation of\nCanada\nand The Royal Trust Company are separate corporate entities which are affiliated. RMFI is licensed as a financial services firm in the province of\nQuebec\n.\nAbout the\nRBC\nFinancial Flexibility Poll – Winter Edition\nFrom\nNovember 1 to November 5, 2024\n, an online survey was commissioned by RBC among a representative sample of 1,515 Canadian adults (aged 18+), balanced and weighted on age, gender, region and education according to the latest census data. All respondents were members of the online Angus Reid Forum. For comparison purposes only, a sample of this size would yield a margin of error of ± 2.5 percentage points at a 95% confidence level.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nMedia contact:\nKathy Bevan\n, RBC Corporate Communications, 647-618-2287\nSOURCE RBC Royal Bank",
  "id": "125971",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}