{
  "title": "Investing in ourselves: Canadians' quest for financial independence - RBC poll",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125990",
  "date": "Wed, 19 Mar 2025 06:11:00 -0400",
  "short_description": "Volatile markets causing concerns Investors encouraged to avoid making reactive decisions Key advice: Stick to your plan, focus on what matters most TORONTO, March 19, 2025 /CNW/ - Canadians are...",
  "content": "Volatile markets causing concerns\nInvestors encouraged to avoid making reactive decisions\nKey advice: Stick to your plan, focus on what matters most\nTORONTO\n,\nMarch 19, 2025\n/CNW/ - Canadians are looking to investments to help them become financially independent, but are worried about the potential impact of ongoing market turbulence on their ability to build enough savings to reach this goal.\nAccording to the annual\nRBC Financial Independence Poll\n, Canadians estimate they will need approximately\n$846,437\nto ensure an independent financial future – notably higher for respondents living in\nAlberta\n($928,179)\n,\nSaskatchewan\n/\nManitoba\n($958,535)\nand\nOntario\n($916,714)\nas well as Gen X\n($1,128,990)\nand Millennials\n($945,748)\nacross the country. To help themselves get there, 49% of all respondents invested during 2024, including 49% of Gen X and 46% of Millennials.\nAt the same time, almost half (48%) of all respondents agreed their key investing concern is market volatility and investment performance – with 54% of Millennials and 46% of Gen X sharing these same worries.\n\"We're having conversations with investors who have a lot of questions amidst all the uncertainty right now. While it can be difficult to provide clear answers, our advisors have experienced decades of supporting clients during market ups and downs and one thing remains constant: the value of having – and sticking to – a good financial plan with a long-term approach, to help get through any periods of turmoil,\" advised\nCraig Bannon\n, Director, Regional Financial Planning Support, RBC.\nThe poll findings also indicated that just over half (51%) of Canadians now have a financial plan (formal or informal). This includes 50% of Millennials and 44% of Gen X, who responded that having this plan made them feel 'confident' (42% and 38% respectively) and 'reassured' (30% and 35%).\n\"It's hard to put a value on the confidence and reassurance that financial plans are bringing to Canadians right now – especially when those plans are supported by the expertise of an advisor,\" noted Bannon. \"A good financial plan maps out an investment strategy for you to follow. An advisor can help you stay true to your strategy, muting market noise and discussing any financial worries you may have, so you can remain focused on what truly matters: the financial goals you ultimately want your investments to achieve.\"\nA conversation with an advisor can also be helpful for anyone who has available funds they have not yet invested – including any cash deposits they made to meet contribution deadlines for RRSP and TFSA accounts.\n\"If you have money that is sitting on the sidelines, waiting for the ideal moment to invest, you could be missing out on opportunities to get the growth you're hoping for,\" added Bannon. \"This is where\ntime in\nthe market, rather than\ntiming\nthe market, is important. The sooner you can invest and the longer you can be invested, the greater the opportunities to benefit from the gradual growth that markets and economies can experience over the long term.\"\nRBC advice and resources:\nAnyone can freely access RBC's comprehensive\nMy Money Matters\nonline advice and resources hub. To learn more about financial planning at RBC and to connect with one of our advisors, please visit\nRBC Financial Planning\n. RBC clients can also access\nMyAdvisor\n– a digital advice platform which has now connected 4.7 million Canadians to their personalized plan, with the ability to adjust those plans in real time and connect with an advisor via video chat, online banking or in person.\nFast Facts:\nRBC Financial Independence Poll\nSelected Findings – Generations\nRESPONSE\nCAN\nMillennials\n(aged 29-44)\nGen X\n(aged 45-60)\nBoomers\n(aged 61-70)\n$ to be financial independent\n$846,437\n$945,748\n$1,128,990\n$777,931\nInvested during 2024…\n49 %\n46 %\n49 %\n52 %\n…in mutual funds\n24 %\n21 %\n28 %\n29 %\n…in stocks\n20 %\n22 %\n20 %\n18 %\n…in GICs/term investments\n21 %\n15 %\n20 %\n31 %\n…in pension plan\n16 %\n15 %\n22 %\n16 %\n…in ETFs\n10 %\n11 %\n13 %\n8 %\n…in cryptocurrency (e.g., bitcoin)\n5 %\n8 %\n4 %\n1 %\nKey concern about investing: market volatility and investment performance\n48 %\n54 %\n46 %\n43 %\nFinancial goal is to achieve financial independence\n41 %\n43 %\n38 %\n40 %\nWill achieve financial independence in my lifetime\n55 %\n55 %\n48 %\n53 %\nHave a financial plan…\n51 %\n50 %\n44 %\n54 %\n…and my plan makes me feel confident\n41 %\n42 %\n38 %\n44 %\n…and my plan makes me feel reassured\n36 %\n30 %\n35 %\n45 %\nFast Facts:\nRBC Financial Independence Poll\nSelected Findings – National & Regional\nRESPONSE\nCAN\nBC\nAB\nSK/MB\nON\nQC\nAC\n$ to be financial independent\n$846,437\n$877,503\n$928,179\n$958,535\n$916,714\n$616,954\n$851,157\nInvested during 2024…\n49 %\n51 %\n59 %\n46 %\n53 %\n38 %\n38 %\n…in mutual funds\n24 %\n26 %\n34 %\n24 %\n26 %\n16 %\n22 %\n…in stocks\n20 %\n21 %\n28 %\n17 %\n24 %\n13 %\n9 %\n…in GICs/term investments\n21 %\n26 %\n25 %\n22 %\n21 %\n16 %\n18 %\n…in pension plan\n16 %\n9 %\n12 %\n21 %\n15 %\n24 %\n13 %\n…in ETFs\n10 %\n9 %\n15 %\n5 %\n13 %\n7 %\n4 %\n…in cryptocurrency\n(e.g., bitcoin)\n5 %\n2 %\n9 %\n3 %\n6 %\n2 %\n3 %\nKey concern about investing: market volatility and investment performance\n48 %\n46 %\n55 %\n46 %\n50 %\n43 %\n45 %\nFinancial goal is to achieve financial independence\n41 %\n42 %\n35 %\n36 %\n43 %\n42 %\n38 %\nWill achieve financial independence in my lifetime\n55 %\n55 %\n54 %\n49 %\n57 %\n54 %\n47 %\nHave a financial plan…\n51 %\n53 %\n57 %\n55 %\n51 %\n45 %\n44 %\n… and my plan makes me feel confident\n41 %\n49 %\n36 %\n38 %\n39 %\n47 %\n39 %\n… and my plan makes me feel reassured\n36 %\n40 %\n40 %\n33 %\n35 %\n35 %\n32 %\nDisclaimer\nFinancial planning services and investment advice are provided by Royal Mutual Funds Inc. (RMFI). RMFI, RBC Global Asset Management Inc., Royal Bank of\nCanada\n, Royal Trust Corporation of\nCanada\nand The Royal Trust Company are separate corporate entities which are affiliated. RMFI is licensed as a financial services firm in the province of\nQuebec\n.\nAbout the 2025 RBC Financial Independence Poll\nThe 34th annual RBC Financial Independence Poll was conducted by Ipsos through online interviews with 2,000 Canadians aged 18+. Data was collected between\nOctober 4 to 11, 2024\n. Quota sampling and weighting was employed in order to balance demographics and ensure that the sample's composition reflects that of the actual population of Canadians, according to Census data. The precision of online polls is measured using credibility interval. In this case, the results are accurate to within ± 2.5 percentage points, 19 times out of 20, of what the results would have been had the entire population of adults in\nCanada\nbeen surveyed. Credibility intervals will be wider for smaller subsets of the population. Where appropriate, attitudes and opinions are tracked back to previous years' polls. Angus Reid Forum. For comparison purposes only, a sample of this size would yield a margin of error of ± 2.5 percentage points at a 95% confidence level.\nAbout RBC and our unique\nMyAdvisor\npersonalized planning support\nMyAdvisor\n– a digital advice platform only available at RBC – has now connected 4.7 million Canadians to their personalized plan and the ability to adjust those plans in real time. Complementing RBC's extensive Financial Advice and Planning services,\nMyAdvisor\noffers a hybrid approach, so you don't have to choose between digital or human – you get both. Along with 24/7 digital access to your plan, cash flow, net worth and goals, you receive insights, real-time visuals and forecasts to help stay on top of your money and reach your goals.\nMyAdvisor\nalso connects you to an RBC advisor in your community, via live video, phone or in-person within a branch. Through interactive scenario planning, you can see the potential future impact of today's money decisions on tomorrow's outcome. Whether you're planning for retirement, saving for your first home, or somewhere in between, we can help. For more information, please check out\nMyAdvisor\n.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nMedia contact:\nKathy Bevan\n, RBC Corporate Communications, 647-618-2287\nSOURCE RBC Royal Bank",
  "id": "125990",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}