{
  "title": "RBC announces over C$1 million donation and new employee matching program to support disaster and humanitarian relief efforts",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125979",
  "date": "Thu, 20 Feb 2025 09:05:00 -0500",
  "short_description": "RBC’s new approach will help enhance community readiness and resilience efforts while increasing giving opportunities for employees TORONTO, Feb. 20, 2025 — RBC today announced a new, global...",
  "content": "RBC’s new approach will help enhance community readiness and resilience efforts while increasing giving opportunities for employees\nTORONTO, Feb. 20, 2025\n— RBC today announced a new, global approach to supporting disaster and humanitarian relief efforts which includes donations from RBC and RBC Foundation totalling over C$1 million* to several global aid organizations this year, as well as a new employee donation matching program.\nThe donations will support the following Red Cross organizations to help enhance and expedite disaster preparedness and response efforts in the event of emergencies:\nCanadian Red Cross - Disaster Response Alliance\nAmerican Red Cross - Disaster Responder Program\nBritish Red Cross - UK Emergency Response\nCanadian Red Cross - International Programs Fund\n“In the event of emergencies, aid organizations must have critical systems and resources in place to mobilize quickly and deliver relief when it is needed most,” said Andrea Barrack, SVP, Sustainability & Impact, RBC. “This proactive donation will support these organizations to expand their capacity to respond to emergencies and continue to build resilient communities across the globe.”\nIn addition to this donation, today, RBC launched an internal enterprise-wide employee matching program in which RBC will match the personal donations of employees to eligible relief organizations up to $100 in their local currency per year.\n“We’re proud to provide more than 98,000 colleagues across 29 countries with the opportunity to support the causes they care about,” said Barrack. “Our new employee donation matching program will further increase the impact of colleagues who want to help communities in times of need.”\nRBC, with the RBC Foundation in Canada and the U.S., are proud to be making a commitment of\n$2 billion in community investments by 2035\n. These donations are part of this commitment.\nRBC has a long-standing history of supporting a broad range of community initiatives through donations, employee volunteer activities and community investments, including support for disaster and humanitarian relief efforts. Our community investment approach is flexible and adapts to the evolving needs of the communities where we live and work. To learn more, visit\nrbc.com/peopleandplanet\n.\nAbout RBC\nRoyal Bank of Canada is a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As Canada’s biggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in Canada, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout RBC Foundation\nRBC Foundation is a Canadian Registered Charity and Private Foundation. Solely funded by RBC, RBC Foundation provides donations exclusively from RBC’s annual earnings, not from third-party or client donations.\nFor more information, please contact:\nEma Asler\n, RBC Communications\n* These donations include a C$363,700 donation to the American Red Cross (ARC) Disaster Responder Program which was announced as part of RBC’s support for wildfire relief efforts in Southern California in January 2025. The exact donation amount is $1,143,990.",
  "id": "125979",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "press_release",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}