{
  "title": "City National Bank and RBC announce $3 million donation to support wildfire relief efforts in Southern California",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125969",
  "date": "Wed, 15 Jan 2025 14:15:00 -0500",
  "short_description": "Royal Bank of Canada (RBC), together with City National Bank, announced they are donating US$3 million to support victims of the devastating wildfires in Southern California. This donation...",
  "content": "LOS ANGELES\n,\nTORONTO\n,\nNEW YORK\n, and\nMINNEAPOLIS\n,\nJan. 15, 2025\n/CNW/ - Royal Bank of\nCanada\n(RBC), together with City National Bank, announced they are donating\nUS$3 million\nto support victims of the devastating wildfires in\nSouthern California\n.\nThis donation includes contributions from City National Bank, RBC and RBC Foundation\nUSA\nto support the American Red Cross, Community Build Inc., Entertainment Industry Foundation, International Medical Corps, Neighborhood Housing Services Los Angeles County, United Way of\nGreater Los Angeles\n, West Angeles Community Development Corporation, World Central Kitchen and YMCA of Metro Los Angeles. As part of this commitment, RBC is contributing\n$250,000\nto the American Red Cross (ARC) Disaster Responder Program, which helps the ARC have the critical systems and supplies in place to respond immediately to disasters.\n\"Our thoughts are with the tens of thousands of families that have been impacted, including clients, colleagues and their loved ones, and the response teams working tirelessly to battle the fires and provide relief,\" said\nDave McKay\n, president and CEO, RBC. \"We will continue to closely monitor the situation and prioritize the safety of our colleagues while supporting our clients during this devastating time.\"\n\"As the largest bank headquartered in\nLos Angeles\n, this tragedy is deeply personal for us. Our clients, colleagues and communities are suffering unimaginable devastation,\" said\nHoward Hammond\n, president and CEO of City National Bank. \"We know we have an important role to play in helping address both the immediate needs in the wake of these fires as well as in the long-term work to rebuild.\"\nCity National is also working closely with impacted clients to assess their individual needs during this time. Additional information is available at\ncnb.com/disaster\n.\nIn addition to external contributions, RBC and City National are committed to supporting their employees affected by the fires through a broad range of assistance programs – including tax-free grants through the City National Colleague Fund and a newly introduced Immediate Response Program to address immediate expense needs. Both banks have also launched internal donation campaigns, providing employees with the opportunity to contribute directly to critical relief efforts.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout City National\nCity National Bank, a subsidiary of Royal Bank of\nCanada\n, is the largest bank headquartered in\nLos Angeles\nwith\n$94 billion\nin assets as of\nOctober 31, 2024\n. Founded in 1954, City National provides personalized banking, investment and trust services in select markets including\nLos Angeles\n,\nOrange County\n,\nSan Diego\n, the\nSan Francisco Bay Area\n,\nNew York City\n,\nNashville\n,\nAtlanta, Delaware\n,\nLas Vegas\n,\nWashington D.C.\nand\nMiami\n.* In addition, the company and its investment affiliates manage or administer\n$103 billion\nin client investment assets. City National is dedicated to strengthening communities, and in 2023 alone, the company made more than\n$11 million\nin charitable contributions to nonprofits that support the communities it serves.\nFor more information about City National, visit the company's website at\ncnb.com\n.\n*City National Bank does business in\nMiami\nand the state of\nFlorida\nas CN Bank.\nFor more information, please contact:\nAndré Roberts\n, RBC, Corporate Communications\nSierra Wilson\n, City National Bank, Corporate Communications\nSOURCE RBC",
  "id": "125969",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}