{
  "title": "RBC launches 10th season of RBC Training Ground and renews long-standing partnership with Canadian Olympic Committee",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125972",
  "date": "Wed, 29 Jan 2025 09:06:00 -0500",
  "short_description": "RBC Training Ground will deepen its commitment to inclusion in sport through new program updates TORONTO, Jan. 29, 2025 /CNW/ - Today, RBC launched the 10th season of RBC Training Ground, a...",
  "content": "RBC Training Ground will deepen its commitment to inclusion in sport through new program updates\nTORONTO\n,\nJan. 29, 2025\n/CNW/ - Today, RBC launched the 10\nth\nseason of\nRBC Training Ground\n, a nationwide Olympic talent search program that has experienced nearly a decade of unparalleled success. In 2025, RBC Training Ground will host 20 free qualifying events across the country, welcome new sport partners, provide more funding support for athletes and implement program updates designed to provide greater access to high-performance sport for athletes from a wide range of backgrounds.\nRBC and the Canadian Olympic Committee (COC) also announced today the renewal of their 78-year long partnership – continuing to make it the longest-standing partnership in the COC's history. The eight-year extension is anchored by RBC Training Ground as well as the legacy\nRBC Olympians\nprogram, which has helped hundreds of current and retired Olympians and Para athletes succeed in their athletic careers and in life after sport.\n\"RBC Training Ground has always been committed to breaking down barriers and ensuring young athletes across\nCanada\nhave fairer and more inclusive opportunities to participate in sport,\" said\nShannon Cole\n, chief brand officer, RBC. \"These meaningful new program updates will help make chasing Olympic dreams more accessible for all athletes across\nCanada\n. We look forward to continuing our partnership with the COC and working alongside our sports partners to find and fund the next generation of Team Canada athletes.\"\nSince its inception in 2016, RBC Training Ground has helped 21 program alumni reach the Olympic Games, 12 of whom have brought home medals for Team Canada. Most recently, 16 program alumni were named to Team Canada for the\nParis\n2024 Olympic Games.\n\"Through this partnership, we at the COC have had the pleasure of witnessing the incredible impact RBC Training Ground has had on scouting and supporting future Olympic talent,\" said\nJacqueline Ryan\n, chief brand and commercial officer, Canadian Olympic Committee and chief executive officer, Canadian Olympic Foundation. \"We are thrilled to continue our partnership with RBC, our longest-standing corporate supporter, as we collaborate on vital programs and initiatives, such as RBC Training Ground, to help power the future of Team Canada.\"\nThe following RBC Training Ground program updates will be implemented in 2025 and were informed in part by a research study published earlier this month,\nFair Play: Understanding the Current State of Racial Inclusion in Canadian High Performance Sport\n, conducted by Wasserman and Sport Information Resource Centre, and co-funded by RBC Foundation and the Canadian Olympic Foundation. They will help address key findings of the research study by improving access, removing financial barriers and enhancing representation to better reflect the diversity in\nCanada's\ncommunities – ensuring that all athletes who want to participate in sport have the opportunity to compete.\nRBC Training Ground Athlete Accelerator\n– a new funding and support opportunity for RBC Training Ground participants facing financial barriers to high-performance sport. In addition to funding, recipients will receive educational development, mentorship support and financial literacy resources. All eligible athletes are able to apply following participation at a 2025 qualifying event. Recipients will be selected on an ongoing basis. For more information, visit the RBC Training Ground website.\nRBC Training Ground Women's Hour\n– an optional, scheduled participation timeslot at all RBC Training Ground qualifying events reserved for women. Athletes will be able to select this option during the registration process. This program update provides women with the option to compete in an environment that may feel more comfortable for them.\nRBC Training Ground Inclusion Council\n– a council to help further advance RBC Training Ground's commitment to providing fair and inclusive opportunities for all athletes. Members will include representatives from the Canadian Olympic Committee, RBC, National Sport Organizations (NSO), former athletes and other industry leaders focused on inclusion.\nExpanding program access to more communities\n– program schedule to include new qualifying events (i.e., in\nYellowknife\n, N.W.T and\nWindsor, ON\n) intended to reach talent who have not always had the same access to participate (e.g., Indigenous and racialized communities, geographically isolated groups, among others).\nAt RBC Training Ground's free qualifying events, athletes aged 14-25 compete in speed, strength, power and endurance testing in front of National Sport Organizations partners. This year, the program welcomes two new NSO partners, Biathlon Canada and Field Hockey Canada, as well as returning NSO Ski Jumping Canada back for its second year with the program. RBC Training Ground is proud to have a total of 15 partner sports for the 2025 season. The Top 100 athletes from qualifiers will advance to the National Final and up to 35 RBC Future Olympians will receive funding and resources to further develop in their sport, an increase in total funded athletes from previous years. For details on how to register for RBC Training Ground and for more information, visit\nRBCTrainingGround.ca\n.\nRBC Training Ground was developed in partnership with the Canadian Olympic Committee and Canadian Olympic Foundation, with support from the Canadian Olympic and Paralympic Sport Institute Network. Since its inception in 2016, RBC Training Ground has tested over 16,000 athletes across\nCanada\n, with more than 3,000 athletes being identified by NSOs as having Olympic potential – many in a sport they had never considered.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout the Canadian Olympic Committee\nThe Canadian Olympic Committee's purpose is to transform\nCanada\nthrough the power of sport.\nWe do this by leading the achievement of Team Canada's podium success and advancing Olympic values across\nCanada\n. Through the Team Canada Impact Agenda and together with our partners, the COC is committed to making sport safe, inclusive and barrier-free so more young people can play and stay in sport. Learn more at\nolympic.ca\n.\nFor more information, please contact:\nEma Asler, RBC Communications,\nema.asler@rbc.com\nPeter Saltsman\n, Canadian Olympic Committee Communications,\npsaltsman@olympic.ca\n, 647-382-6986\nSOURCE RBC",
  "id": "125972",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}