{
  "title": "Royal Bank of Canada Management Proxy Circular Now Available",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125984",
  "date": "Thu, 06 Mar 2025 14:30:00 -0500",
  "short_description": "Royal Bank of Canada (TSX: RY) (NYSE: RY) today announced it has filed its notice of annual and special meeting of common shareholders and management proxy circular for 2025 with securities...",
  "content": "TORONTO\n,\nMarch 6, 2025\n/CNW/ - Royal Bank of\nCanada\n(TSX: RY) (NYSE: RY) today announced it has filed its notice of annual and special meeting of common shareholders and management proxy circular for 2025 with securities regulators.\nThe circular contains information about RBC's annual and special meeting, which is scheduled to occur on\nApril 10, 2025\n, including (i) the election of directors, (ii) the appointment of the bank's auditor, (iii) the approval of certain amendments to the bank's stock option plan and (iv) approval of an amendment to by-law two regarding increasing the maximum aggregate board compensation amount. ‎It also contains a detailed description of the board's assessment of the performance of RBC named executive officers for fiscal 2024 and related compensation decisions.\nRBC is using notice-and-access to deliver the circular and the 2024 annual report to its shareholders. These documents can be found online on our\nwebsite\n; the website of our transfer agent,\nComputershare Trust Company of\nCanada\n;\nSEDAR+\n; and\nEDGAR\n. Shareholders may also request a paper copy of these documents as indicated in the circular and in the notice of availability of meeting materials, which will be mailed to shareholders.\nWe encourage shareholders and those interested in RBC's annual and special meeting to visit our website at\nrbc.com/annualmeetings\nin advance of the meeting for the most current information about attending the meeting.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 19 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.‎\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nInvestor Contact:\nAsim Imran\n, Investor Relations,\nasim.imran@rbc.com\nMedia Contact:\nSharon Wilks\n, RBC Corporate Communications,\nsharon.wilks@rbc.com\nSOURCE  Royal Bank of\nCanada",
  "id": "125984",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}