{
  "title": "Royal Bank of Canada to host Investor Day",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125966",
  "date": "Tue, 07 Jan 2025 08:00:00 -0500",
  "short_description": "Royal Bank of Canada (TSX: RY) (NYSE: RY) will host an Investor Day on Thursday, March 27, 2025, with presentations given by Dave McKay, president and chief executive officer, and members of the...",
  "content": "TORONTO\n,\nJan. 7, 2025\n/CNW/ - Royal Bank of\nCanada\n(TSX: RY) (NYSE: RY) will host an Investor Day on\nThursday, March 27, 2025\n, with presentations given by\nDave McKay\n, president and chief executive officer, and members of the executive management team.\nA live webcast and presentation slides will be posted on the day of the event to\nhttps://www.rbc.com/investor-relations/events-and-presentations.html\n. Dial-in information and a more detailed agenda will be provided at a later date.\nAbout RBC\nRoyal Bank of\nCanada\nis a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As\nCanada's\nbiggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 18 million clients in\nCanada\n, the U.S. and 27 other countries. Learn more at\nrbc.com\n.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nFor more information, please contact:\nInvestor contact:\nAsim Imran\n, Investor Relations,\nasim.imran@rbc.com\n, 416-955-7804\nMedia contact:\nGillian McArdle\n, Financial Communications,\ngillian.mcardle@rbc.com\n, 416-842-4231\nSOURCE Royal Bank of\nCanada",
  "id": "125966",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}