{
  "title": "ROYAL BANK OF CANADA REPORTS FIRST QUARTER 2025 RESULTS",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=125982",
  "date": "Thu, 27 Feb 2025 06:00:00 -0500",
  "short_description": "All amounts are in Canadian dollars and are based on financial statements presented in compliance with International Accounting Standard 34 Interim Financial Reporting, unless otherwise noted. Our...",
  "content": "All amounts are in Canadian dollars and are based on financial statements presented in compliance with International Accounting Standard 34\nInterim Financial Reporting\n, unless otherwise noted. Our Q1 2025 Report to Shareholders and Supplementary Financial Information are available at\nhttp://www.rbc.com/investorrelations\nand on\nhttps://www.sedarplus.com/\n.\nNet income\n$5.1 Billion\nUp 43% YoY\nDiluted EPS\n1\n$3.54\nUp 43% YoY\nTotal PCL\n1\n$1,050 Million\nPCL on loans ratio\n1\nup 7 bps\n1\nQoQ\nROE\n1\n16.8%\nU\np from 370 bps YoY\nCET1 ratio\n2\n13.2%\nAbove regulatory requirements\nAdjusted net income\n3\n$5.3 Billion\nUp 29% YoY\n2024 Adjusted EPS\n3\n$3.62\nUp 27% YoY\nTotal ACL\n1\n$6.9 Billion\nACL on loans ratio\n1\nup 4 bp QoQ\nAdjusted ROE\n3\n17.2%\nUp 230 bps\nYoY\nLCR\n4\n128%\nUnchanged from 128%\nlast quarter\nTORONTO, February 27, 2025\n— Royal Bank of Canada\n5\n(RY on TSX and NYSE) today reported record net income of $5.1 billion for the quarter ended January 31, 2025, up $1.5 billion or 43% from the prior year. Diluted EPS was $3.54, up 42% over the same period, reflecting growth across each of our business segments. The inclusion of HSBC Bank Canada (HSBC Canada) results\n6\nincreased net income by $214 million. Adjusted net income\n3\nand adjusted diluted EPS\n3\nof $5.3 billion and $3.62 were up 29% and 27%, respectively, from the prior year.\n1\nOur consolidated results reflect an increase in total PCL of $237 million from a year ago, mainly reflecting higher provisions in Commercial Banking, Wealth Management and Personal Banking, partially offset by lower provisions in Capital Markets. The PCL on loans ratio of 42 bps increased 5 bps from the prior year.\nPre-provision, pre-tax earnings\n3\nof $7.5 billion were up $2.3 billion or 45% from last year. The inclusion of HSBC Canada results increased pre-provision, pre-tax earnings\n3\nby $451 million. Excluding HSBC Canada results, pre-provision, pre-tax earnings\n3\nincreased 36% from last year, mainly due to higher fee-based revenue in Wealth Management reflecting market appreciation and net sales, and higher revenue in Capital Markets driven by strength across Corporate & Investment Banking and Global Markets. Both segments also benefitted from the impact of foreign exchange translation. Higher net interest income reflecting strong average volume growth in Personal Banking and Commercial Banking and higher spreads in Personal Banking, also contributed to the increase. These factors were partially offset by higher expenses driven by higher variable compensation on improved results and continued investments in technology and talent across our businesses.\nCompared to last quarter, net income was up 22% reflecting growth across each of our business segments. Adjusted net income\n3\nwas up 18% over the same period. Pre-provision, pre-tax earnings\n3\nwere up 24% as higher revenues more than offset expense growth. The PCL on loans ratio of 42 bps increased 7 bps from the prior quarter, mainly reflecting higher provisions in Wealth Management and Capital Markets. The PCL on impaired loans ratio\n1\nwas 39 bps, up 13 bps from the prior quarter, including one account in the other services sector that migrated from performing to impaired during the quarter. The PCL on performing loans ratio was 3 bps, down 6 bps from the prior quarter.\nOur capital position remains robust, with a CET1 ratio\n2\nof 13.2%, supporting solid volume growth, and $2.4 billion of capital returned to our shareholders through common share dividends and share buybacks.\n“RBC’s first quarter exemplifies our commitment to staying ahead of our clients’ expectations in an increasingly complex world. In Q1, we delivered strong results and client-driven growth across our businesses, while prudently managing risk and making investments in technology and talent to position the bank for the future. At our upcoming Investor Day, we look forward to sharing more about how we plan to capitalize on our financial and strategic strength to elevate the value we create for our clients and shareholders.”\nRead news release",
  "id": "125982",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "report",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}