{
  "title": "RBC Investor Services' Canadian DB pension plans generate modest returns while facing heightened market volatility in Q1 2025",
  "url": "https://www.rbc.com/newsroom/news/article.html?article=126001",
  "date": "Wed, 30 Apr 2025 10:01:00 -0400",
  "short_description": "Despite market volatility fueled by geopolitical tensions, shifting trade policies and political changes both globally and domestically, defined benefit (DB) pension plans managed by RBC Investor...",
  "content": "TORONTO\n,\nApril 30, 2025\n/CNW/ - Despite market volatility fueled by geopolitical tensions, shifting trade policies and political changes both globally and domestically, defined benefit (DB) pension plans managed by RBC Investor Services clients posted a modest gain of 1.1% in the first quarter of 2025. The results are based on a recent analysis encompassing various client plans across private and public sectors.\nCanadian equities returned 1.2% for pension plans, slightly underperforming the TSX Composite Index, which rose 1.5%. The materials sector was the main contributor to positive performance, surging 20.3% on the strength of gold stocks. However, the information technology sector declined 7.5%, reflecting broader challenges within the tech industry.\nForeign equities held by pension plans fell 0.1%, while the MSCI World Index declined 1.7%. Within the benchmark, there was a sharp contrast between the performance of value and growth stocks: the MSCI World Value Index rose 4.9%, while the MSCI World Growth Index fell 7.7%. Meanwhile, U.S. equities, as represented by the S&P 500, declined 4.2%, underperforming the MSCI EAFE Index, which gained 6.9%. The EAFE's outperformance was driven by strong results in European markets, particularly\nGermany\n, which is expected to benefit from fiscal stimulus, and by the euro's appreciation against the Canadian dollar.\nEmerging markets also advanced, with the MSCI Emerging Markets Index rising 3.0%.\nIn fixed income markets, pension plans gained 1.8%, compared to a 2.0% increase in the FTSE Canada Universe Bond Index. Mid-term bonds led the way, climbing 2.7%, reflecting investors' preference for safer assets amid ongoing uncertainty surrounding central bank policies and political transitions.\n\"The first quarter reminded us that sector positioning, currency exposure and geopolitical awareness are key to pension performance,\" said\nIsabelle Tremblay\n, Asset Owner Segment Lead at RBC Investor Services. \"The appreciation of the euro versus the Canadian dollar amplified foreign equity gains, while political developments, including leadership changes both domestically and abroad, sparked investor recalibration. Pension plans that remained diversified and nimble were better positioned to navigate these challenges.\"\nAbout RBC\nRoyal Bank of Canada is a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 98,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As Canada's biggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 19 million clients in Canada, the U.S. and 27 other countries. Learn more at\nrbc.com\n.‎\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at\nrbc.com/peopleandplanet\n.\nAbout RBC Investor Services\nRBC Investor Services delivers investment servicing solutions to Canadian asset managers and asset owners, insurance providers, investment counsellors and global financial institutions. With more than 1,500 employees and offices across the globe, our focus is on safeguarding the assets of our clients and enabling their growth. Part of Royal Bank of\nCanada\n,\nCanada's\nlargest bank, RBC Investor Services has over\nC$2.6 trillion\nof assets under administration. Learn more at\nrbcis.com\n.\nFor more information, please contact:\nYlana Kurtz\n, RBC\nSOURCE  RBC Investor Services",
  "id": "126001",
  "company_name": "Royal Bank of Canada",
  "year": null,
  "quarter": null,
  "month": null,
  "article_type": "news",
  "source_type": "CA Banks",
  "source_name": "rbc",
  "raw_content_type": "html"
}