{
  "title": "Acting Chairman Pham Lauds DOJ Policy Ending Regulation by Prosecution of Digital Assets Industry and Directs CFTC Staff to Comply with Executive Orders",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9063-25",
  "date": "2025-04-08",
  "date_standard": "2025-04-08",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9063-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9063-25</h1>\n<h1>\n<span>Acting Chairman Pham Lauds DOJ Policy Ending Regulation by Prosecution of Digital Assets Industry and Directs CFTC Staff to Comply with Executive Orders</span>\n</h1>\n<h3>Changes to CFTC regulatory &amp; enforcement priorities will bring clarity to innovators; focus limited resources on bad actors</h3>\n<p><b>April 08, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\">WASHINGTON, D.C.</span> — Commodity Futures Trading Commission Acting Chairman Caroline D. Pham today praised a recently-announced <a href=\"https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.justice.gov%2Fdag%2Fmedia%2F1395781%2Fdl%3Finline&amp;data=05%7C02%7CDFaulk-White%40CFTC.gov%7C7bca028571aa4f02305408dd76dabcda%7Cff902a6348374fa7905b52887c7f3cff%7C0%7C0%7C638797404060629886%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=29UBDv5dLeSbmtzHZNw0QqNOkSnyJdNe2ZempTx5Wdk%3D&amp;reserved=0\">Justice Department policy</a> ending the practice of regulation by prosecution that has targeted the digital asset industry in recent years, and directed CFTC staff to comply with the President’s executive orders and Administration policy, consistent with DOJ’s digital assets enforcement priorities and charging considerations. The DOJ policy comes as Acting Chairman Pham has similarly refocused the CFTC’s enforcement resources on cases involving fraud and manipulation. </p><p>“For far too long, lawfare from multiple federal agencies against innovators in the digital asset space has created unfairness and uncertainty that has undermined trust in the regulatory process and impeded American competitiveness,” Acting Chairman Pham said. “I welcome the Justice Department’s policy to focus on holding bad actors accountable while allowing regulators to set clear rules that foster responsible innovation. The CFTC is committed to complying with the President’s executive orders at the heart of this policy and has already taken important steps to end regulation by enforcement and direct limited resources toward fighting fraud and helping victims.</p><p>“Today, pursuant to my sole authority as Acting Chairman to exercise the executive and administrative functions of the Commission, I direct the CFTC staff and the Director of Enforcement to comply with Executive Order 14219 on the use of the agency’s enforcement discretion to ensure lawful governance. </p><p>“In accordance with the President’s executive orders and Administration policy, I direct the CFTC staff and the Director of Enforcement to adhere to the Justice Department’s policy on digital assets enforcement priorities and digital assets charging considerations set forth in the Deputy Attorney General’s memorandum, <em>Ending Regulation by Prosecution</em>, dated April 7, 2025, with respect to ongoing investigations, litigation including the agency’s litigating position and arguments, and other enforcement matters. </p><p>“In order to finally end the CFTC’s regulation by enforcement over the past several years, I direct the CFTC staff and the Director of Enforcement, consistent with DOJ policy, to not seek to ‘charge regulatory violations in cases involving digital assets,’ in particular ‘violations of registration requirements under the Commodity Exchange Act,’ unless ‘there is evidence that the defendant knew of the licensing or registration requirement at issue and violated such a requirement willfully,’ as set forth in DOJ’s <em>Ending Regulation by Prosecution</em>.</p><p>“Under Executive Order 14219, agency heads are required to ‘direct the termination of all such enforcement proceedings that do not comply with the Constitution, laws, or Administration policy.’ For ongoing CFTC litigation matters in U.S. federal court, pursuant to administrative law and precedent, the CFTC cannot dismiss a case or enter into a settlement consent order to terminate the enforcement proceeding, without agency action by the Commission requiring a majority vote. Currently, no party holds a majority on the Commission.</p><p>“Therefore, I direct the CFTC staff and the Director of Enforcement, pursuant to Executive Order 14219, with respect to ongoing CFTC litigation matters in U.S. federal court, to ‘preserve [the CFTC’s] limited enforcement resources’ by ‘de-prioritizing actions’ involving violations of registration requirements under the Commodity Exchange Act unless there is evidence that the defendant knew of the licensing or registration requirement at issue and violated such a requirement willfully, consistent with DOJ policy. I direct the CFTC staff and the Director of Enforcement to not take any litigating position or arguments that do not comply with the President’s executive orders, Administration policy, or DOJ policy on digital assets enforcement priorities and digital assets charging considerations.”</p><p>At Acting Chairman Pham’s direction, the CFTC has taken decisive action to ensure lawful governance and enforcement. Shortly after becoming Acting Chairman, Pham <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9044-25\">realigned the CFTC Division of Enforcement task forces</a> to end regulation by enforcement and refocus on fighting fraud and helping victims. Under her leadership, the Division of Enforcement has also <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9054-25\">issued a new advisory</a> on the CFTC’s new policy going forward to promote self-reporting, cooperation, and remediation. </p><p><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>Pham also </span><a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/opapham13\"><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>launched an initiative</span></a><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'> aimed at expeditiously resolving a backlog of noncompliance matters that do not involve customer harm or market abuse. The initiative provides the opportunity to bring closure and clarity to firms in a timely manner while freeing up agency resources to focus on catching fraudsters and scammers and helping victims. Thus far, nearly two dozen firms have reached out to participate.</span></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "d9880d01b395156145c145f6a0cf84f0",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}