{
  "title": "CFTC Staff Issues Interpretation Regarding U.S. Treasury Exchange-Traded Funds as Eligible Margin Collateral for Uncleared Swaps",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9065-25",
  "date": "2025-04-14",
  "date_standard": "2025-04-14",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9065-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9065-25</h1>\n<h1>\n<span>CFTC Staff Issues Interpretation Regarding U.S. Treasury Exchange-Traded Funds as Eligible Margin Collateral for Uncleared Swaps </span>\n</h1>\n<p><b>April 14, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission’s Market Participants Division today issued an interpretation to clarify the types of assets that qualify as eligible margin collateral for certain uncleared swap transactions under CFTC regulations. </p><p>CFTC Regulation 23.156 lists the types of collateral that covered swaps entities can post or collect as initial margin (IM) and variation margin (VM) for uncleared swap transactions. The regulation, which includes “redeemable securities in a pooled investment fund” as eligible IM collateral, aims to identify assets that are liquid and will hold their value in times of financial stress.</p><p>The interpretation clarifies the division’s view that shares of certain U.S. Treasury exchange-traded funds may be considered redeemable securities in a pooled investment fund and may qualify as eligible IM and VM collateral subject to the conditions in CFTC Regulation 23.156. Swap dealers, therefore, may post and collect shares of certain UST ETFs as IM collateral for uncleared swap transactions with any covered counterparty. Swap dealers may also post and collect such UST ETF shares as VM for uncleared swap transactions with financial end users.</p><p style=\"background-color:white;\">The interpretation was issued in response to a <a href=\"https://www.cftc.gov/media/10331/CFTC_GMAC_GM_Structure_Subcommittee_Recommendation-UST_ETF_as_UMR_Collateral/download\">recommendation</a> from the CFTC’s Global Markets Advisory Committee and prepared by its Global Market Structure Subcommittee.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "bc631f54c90fba7e969caad1ad67ba08",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}