{
  "title": "CFTC Staff Seek Public Comment on 24/7 Trading",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9068-25",
  "date": "2025-04-21",
  "date_standard": "2025-04-21",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9068-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9068-25</h1>\n<h1>\n<span>CFTC Staff Seek Public Comment on 24/7 Trading</span>\n</h1>\n<p><b>April 21, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission’s Divisions of Market Oversight, Clearing and Risk, and Market Participants today issued a <a href=\"https://www.cftc.gov/media/12036/24_7_RFC042125/download\">Request for Comment</a> to better inform them on the potential uses, benefits, and risks of trading on a 24/7 basis in the derivatives markets the CFTC regulates. </p><p>“As I have long said, the CFTC must take a forward-looking approach to shifts in market structure to ensure our markets remain vibrant and resilient while protecting all participants,” said Acting Chairman Caroline D. Pham. “One evolving trend is the move to 24/7, 24/6, or 24/5 trading hours. I look forward to the public comments on this market innovation.”</p><p><span>This request seeks comment on the implications of extending the trading of CFTC-regulated derivatives markets to an effectively 24/7 basis, including the potential effects on trading, clearing and risk management which differ from trading during current market hours. The request also seeks comment on the risks of 24/7 trading, and the associated clearing systems, including risks related to the areas of market integrity, customer protection, or retail trading. </span></p><p><span>Comments will be accepted until May 21. Comments may be submitted electronically through the CFTC Comments </span><a href=\"https://comments.cftc.gov/PublicComments/CommentList.aspx?id=7583\">online process</a>.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "e650d94cfcbc88b58a313c838c66ae81",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}