{
  "title": "CFTC Staff Issues No-Action Letter Regarding the Merger of UBS Group and Credit Suisse Group",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9066-25",
  "date": "2025-04-15",
  "date_standard": "2025-04-15",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9066-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9066-25</h1>\n<h1>\n<span>CFTC Staff Issues No-Action Letter Regarding the Merger of UBS Group and Credit Suisse Group</span>\n</h1>\n<p><b>April 15, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> </strong>— The Commodity Futures Trading Commission’s Market Participants Division and Division of Clearing and Risk today issued a no-action letter regarding the CFTC’s swap clearing and uncleared swap margin requirements. The letter is in connection with a court-supervised transfer, consistent with United Kingdom laws, of certain swaps from Credit Suisse International to UBS AG London Branch following the merger of UBS Group AG and Credit Suisse Group AG.<span> </span></p><p>These legacy swaps were entered into prior to the relevant compliance dates for the CFTC’s margin and clearing requirements, and, therefore, were not subject to such requirements prior to this court-supervised transfer.</p><p>The no-action letter states, in connection with such transfer and subject to certain specified conditions:</p><ul><li>MPD will not recommend the Commission take an enforcement action against certain of UBS AG London Branch’s swap dealer counterparties for their failure to comply with the CFTC’s uncleared swap margin requirements for such transferred swaps; and<br/> </li><li>DCR will not recommend the Commission take an enforcement action against UBS AG or certain of its counterparties for their failure to comply with the CFTC’s swap clearing requirement for such transferred swaps.</li></ul><p>The letter responds to a request from UBS AG.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "cf8c0ffcf710037592a2992a15ff4983",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}