{
  "title": "CFTC Announces Departure of Amanda Olear After Nearly 2 Decades of Service",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9070-25",
  "date": "2025-04-29",
  "date_standard": "2025-04-29",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9070-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9070-25</h1>\n<h1>\n<span>CFTC Announces Departure of Amanda Olear After Nearly 2 Decades of Service </span>\n</h1>\n<p><b>April 29, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission today announced former Director of the Market Participants Division and former Acting Director of the Division of Market Oversight, Amanda L. Olear, will depart the agency on May 2. Ms. Olear has served at the CFTC for over 17 years in multiple leadership roles across various divisions. </p><p>“It has been a true pleasure to have known and worked with Amanda for 15 years. She has served the CFTC, our mission, and our markets with excellence for many years,” Acting Chairman Caroline D. Pham said. “Throughout her distinguished tenure, Amanda has exemplified leadership, expertise, and pragmatism in every role she’s held. I would especially like to personally thank Amanda for serving on my executive management team. I’m grateful for her over 17 years of dedicated service to the CFTC and wish her the very best in her future endeavors.”</p><p>“I would like to thank Acting Chairman Pham and former Chairman Behnam for the privilege of being part of their leadership teams,” Ms. Olear said, “It was an honor that I could not have imagined when I joined the CFTC as a junior staff attorney and one that I will carry with me for the rest of my career. I would also like to express my appreciation for the staff in the Market Participants Division and the Division of Market Oversight for their trust and support over the past 5 years. Their professionalism and expertise continue to impress and inspire me. My hope is that I proved myself worthy of their confidence.”<span> </span></p><p>Ms. Olear joined the CFTC in 2007 and has served in various leadership capacities, including most recently as Acting Director of the Division of Market Oversight, where she led a team of attorneys, analysts, and other professional staff who oversee derivatives platforms and swap data repositories. Prior to this role, Ms. Olear served as the Director of the Market Participants Division since 2021.</p><p>Ms. Olear began her tenure at the CFTC as an attorney-advisor in the then – Division of Clearing and Intermediary Oversight – with a focus on CPOs and CTAs. In 2013, she took on the role of Associate Director of the Managed Funds Section in the Division of Swap Dealer and Intermediary Oversight and served as the Deputy Director of Registration and Compliance from 2017 to 2021.</p><p>Ms. Olear joined the CFTC from Council, Baradel, Kosmerl &amp; Nolan, P.A. in Annapolis, Maryland, where she focused on business entity formation and complex commercial litigation. Prior to that, Ms. Olear served as a law clerk to the Honorable Lynne A. Battaglia on the Maryland Court of Appeals (now the Maryland Supreme Court). Coming from a long line of family farmers, she holds a JD, with honors, from the University of Maryland Francis King Carey School of Law and a BA, summa cum laude, from McDaniel College.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "303d7629cf0d5b68e4e06277aeab6239",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}