{
  "title": "CFTC Staff Seek Public Comment Regarding Perpetual Contracts in Derivatives Markets",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9069-25",
  "date": "2025-04-21",
  "date_standard": "2025-04-21",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9069-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9069-25</h1>\n<h1>\n<span>CFTC Staff Seek Public Comment Regarding Perpetual Contracts in Derivatives Markets</span>\n</h1>\n<p><b>April 21, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission’s Divisions of Market Oversight, Clearing and Risk, and Market Participants today issued a <a href=\"https://www.cftc.gov/media/12041/Perpetuals_RFC042125/download\">Request for Comment</a> to better inform them on the potential uses, benefits, and risks of perpetual contracts in the derivatives markets the CFTC regulates (Perpetual Derivatives). </p><p>“Innovation and new technology has created a renaissance in markets that presents new opportunities that are accessible to more people, as well as risks,” said Acting Chairman Caroline D. Pham. “The CFTC is getting back to basics by requesting public comment on perpetual contracts that have seen significant interest recently from exchanges and market participants.”</p><p>This request seeks comment on the characteristics of perpetual derivatives, including those characteristics which may differ across products. as well as the implications of their use in trading, clearing and risk management. The request also seeks comment on the risks of perpetual derivatives, including risks related to the areas of market integrity, customer protection, or retail trading. </p><p>Comments will be accepted until May 21. Comments may be submitted electronically through the CFTC Comments <a href=\"https://comments.cftc.gov/PublicComments/CommentList.aspx?id=7584\"><span>online process</span></a>.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "caca4d7dd0fe4bfadf56a58f86eec55e",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}