{
  "title": "Rahul Varma Named Acting Director of CFTC Division of Market Oversight",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9061-25",
  "date": "2025-04-02",
  "date_standard": "2025-04-02",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9061-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9061-25</h1>\n<h1>\n<span>Rahul Varma Named Acting Director of CFTC Division of Market Oversight</span>\n</h1>\n<p><b>April 02, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission Acting Chairman Caroline D. Pham today announced Rahul Varma will serve as the Acting Director of the Division of Market Oversight.</p><p>“Rahul has ably served the CFTC for more than a decade and brings a wealth of knowledge and experience to this new role,” Pham said. “I thank Rahul for his continued leadership in DMO.”</p><p>Varma joined the CFTC in 2013 as an Associate Director for Market Surveillance in DMO, with responsibility for energy, metals, agricultural, and softs markets. In 2017, he helped start the Market Intelligence Branch in DMO and served as its Acting Deputy Director. In 2024, he took on the role of Deputy Director for the combined Market Intelligence and Product Review branches.</p><p>Prior to joining CFTC, Varma held risk management and consulting roles in the private sector. He also worked at the Federal Energy Regulatory Commission in the Office of Market Oversight and Investigations (predecessor of Office of Enforcement). </p><p>Varma has a BTech from IIT Delhi, a master’s degree from Case Western Reserve University, and an MBA from George Washington University.</p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "3a9a4d61372f36088e8a60d0f792f6ba",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}