{
  "title": "‘Dating or Defrauding?’ a Joint Effort to Alert Online Daters, Social Media Users of Relationship Investment Scams",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9052-25",
  "date": "2025-02-10",
  "date_standard": "2025-02-10",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9052-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9052-25</h1>\n<h1>\n<span>‘Dating or Defrauding?’ a Joint Effort to Alert Online Daters, Social Media Users of Relationship Investment Scams</span>\n</h1>\n<p><b>February 10, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p style=\"line-height:107%;\"><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — In coordination with multiple federal, state, and nonprofit organizations, the Commodity Futures Trading Commission’s Office of Customer Education and Outreach has launched a national awareness effort to alert the public to relationship investment scams targeting Americans through wrong-numbered texts, dating apps, and social media.<em><o:p></o:p></em></p><p style=\"line-height:107%;\">Over the coming weeks, the interagency <em>Dating or Defrauding?</em> social media awareness campaign will warn Americans to be skeptical of any request from online friends for cryptocurrency, gift cards, wire transfers, or other forms of payment. Other red flags include:<o:p></o:p></p><ul style=\"list-style-type:disc;\"><li style=\"line-height:107%;\">A prolonged inability to meet in-person.<span style=\"line-height:107%;\"><o:p></o:p></span></li><li style=\"line-height:107%;\">Moving conversations off social or dating platforms to encrypted messaging apps.<span style=\"line-height:107%;\"><o:p></o:p></span></li><li style=\"line-height:107%;\">Repeated suggestions for investments or requests for money.<span style=\"line-height:107%;\"><o:p></o:p></span></li></ul><p style=\"line-height:107%;\">The joint initiative will provide information about how to recognize relationship investment scams, what to do if you are affected, and why to share the information to warn others.<o:p></o:p></p><p style=\"line-height:107%;\">“Today, criminals are better able to hide their identities, create more fake profiles, phishing emails, and more convincing scam websites than ever before,” said OCEO Director Melanie Devoe. “Valentine’s Day and the following weeks provide an excellent opportunity to remind people that criminals are using social media, dating, and messaging apps to scam Americans. We ask you to be alert, and to help stop scams by warning your friends and family.” <o:p></o:p></p><p style=\"line-height:107%;\">During the campaign, participating organizations will use the #DatingOrDefrauding hashtag and direct users to helpful resources. In addition to the CFTC, participating agencies include: <o:p></o:p></p><ul style=\"list-style-type:disc;\"><li style=\"line-height:107%;\"><strong>Federal agencies</strong>:<strong> </strong>FBI, Federal Deposit Insurance Corporation Office of Inspector General, Federal Trade Commission, Financial Crimes Enforcement Network, Social Security Administration Office of the Inspector General, and <span style=\"line-height:107%;\">U.S. Postal Inspection Service.</span><o:p></o:p></li><li style=\"line-height:107%;\"><strong>State agencies:</strong> Arizona Corporation Commission, U.S. Virgin Islands Office of the Lieutenant Governor, Oregon <span>Division of Financial Regulation</span>, Washington State Department of Financial Institutions, and Wisconsin Department of Financial Institutions.<o:p></o:p></li><li style=\"line-height:107%;\"><span style=\"line-height:107%;\"><strong>Non-governmental organizations:</strong> FINRA and NFA. </span><strong><o:p></o:p></strong></li></ul><p style=\"line-height:107%;\"><strong>About Relationship Investment Scams<o:p></o:p></strong></p><p style=\"line-height:107%;\">Relationship investment scams are a recent type of romance fraud, <span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>causing </span><a href=\"https://www.ic3.gov/annualreport/reports/2023_ic3report.pdf\"><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>reported losses to the FBI </span></a><span style='font-family:\"Arial\",sans-serif;font-size:12.0pt;'>of nearly $4 billion in 2023. </span>Called pig butchering by the perpetrators, criminals use dating apps, social media platforms, messaging apps, and even random “wrong number” text messages to target possible victims. The scammers are known to use fake profiles, images, videos and voices to make themselves appear attractive and professional, and once introduced, they send frequent messages to build relationships. These new online “friends” claim to have made a lot of money trading cryptocurrency, precious metals, or foreign currency, thanks to special knowledge or insider help. The scammers talk about how easy it is and offer to help victims earn extra money. Victims are then directed to fraudulent trading platforms operated by the same organized criminal gangs.<o:p></o:p></p><p style=\"line-height:107%;\">These scams do not discriminate and have victimized people of all ages. People who <a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/isolated.html\">live alone</a> or spend a lot of time on <a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/nothing_to_like_about_social_media_scammers.html\">social media</a> or in discussion groups tend to be more vulnerable to fraud. Scams work because they appeal to unmet needs or emotions, like financial stress, excitement, or fear. The good news is that awareness can reduce victimization. Sharing information could help protect those closest to you.<o:p></o:p></p><p style=\"line-height:107%;\">In addition to participating in the <em>Dating or Defrauding?</em> effort, the CFTC’s Office of Customer Education and Outreach is releasing a customer advisory<span style=\"line-height:107%;\">, </span><em><span style=\"line-height:107%;\">Help Warn Others About Relationship Investment Scams</span></em>, that explains the fraud in detail and steps the public can take to help others.<o:p></o:p></p><p>The CFTC has previously alerted customers to romance frauds including the inaugural <em>Dating or Defrauding?</em> campaign in 2022. [See CFTC Press Release No. <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8491-22\">8491-22</a>]. The CFTC also issued customer advisories <a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/CustomerAdvisory_RomanceScam.html\">Avoid Forex, Precious Metals, and Digital Asset Romance Scams</a>. [See CFTC Press Release No. <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8492-22\">8492-22</a>] and <a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/RomanceScam.html\">Six Warning Signs of Online Financial Romance Frauds</a>.<o:p></o:p></p><p><span><strong>About the Office of Customer Education and Outreach<o:p></o:p></strong></span></p><p><span>OCEO is dedicated to helping customers protect themselves from fraud or violations of the Commodity Exchange Act through the research and development of effective financial education materials and initiatives. OCEO engages in outreach and education to retail investors. The office also frequently partners with federal and state regulators as well as consumer protection groups. The CFTC’s full repository of customer education materials can be found at: </span><a href=\"https://www.cftc.gov/LearnAndProtect\"><span>cftc.gov/LearnAndProtect</span></a><span>.</span><o:p></o:p></p><p><em><span>Customer Advisory: </span></em><a href=\"https://www.cftc.gov/sites/default/files/2025/02/DatingOrDefrauding.pdf\"><em>Help Warn Others About Relationship Investment Scams</em></a><em><span> is available in full below.<o:p></o:p></span></em></p><p class=\"text-align-center\"><em><span>###<o:p></o:p></span></em></p><p class=\"text-align-center\"><span><strong>Customer Advisory: Help Warn Others About Relationship Investment Scams</strong></span><span style=\"background-color:yellow;\"><strong><o:p></o:p></strong></span></p><p><span>Scammers are using smart phones, social media or dating sites, and cryptocurrency to steal billions of dollars from Americans. Over the coming month, the CFTC is joining with other federal, state, and nonprofit organizations to raise awareness about these horrible crimes. You can help too: Warn your friends and family by sharing #DatingOrDefauding information and links. <o:p></o:p></span></p><p><span>Relationship investment scams, called </span><em><span>pig butchering</span></em><span> by the perpetrators, use dating apps, social media platforms, </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/MessagingApps.html\"><span>messaging apps</span></a><span>, and even random “wrong number” text messages to target possible victims. The fraudsters use fake profiles, images, videos and voices to make them appear attractive and professional. Once introduced, they send frequent messages to build relationships. The new online “friends” claim to have made a lot of money trading cryptocurrency, precious metals, or foreign currency, thanks to special knowledge or insider help. The scammers talk about how easy it is and offer to help targets earn extra money. Targets are then directed to fraudulent trading platforms operated by the same organized criminal gangs.<o:p></o:p></span></p><p><span>Victims are told to convert their dollars to cryptocurrency and then send the crypto to the </span><a href=\"https://www.cftc.gov/sites/default/files/2023-04/SpotFraudSites.pdf\"><span>scam website</span></a><span>. They see their balances on the websites grow substantially and are encouraged to withdraw small amounts of money to spend on themselves. This is another ploy to build trust. </span><a href=\"https://www.cftc.gov/node/253556\"><span>Research</span></a><span> reveals victims transfer an average of 10 payments, each larger than the last until they are financially drained. When victims try to make subsequent withdraws, they are refused or told they must pay additional fees or taxes.<o:p></o:p></span></p><p><span><strong>Anyone Could be a Potential Victim<o:p></o:p></strong></span></p><p><span>Relationship investment scams do not discriminate and have victimized people of all ages. People who </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/isolated.html\"><span>live alone</span></a><span> or spend a lot of time on </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/nothing_to_like_about_social_media_scammers.html\"><span>social media</span></a><span> or in discussion groups tend to be more vulnerable to fraud. Scams work because they appeal to unmet needs or emotions, like financial stress, excitement, or fear. <o:p></o:p></span></p><p><span>The good news is that awareness about specific scams can reduce victimization by up to 85 percent.</span><a href=\"#_ftn1\" name=\"_ftnref1\" title=\"\"><span>[1]</span></a><span> Sharing information during the Dating or Defrauding Campaign could help protect those closest to you.<o:p></o:p></span></p><p><span><strong>What You Can Do<o:p></o:p></strong></span></p><ul style=\"list-style-type:disc;\"><li class=\"BulletedHyperlink\"><span>Talk about relationship investment scams and other scams you hear about. Visit the CFTC </span><a href=\"https://www.cftc.gov/LearnAndProtect/romancefrauds\"><span>Romance Fraud Center</span></a><span> for more information and resources. Talking regularly about fraud raises awareness, reduces the stigma of victimization, and can encourage reporting. <o:p></o:p></span></li><li class=\"BulletedHyperlink\"><span>Look for and share, like, or repost messages with the <strong>#DatingOrDefrauding</strong> hashtag.<o:p></o:p></span></li><li class=\"BulletedHyperlink\"><span>Host a fraud prevention event in your community. You can engage local law enforcement, </span><a href=\"/cdn-cgi/l/email-protection#ec8988998f8d98858382ac8f8a988fc28b839a\"><span>the CFTC</span></a><span>, or other agencies involved in the Dating or Defrauding Campaign.<o:p></o:p></span></li><li class=\"BulletedHyperlink\"><span>Listen for warning signs, like a friend or relative talking about a new online relationship or investing in crypto for the first time.<o:p></o:p></span></li><li class=\"BulletedHyperlink\"><span>Report fraud. You can do so at </span><a href=\"https://www.cftc.gov/complaint\"><span>CFTC.gov/complaint</span></a><span> or the FBI’s Internet Crime Complaint Center, </span><a href=\"https://www.ic3.gov/\"><span>IC3.gov</span></a><span>. If you are victimized by this fraud here are </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/6Steps.html\"><span>resources that can help</span></a><span>.<o:p></o:p></span></li></ul><hr/><p id=\"fnt1\" name=\"fnt1\" style=\"font-size:10pt;\"><a href=\"#fntref1\">[1]</a> See DeLiema, M., Li, Y., &amp; Mottola, G. (2023). Correlates of responding to and becoming victimized by fraud: Examining risk factors by scam type. International Journal of Consumer Studies, 47(3), 1042-1059. <a href=\"https://www.cftc.gov/Exit/index.htm?https://onlinelibrary.wiley.com/doi/10.1111/ijcs.12886\">https://onlinelibrary.wiley.com/doi/10.1111/ijcs.12886</a></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "1178e8de850569870ac7f1fe97a14046",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}