{
  "title": "CFTC Statement on False Allegations Targeting Acting Chairman",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9048-25",
  "date": "2025-02-06",
  "date_standard": "2025-02-06",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9048-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9048-25</h1>\n<h1>\n<span>CFTC Statement on False Allegations Targeting Acting Chairman</span>\n</h1>\n<p><b>February 06, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> </strong>— The following is attributable to a Commodity Futures Trading Commission spokesperson:<o:p></o:p></p><p>Allegations by unnamed sources in a Bloomberg article attempting to smear Acting Chairman Caroline D. Pham are baseless, were not fact-checked with the CFTC, and an unfortunate attempt by disgruntled individuals that are under investigation to distract from the CFTC’s important mission. Pham’s tenure has been marked by pushes for improved transparency, adherence to the law, and management accountability. <o:p></o:p></p><p>New administrations and changes in agency leadership are almost always accompanied by changes in senior management. This is nothing new, and while personnel matters are generally reserved from public discussion, it is important to set the record straight.<o:p></o:p></p><p>The former head of Human Resources was removed from her position pending an internal investigation into failures to address several HR matters including:<o:p></o:p></p><ul style=\"margin-top:0in;\" type=\"disc\"><li style=\"tab-stops:list .5in;\">Concerns raised by a federal judge and a former United States Attorney about false statements to the court and other alleged misconduct by Division of Enforcement staff;<o:p></o:p></li><li style=\"tab-stops:list .5in;\">Reports that unionized CFTC staff were working remotely from outside of the United States, jeopardizing agency cybersecurity and violating agency policy and applicable laws; and<o:p></o:p></li><li style=\"tab-stops:list .5in;\">Targeting Republicans illegally in violation of the First Amendment, including senior officers of the United States and Presidential appointees that are protected from the Biden Administration’s politically motivated attacks.<o:p></o:p></li></ul><p>These matters have been referred to the CFTC’s Office of Inspector General. While this employee has been removed from her post pending an internal review, she has not been terminated. She was replaced by an employee who previously served as the CFTC’s Equal Employment Opportunity officer. No part of this move violated any Executive Order.<o:p></o:p></p><p>Claims about Acting Chairman Pham’s travel are categorically false. All aspects of Pham’s travel have been reviewed and approved by agency officials, including the Chief Financial Officer, the Ethics Office, and the General Counsel with voluminous supporting documentation. Any personal travel by Pham, including business class travel, hotel stays, and commuting expenses, was paid for with personal funds and was not paid by the CFTC and is substantiated with receipts. <o:p></o:p></p><p>At all times, Pham complied in full with all laws, regulations, and agency policies.<o:p></o:p></p><p>At Pham’s direction, the CFTC has been conducting an independent review by an external law firm of alleged misconduct by Division of Enforcement staff in the <em>CFTC v. Traders Global Group</em> matter, including the Commission closed meeting in August 2023 and subsequent events; other alleged misconduct by staff involving enforcement recommendations to the Commission and related events, including the Union Grievance from October 2023; and internal procedures for administrative proceedings by the Commission in enforcement matters. This independent review includes the allegations regarding a hostile work environment due to Pham’s repeatedly raised concerns about staff misconduct. There are recordings and transcripts of these Commission closed meetings, including Pham’s questions. Any insinuation that Pham’s conduct was intimidating, abusive, or a hostile work environment are verifiably without any merit. </p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "46a1cb283bcbf101e8b305475bea01cf",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}