{
  "title": "CFTC Releases Enforcement Advisory on Self-Reporting, Cooperation, and Remediation",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9054-25",
  "date": "2025-02-25",
  "date_standard": "2025-02-25",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9054-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9054-25</h1>\n<h1>\n<span>CFTC Releases Enforcement Advisory on Self-Reporting, Cooperation, and Remediation </span>\n</h1>\n<p><b>February 25, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — <span lang=\"EN\">The Commodity Futures Trading Commission’s Division of Enforcement today issued an advisory on how the Division will evaluate a company’s or individual’s self-reporting, cooperation, and remediation when recommending enforcement actions to the Commission and establishes the factors the Division will consider. This marks the first time the Division will use a matrix to determine the appropriate mitigation credit to apply. The advisory provides fair notice to the public and guidance that is designed to ensure due process in the Division’s investigations and enforcement actions.</span></p><p><span lang=\"EN\">“Today, the CFTC is finally making the improvements that I have </span><a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/phamstatement081924\"><span lang=\"EN\">long proposed</span></a><span lang=\"EN\"> are necessary to ensure lawful enforcement, and also implements the Administration’s </span><a href=\"https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-lawful-governance-and-implementing-the-presidents-department-of-government-efficiency-regulatory-initiative/\"><span lang=\"EN\">Executive Order</span></a><span lang=\"EN\">,” said Acting Chairman Caroline D. Pham. “</span><a href=\"https://www.cftc.gov/PressRoom/SpeechesTestimony/opapham7\"><span lang=\"EN\">From the beginning</span></a><span lang=\"EN\">, I have encouraged firms to self-report to proactively take ownership, ensure accountability, and prevent future violations. By making the CFTC’s expectations for self-reporting, cooperation, and remediation more clear—including a first-ever matrix for mitigation credit—this advisory creates meaningful incentives for firms to come forward and get cases resolved faster with reasonable penalties.</span></p><p><span lang=\"EN\">“Critically, it will enable the CFTC to do more with less and free up enforcement resources to focus relentlessly on catching fraudsters and scammers, helping victims, and promoting market integrity. Today’s advisory gets back to basics by returning to decades of prior CFTC policy on self-reporting and is aligned with best practices for assessing penalties followed by the Department of Justice and other U.S. financial regulators. This ‘no-surprises’ approach is straightforward and demonstrates the CFTC’s renewed commitment to fair treatment under the law and principles of regulatory consistency, transparency, and clarity.”</span></p><p>“Our goal with this advisory is to obtain accountability while encouraging efficiency and conserving government resources by giving entities a clear reason to self-report and cooperate,” said Division of Enforcement Director Brian Young. “This advisory informs both staff and the public precisely how to do that. Based on my experience in criminal practice, I believe policies that encourage transparency and cooperation yield efficiencies and better justice outcomes.”<span> </span></p><p>Specifically, the advisory details the framework the Division will use to assess self-reporting, cooperation, and remediation in investigations and enforcement actions: </p><ul><li><strong><u>Self-Reporting:</u></strong> The Division will evaluate self-reporting on a three-tier scale: No Self-Report; Satisfactory Self-Report; and Exemplary Self-Report. To receive full credit, disclosures must be voluntary, made to the Commission, made in a timely manner, and complete. Reports can be made to either the Division of Enforcement or to one of the Commission’s other Divisions with oversight responsibility. The Division of Enforcement will provide a safe harbor for good faith self-reporting if any inaccurate information in the self-report or voluntary disclosure is supplemented and corrected promptly after discovery of the inaccurate information.</li><li><strong><u>Cooperation and Remediation:</u> </strong><span>The Division will evaluate cooperation on a four-tier scale: No Cooperation; Satisfactory Cooperation; Excellent Cooperation; and Exemplary Cooperation. The Division will evaluate remediation as a part of its evaluation of cooperation and consider whether a party engaged in substantial efforts to prevent a future violation. Other CFTC Divisions will be involved in the assessment of remediation. In some cases, a compliance monitor or consultant may be recommended to ensure the completion of undertakings. The advisory also provides examples of uncooperative conduct.</span></li><li><strong><u>Mitigation Credit Matrix:</u> </strong><span>The advisory includes a Mitigation Credit Matrix describing the presumptive mitigation credit—as a percentage of the Division’s initial calculation of the civil monetary penalty—that a party may be eligible for if that party has self-reported and/or cooperated. The presumptive Mitigation Credit ranges from 0% for no self-report and no cooperation to 55% for an exemplary self-report and exemplary cooperation. The Division retains the discretion to deviate from the Mitigation Credit Matrix given the unique facts and circumstances of a particular case.</span></li></ul></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "3f4383f0afcb83240a77d7beb499ac8c",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}