{
  "title": "Federal Court Orders New York Resident to Pay Over $1.5 Million in Digital Assets Trading Scheme",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9050-25",
  "date": "2025-02-10",
  "date_standard": "2025-02-10",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9050-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9050-25</h1>\n<h1>\n<span>Federal Court Orders New York Resident to Pay Over $1.5 Million in Digital Assets Trading Scheme</span>\n</h1>\n<p><b>February 10, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission today announced the U.S. District Court for the Eastern District of New York entered an order against <strong>Rashawn Russell, </strong>a New York resident, in a CFTC action charging Russell with fraudulent solicitation and misappropriation of investor assets obtained for the purported purpose of trading digital assets on behalf of customers. <o:p></o:p></p><p>The order requires Russell to pay over $1.5 million in restitution to defrauded victims. The order also permanently enjoins Russell from engaging in conduct that violated the Commodity Exchange Act and CFTC regulations, as charged, permanently bans him from registering with the CFTC and from solicitation for and trading in any CFTC-regulated markets on behalf of third parties, and bans him from trading for himself for a period of eight years. The order resolves the CFTC’s action against Russell.<span>  </span>[See CFTC Press Release No. <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8686-23\">8686-23</a>]<span>       </span><o:p></o:p></p><p><strong>Case Background<o:p></o:p></strong></p><p>The order, stemming from a CFTC complaint filed April 11, 2023, finds from November 2020 to August 2022 Russell engaged in a fraudulent digital assets trading scheme in which he solicited more than two dozen retail customers to contribute bitcoin, ether, and fiat currency to invest in his purported proprietary digital assets trading fund. The order further finds Russell intentionally and/or recklessly made false and misleading statements regarding the fund’s structure, size, and performance to obtain and retain investors; failed to trade the money and assets as represented; and, falsely promised to pay withdrawal requests. The order finds Russell misappropriated over $1.5 million in customers assets through his fraudulent scheme, which he used, among other things, to pay personal expenses, entities associated with gambling activities, and Ponzi-like payments to current customers.<span> </span><o:p></o:p></p><p><strong>Parallel Criminal Action<o:p></o:p></strong></p><p>On Sept. 19, 2023, Russell pled guilty to one count of wire fraud arising from the same digital assets trading scheme alleged in the CFTC’s complaint and to one count of access device fraud arising from unrelated conduct.<span>  </span>[<em>United States v. Rashawn Russell</em>, Case No. 23-CR-152 (E.D.N.Y. 2023)] Russell was subsequently sentenced to over three years in prison, an additional term of three years of supervised release, and ordered to pay over $1.5 million in restitution to the victims of his trading scheme.<o:p></o:p></p><p><span style=\"background-color:white;color:black;\">The CFTC appreciates the assistance of the Department of Justice, Fraud Section.</span><o:p></o:p></p><p>Division of Enforcement staff responsible for this case are Rebecca Jelinek, Steve Turley, Tom Simek, Chris Reed, and Charles Marvine.<span> </span><span style=\"font-size:14.0pt;\"><strong><o:p></o:p></strong></span></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "162c03da5c267981bb58d08e1e97c9e0",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}