{
  "title": "CFTC Division of Enforcement to Refocus on Fraud and Helping Victims, Stop Regulation by Enforcement",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9044-25",
  "date": "2025-02-04",
  "date_standard": "2025-02-04",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9044-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9044-25</h1>\n<h1>\n<span>CFTC Division of Enforcement to Refocus on Fraud and Helping Victims, Stop Regulation by Enforcement </span>\n</h1>\n<p><b>February 04, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> — </strong>Commodity Futures Trading Commission Acting Chairman Caroline D. Pham today announced a reorganization of the Division of Enforcement’s task forces to combat fraud and help victims while ending the practice of regulation by enforcement.<o:p></o:p></p><p>“The CFTC is strengthening its enforcement program to focus on victims of fraud, as well as remaining vigilant for other violations of law. This simplified structure will stop regulation by enforcement and is more efficient. These much-needed changes will maximize the CFTC’s resources to bring more actions to pursue fraudsters and other bad actors, and not punish good citizens. I commend the Division of Enforcement for upholding the CFTC’s mission to protect the American public.”<o:p></o:p></p><p>“Fraudsters are constantly evolving their tactics to exploit market participants and undermine the rules that provide the foundation for a vibrant, resilient and innovation-forward marketplace,” said Brian Young, CFTC Acting Director of Enforcement. “This taskforce realignment will enhance our vigorous and energetic enforcement program by empowering our talented staff to focus their expertise on matters that secure justice for victims and uphold public confidence in the integrity of our markets.”<o:p></o:p></p><p>Previous task forces will be simplified into two new Division of Enforcement task forces: the Complex Fraud Task Force and the Retail Fraud and General Enforcement Task Force. <o:p></o:p></p><p>The <strong>Complex Fraud Task Force</strong> will be responsible for all preliminary inquiries, investigations, and litigations relating to complex fraud and manipulation across all asset classes. The Acting Chief will be Deputy Director Paul Hayeck. <o:p></o:p></p><p>The <strong>Retail Fraud and General Enforcement Task Force</strong> will focus on retail fraud and handle general enforcement matters involving other violations of the Commodity Exchange Act. The Acting Chief will be Deputy Director Charles Marvine.<o:p></o:p></p><p>The new structure will better leverage staff expertise to more efficiently utilize the CFTC’s resources to prevent fraud, manipulation, and abuse and ensure market integrity.<span> </span>It also provides enhanced governance and oversight of enforcement matters to prevent overreach and enhance consistency, fairness, and due process.<span> </span><o:p></o:p></p><p>You can report suspicious activities or information, such as possible violations of commodity trading laws, to the CFTC Division of Enforcement via a Toll-Free Hotline 866-FON-CFTC (866-366-2382) or file a tip or complaint online.<o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "ff1bb8171989e0c6786eece4ebbe8668",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}