{
  "title": "Acting Chairman Pham Announces Brian Young as Director of Enforcement",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9053-25",
  "date": "2025-02-14",
  "date_standard": "2025-02-14",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9053-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9053-25</h1>\n<h1>\n<span>Acting Chairman Pham Announces Brian Young as Director of Enforcement </span>\n</h1>\n<p><b>February 14, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> —</strong> Commodity Futures Trading Commission Acting Chairman Caroline D. Pham today announced Brian Young will serve as the agency’s Director of Enforcement. Young has been serving in an acting capacity since January 22, and previously was the Director of the Whistleblower Office. He is a distinguished federal prosecutor with nearly 20 years of service at the Department of Justice, including Acting Director of Litigation for the Antitrust Division and Chief of the Litigation Unit for the Fraud Section of the Criminal Division, and has successfully tried some of the most high-profile criminal fraud and manipulation cases in the CFTC’s markets. </p><p>“Brian exemplifies the best of what we stand for at the CFTC,” said Acting Chairman Pham. “He is a fearless leader that will build an even more impressive enforcement program that will stay true to the CFTC’s mission to protect the American public from fraudsters and scammers. I am confident that under Brian’s leadership, the CFTC will expand and scale our resources to help more victims than ever before and ensure the integrity of our markets in the name of justice. Brian has hit the ground running and I look forward to seeing his continued impact to strengthen the Division of Enforcement and deliver results.” </p><p>“I want to thank Acting Chairman Pham for her confidence in me and for her commitment to continuing the CFTC’s aggressive efforts to protect our global commodity markets from fraud, manipulation, and other abusive practices,” said Young. “As former Director of the Whistleblower Officer, I worked closely with the talented and dedicated staff of the Division of Enforcement, and I look forward to working with this highly motivated group to help bring justice for victims, protect those who cannot protect themselves, and root out misconduct and wrongdoing.”</p><p><strong>Brian Young, Director of Enforcement</strong></p><p>Young joined the CFTC in 2024 as the Director of the Whistleblower Office following nearly 20 years at the Department of Justice. During his first year as the Director of the Whistleblower Office, Young oversaw a team that achieved a record high number of annual dispositions of whistleblower award applications. His most recent role at DOJ was as the Acting Director of Litigation for the Antitrust Division, where he served as the highest-ranking career official in the Antitrust Division’s litigation program. There, he oversaw criminal prosecutions brought under the Sherman Act as well as civil merger and antitrust conduct litigation.<span> </span></p><p>Before his time at the Antitrust Division, Young served in various roles in the Fraud Section of the Criminal Division, culminating in his appointment as Chief of the Fraud Section’s Litigation Unit.<span> </span>While at the Fraud Section, Young tried several of the most significant white collar crime matters in the past decade, including prosecutions of the first individuals tried in the United States on charges of manipulating the London Interbank Offered Rate (LIBOR); the former head of HSBC Bank’s Foreign Exchange (FX) desk in connection with a scheme to “frontrun” a client on a $3.5 billion FX trade; and two former London and Singapore-based Deutsche Bank precious metals traders arising from a scheme to “spoof” the futures markets by placing over $1 billion in non-bona fide orders on the Chicago Mercantile Exchange.<span> </span></p><p>Young joined the DOJ through the Attorney General’s Honors Program and began his career as a law clerk for the Honorable Alice M. Batchelder of the United States Court of Appeals for the Sixth Circuit. During his time at DOJ, Young received the Attorney General’s Award for Distinguished Service, three Assistant Attorney General’s Awards for Exceptional Service, and an Outstanding Service Award from the Washington Field Office of the Federal Bureau of Investigation. </p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "bd5bced685d9d682c79c6743013f1f82",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}