{
  "title": "CFTC Staff Issues No-Action Letter to Korea Exchange Concerning the Offer or Sale of KOSPI and Mini KOSPI 200 Futures Contracts",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9043-25",
  "date": "2025-02-04",
  "date_standard": "2025-02-04",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9043-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9043-25</h1>\n<h1>\n<span>CFTC Staff Issues No-Action Letter to Korea Exchange Concerning the Offer or Sale of KOSPI and Mini KOSPI 200 Futures Contracts </span>\n</h1>\n<p><b>February 04, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span><strong> —</strong> The Commodity Futures Trading Commission’s Division of Market Oversight today issued a no-action letter stating it will not recommend the CFTC take enforcement action against Korea Exchange (KRX) for the offer or sale of Korea Composite Stock Price Index (KOSPI) 200 Futures Contracts and Mini KOSPI 200 Futures Contracts to persons located within the United State while the Commission’s review of KRX’s forthcoming request for certification of the contracts under CFTC Regulation 30.13 is pending. DMO issued similar letters when the KOSPI 200 became a broad-based security index in 2021 and 2022. [See CFTC Press Release Nos. <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8464-21\">8464-21</a> and <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8610-22\">8610-22</a>]<o:p></o:p></p><p>The KOSPI 200 became a narrow-based security index in February 2024. Futures contracts on narrow-based security indexes are subject to joint CFTC and Securities and Exchange Commission jurisdiction. Futures contracts on non-narrow-based (also known as broad-based) security indexes are subject to exclusive CFTC jurisdiction.<o:p></o:p></p><p>The KOSPI 200 is set to become a broad-based security index on February 6, 2025, and the no-action position in DMO’s letter will be effective on that date. <o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "d0dc1b8f51fbe6789f651cbd6d84230c",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}