{
  "title": "Florida Court Orders Brazilian Nationals to Pay Over $128 Million for Fraudulent Commodity Pool Scheme",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9045-25",
  "date": "2025-02-04",
  "date_standard": "2025-02-04",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9045-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9045-25</h1>\n<h1>\n<span>Florida Court Orders Brazilian Nationals to Pay Over $128 Million for Fraudulent Commodity Pool Scheme</span>\n</h1>\n<p><b>February 04, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\">WASHINGTON, D.C.</span> — <span lang=\"EN\">The Commodity Futures Trading Commission today announced the U.S. District Court for the Southern District of Florida issued an order of default judgment against Brazilian nationals <strong>Emerson Pires</strong> and <strong>Flavio Goncalves</strong>, as well as Florida resident <strong>Joshua Nicholas</strong>, for fraud in connection with the <strong>EmpiresX</strong> commodity pool scheme and other violations of the Commodity Exchange Act and CFTC regulations.<o:p></o:p></span></p><p><span lang=\"EN\">The order requires Pires and Goncalves to pay, jointly and severally, more than $32 million in disgorgement and more than $96 million in civil monetary penalties. Nicholas is required to pay $289,000 in disgorgement and $867,000 in civil monetary penalties. The order also </span><span>permanently enjoins the three individual defendants from engaging in conduct that violates the CEA, as charged, and</span><span lang=\"EN\"> permanently </span><span>bans them from registering with the CFTC and from trading in any CFTC-regulated markets.</span><span lang=\"EN\"><o:p></o:p></span></p><p><span lang=\"EN\">The order resolves a CFTC complaint filed on June 30, 2022. [See CFTC Press Release No. </span><a href=\"https://www.cftc.gov/PressRoom/PressReleases/8551-22\"><span lang=\"EN\">8551-22</span></a><span lang=\"EN\">.] <o:p></o:p></span></p><p><span lang=\"EN\">The court previously ordered commodity pool operator <strong>Empires Consulting Corp.</strong> to pay $64 million in monetary sanctions for the fraud scheme. [See CFTC Press Release No. </span><a href=\"https://www.cftc.gov/PressRoom/PressReleases/8879-24\"><span lang=\"EN\">8879-24</span></a><span lang=\"EN\">.]<o:p></o:p></span></p><p><span lang=\"EN\"><strong>Case Background<o:p></o:p></strong></span></p><p><span lang=\"EN\">The order finds that beginning in approximately September 2020, the defendants fraudulently solicited individuals to trade commodity futures and options and other products through commodity interest pools under the name EmpiresX through the EmpiresX website and in online videos posted on social media platforms. During the relevant period, Pires and Goncalves, along with Empires Consulting, the Florida corporation that operated the EmpiresX commodity pools, accepted and pooled at least $41.6 million from over 12,500 individuals. The order finds Pires and Goncalves collectively retained over $32 million in ill-gotten gains. <o:p></o:p></span></p><p><span>According to the order, Pires, Goncalves, and Nicholas knowingly made false claims regarding the use of pool participant funds, the size of the pools, and participant returns. The order further finds Nicholas showed pool participants an account page he identified as EmpiresX’s profitable account with a large, well-known electronic trading platform, when in fact EmpiresX had no account with that platform, and defendants created a fake website that mimicked the platform’s website to mislead participants into thinking that EmpiresX was actually trading their funds. By November 2021, the defendants stopped honoring participant withdrawal requests. <o:p></o:p></span></p><p><span>The order finds Pires, Goncalves, and Nicholas acted as associated persons of a commodity pool operator, Empires Consulting Corporation, without registering as required, and committed fraud in connection with EmpiresX. It further finds Pires and Goncalves commingled pool funds in violation of the CEA.<o:p></o:p></span></p><p><span><strong>Parallel Criminal/Civil Enforcement Actions <o:p></o:p></strong></span></p><p><span>On Sept. 8, 2022, the Department of Justice announced Nicholas pleaded guilty to conspiracy to commit securities fraud in connection with his role in the EmpiresX scheme. [See DOJ press release </span><a href=\"https://www.justice.gov/opa/pr/empiresx-head-trader-pleads-guilty-global-cryptocurrency-investment-fraud-scheme-amassed\"><span>here</span></a><span>.]<o:p></o:p></span></p><p><span>On June 21, 2023, the Securities and Exchange Commission obtained default judgment against Pires and Goncalves for their role in the EmpiresX scheme. </span><em><span>SEC v. Empires Consulting Corp.</span></em><span>, No. 22-21995-Civ, ECF No. 48 (S.D. Fla. June 21, 2023).<o:p></o:p></span></p><p><span>The CFTC thanks the SEC and National Futures Association for their assistance in this matter.<o:p></o:p></span></p><p><span>The Division of Enforcement staff responsible for this matter are Heather N. Dasso, Ben Sedrish, Elizabeth N. Pendleton, Scott R. Williams, and Robert T. Howell. <o:p></o:p></span></p><p> </p><p><span>* * * * * * *<o:p></o:p></span></p><p><span><strong>Fraud Advisory <o:p></o:p></strong></span></p><p><span>The CFTC has issued several customer protection </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/index.htm\"><span>fraud advisories and articles</span></a><span>, including the </span><a href=\"https://www.cftc.gov/LearnAndProtect/AdvisoriesAndArticles/CFTCFraudAdvisories/fraudadv_commoditypool.html\"><span>Commodity Pool Fraud Advisory</span></a><span>, which </span><span style=\"background-color:white;color:black;\">provides information</span><span> about a type of fraud involving individuals and firms — often unregistered — offering investments in commodity pools </span><span style=\"background-color:white;color:black;\">and how customers can detect, avoid, and report these scams.</span><span> <o:p></o:p></span></p><p><span lang=\"EN\" style=\"background-color:white;border:1.0pt none windowtext;color:black;padding:0in;\">The CFTC also strongly urges the public to verify a company’s registration with the CFTC at </span><a href=\"http://www.nfa.futures.org/basicnet\"><span lang=\"EN\" style=\"background-color:white;border:1.0pt none windowtext;padding:0in;\">NFA BASIC</span></a><span lang=\"EN\" style=\"background-color:white;border:1.0pt none windowtext;color:black;padding:0in;\"> before committing funds. If unregistered, a customer should be wary of providing funds to that company. </span><span lang=\"EN\" style=\"background-color:white;border:1.0pt none windowtext;padding:0in;\"><o:p></o:p></span></p><p><span lang=\"EN\">Suspicious activities or information, such as possible violations of commodity trading laws, should be reported to the Division of Enforcement via a toll-free hotline 866-FON-CFTC (866-366-2382), </span><a href=\"http://www.cftc.gov/ConsumerProtection/FileaTiporComplaint/index.htm\"><span>file a tip or complaint</span></a><span> </span><span lang=\"EN\">online, or contact the CFTC Whistleblower Office at whistleblower.gov. Whistleblowers may be eligible to receive between 10 and 30 percent of the monetary sanctions collected paid from the CFTC Customer Protection Fund financed through monetary sanctions paid to the CFTC by violators of the Commodity Exchange Act.</span><o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "77aa0ca9275940d493377287d2f81ca3",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}