{
  "title": "David Gillers to Step Down as Chief of Staff",
  "url": "https://www.cftc.gov/PressRoom/PressReleases/9047-25",
  "date": "2025-02-06",
  "date_standard": "2025-02-06",
  "short_description": "",
  "article_type": "Press Release",
  "release_number": "9047-25",
  "content": "\n<h1 class=\"press-release-title\">Release Number 9047-25</h1>\n<h1>\n<span>David Gillers to Step Down as Chief of Staff </span>\n</h1>\n<p><b>February 06, 2025</b></p>\n<div class=\"field field--name-body field--type-text-with-summary field--label-hidden field--item\"><p><span class=\"DatelineChar\"><strong>WASHINGTON, D.C.</strong></span> — The Commodity Futures Trading Commission today announced that David Gillers will step down as Chief of Staff to Commissioner Behnam on February 7. From 2021 until January 20, 2025, Mr. Gillers served as Chief of Staff and Chief Operating Officer of the agency, in which capacity he was the lead advisor to then-Chairman Rostin Behnam on legal, policy and administrative matters, and was responsible for the commission’s daily operations and its 1,000 personnel. Mr. Gillers joined the agency in July 2019 as Commissioner Behnam’s Chief of Staff, and has not announced plans.<span> </span><o:p></o:p></p><p>“David has been my trusted Chief of Staff for over five and half years, and a key part of everything I have done at the Agency. He has led efforts to engage, negotiate and coordinate with members of Congress, fellow regulators, the White House and industry on all matters of the agency’s pressing needs and ably oversaw all agency operations,” said Commissioner Behnam. “He’s directed the most sensitive policy and legal conversations, while still delivering on our priorities. I wish him well as he turns to new opportunities in his career.”<o:p></o:p></p><p>“It has been an absolute pleasure to work with such a talented team at the CFTC,” said Mr. Gillers.<span> </span>“Our division directors and staff, Chairman’s Office staff, and the other Commissioners and their staff have been second to none, and have made my time at the agency memorable. I am deeply grateful to former Chairman Behnam for making this job so rewarding, and I wish Acting Chairman Pham all the best in her new role.”<span>   </span><o:p></o:p></p><p>During Mr. Gillers’ tenure, he oversaw a host of novel derivatives markets policy engagements regarding digital assets, artificial intelligence, event contracts, market structure, cybersecurity and environmental derivatives products, as well as the end of the COVID era work posture and return to office. He led the agency’s review of voluntary carbon credit derivatives and directed the development and finalizing of guidance on voluntary carbon credit derivative contracts. Mr. Gillers was instrumental in expanding the agency’s engagement in the digital asset regulatory evolution, working with policy and enforcement divisions at the agency, other regulators and departments in the federal government, as well as helping Congressional committees to develop a legislative framework.<span> </span><o:p></o:p></p><p>Prior to joining the CFTC in 2019, Mr. Gillers spent a decade on Capitol Hill focused on financial services, energy, and energy markets matters on the Senate Committee on Energy and Natural Resources and the Senate Committee on Small Business and Entrepreneurship. He worked for Senator Mary Landrieu of Louisiana, Senator Maria Cantwell of Washington, and Senator Joe Manchin of West Virginia. He worked extensively on the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, the Small Business Jobs Act of 2010, and the energy provisions of the Fixing America's Surface Transportation Act of 2015. While in Congress, he oversaw programs at the Department of the Treasury, Department of Energy, and the Small Business Administration. Mr. Gillers was a corporate attorney prior to his time in Congress.  He holds a BA from Columbia College and a JD from Boston College Law School, where he was a Weinstein Scholar.<span>     </span><o:p></o:p></p></div>\n<p align=\"center\"><b>-CFTC-</b><p>\n</p></p>",
  "id": "387b6fe009be9689220f368ef78bc04f",
  "source_type": "reg",
  "source_name": "cftc",
  "raw_content_type": "text/html"
}